[
  {
    "text": "بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "اللّهُـمَّ قِنِي عَذابَكَ يَـوْمَ تَبْعَـثُ عِبـادَك",
    "count": 3,
    "description": "",
    "reference": ""
  },
  {
    "text": "بِاسْـمِكَ اللّهُـمَّ أَمُـوتُ وَأَحْـيا",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "الـحَمْدُ للهِ الَّذي أَطْعَمَنا وَسَقانا، وَكَفانا وَآوانا، فَكَمْ مِمَّنْ لا كافِيَ لَهُ وَلا مُؤْويَ",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "اللّهُـمَّ عالِمَ الغَـيْبِ وَالشّهـادَةِ فاطِرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَيءٍ وَمَليكَـه، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْـت، أَعوذُ بِكَ مِنْ شَـرِّ نَفْسـي وَمِنْ شَـرِّ الشَّيْـطانِ وَشِرْكِـه، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "اللّهُـمَّ أَسْلَمْتُ وَجْهِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لا مَلْجَأَ وَلا مَنْجَا مِنْكَ إِلاّ إِلَيْكَ، آمَنْتُ بِكِتابِكَ الَّذي أَنْزَلْتَ وَبِنَبِيِّكَ الَّذي أَرْسَلْتَ",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "سُبْحَانَ اللَّهِ (33 مرة) الْحَمْدُ لِلَّهِ (33 مرة) اللَّهُ أَكْبَرُ (34 مرة)",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيهِمَا بِـ {قُلْ هُوَ اللَّهُ أَحَدٌ} وَ {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ} وَ {قُلْ أَعُوذُ بِرَبِّ النَّاسِ} ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقْبَلَ مِنْ جَسَدِهِ (ثَلاثَ مَرَّاتٍ)",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    "count": 1,
    "description": "",
    "reference": ""
  }
]
