[
  {
    "text": "أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما mَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "سُـبْحانَ اللهِ\nالحَمْـدُ لله\nاللهُ أكْـبَر\n\n"ثلاثا وثلاثين "\n\nلا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو علي كل شيء قدير",
    "count": 1,
    "description": "غفرت له خطاياه وإن كانت مثل زبد البحر - مسلم",
    "reference": ""
  },
  {
    "text": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ\n\nبِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ\n\nبِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ",
    "count": 1,
    "description": "ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى",
    "reference": ""
  },
  {
    "text": "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\nاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.",
    "count": 1,
    "description": "[آية الكرسى - البقرة 255]",
    "reference": ""
  },
  {
    "text": "لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير",
    "count": 1,
    "description": "عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح",
    "reference": ""
  },
  {
    "text": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
    "count": 1,
    "description": "",
    "reference": ""
  },
  {
    "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكُفْرِ وَالْفَقْرِ وَعَذَابِ الْقَبْرِ",
    "count": 1,
    "description": "عَنْ مُسْلِمِ بْنِ أَبِي بَكْرَةَ قَالَ\nكَانَ أَبِي يَقُولُ فِي دُبُرِ الصَّلَاةِ \" اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكُفْرِ وَالْفَقْرِ وَعَذَابِ الْقَبْرِ \" فَكُنْتُ أَقُولُهُنَّ فَقَالَ أَبِي : أَيْ بُنَيَّ عَمَّنْ أَخَذْتَ هَذَا ؟ قُلْتُ : عَنْكَ ، قَالَ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُهُنَّ فِي دُبُرِ الصَّلَاةِ \nوإسناد الحديث حسن ، وصححه ابن حبان في \" صحيحه \" ( 3 / 303 ) وابن خزيمة في \" صحيحه \" ( 1 / 367 ) والحاكم في \" مستدركه \" ( 1 / 383 ) والألباني في \" صحيح النسائي \" ، وقوَّاه محققو \" مسند أحمد \" ( 34 / 17 ) وغيرهم",
    "reference": ""
  }
]