class AthkarMassaText {
  static const String athkarMassa1 = """
الْحَمْدُ لِلَّهِ وَحْدَهُ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ
""";
  static const String athkarMassa1Footer = """
---------------------
 عن أنس يرفعه: لأن أقعد مع قوم يذكرون اللَّه تعالى من صلاة الغداة حتى تطلع الشمس أحبُّ إليَّ من أن أُعتق أربعة من ولد إسماعيل، ولأن أقعد مع قوم يذكرون اللَّه من صلاة العصر إلى أن تغرب الشمس أحبّ إليَّ من أن أعتق أربعة)). أبو داود، برقم ٣٦٦٧، وحسنه الألباني، في صحيح أبي داود، ٢/ ٦٩٨

""";

  static const String athkarMassa111 = """
 أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ {اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ} 
""";
  static const String athkarMassa111Footer = """
---------------------
 سورة البقرة، الآية: ٢٥٥. من قالها حين يصبح أُجير من الجن حتى يمسي، ومن قالها حين يمسي أُجير منهم حتى يصبح. أخرجه الحاكم، ١/ ٥٦٢، وصححه الألباني في صحيح الترغيب والترهيب، ١/ ٢٧٣، وعزاه إلى النسائي، والطبراني، وقال: ((إسناد الطبراني جيد)

""";

  static const String athkarMassa11 = """
بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ {قُلْ هُوَ اللَّهُ أَحَدٌ* اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ}

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ} 

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ {قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَالنَّاسِ} (ثلاثَ مرَّاتٍ) 
""";
  static const String athkarMassa11Footer = """
---------------------
 من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء. أخرجه أبو داود، ٤/ ٣٢٢، برقم ٥٠٨٢، والترمذي، ٥/ ٥٦٧، برقم ٣٥٧٥، وانظر: صحيح الترمذي، ٣/ ١٨٢

  """;
  static const String athkarMassa222 = """
أمسينا وأمسى الْمُلْكُ لِلَّهِ ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَه الليلة وَخَيرَ مَا بَعْدَهُا ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَه الليلة وَشَرِّ مَا بعدها رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ
""";
  static const String athkarMassa222Footer = """
---------------------
وإذا أصبح قال: أصبحنا وأصبح الملك للَّه

""";

  static const String athkarMassa2 = """
اللَّهُمَّ بِكَ أمسينا وَبِكَ أصبحنا ، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ المصير 
""";
  static const String athkarMassa2Footer = """
---------------------
 وإذا أصبح قال: اللَّهم بك أصبحنا وبك أمسينا وبك نحيا، وبك نموت، وإليك النشور
 الترمذي، ٥/ ٤٦٦، برقم ٣٣٩١، وانظر: صحيح الترمذي ٣/ ١٤٢

""";

  static const String athkarMassa22 = """
اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ* لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ
""";
  static const String athkarMassa22Footer = """
---------------------
أقر وأعترف *
(١) من قالها موقناً بها حين يمسي، فمات من ليلته دخل الجنة، وكذلك إذا أصبح. أخرجه البخاري، ٧/ ١٥٠، برقم ٦٣٠٦

  """;

  static const String athkarMassa3 = """
اللَّهُمَّ إِنِّي أمسيت أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ 
(أربعَ مَرَّاتٍ)
""";
  static const String athkarMassa3Footer = """
---------------------
 وإذا أصبح قال: اللَّهم إني أصبحت
 من قالها حين يصبح، أو يمسي أربع مرات، أعتقه اللَّه من النار. أخرجه أبو داود، ٤/ ٣١٧، برقم ٥٠٧١، والبخاري في الأدب المفرد، برقم ١٢٠١، والنسائي في عمل اليوم والليلة، برقم ٩، وابن السني، برقم ٧٠، وحسّن سماحة الشيخ ابن باز - رحمه الله - إسناد النسائي، وأبي داود، في تحفة الأخيار، ص٢٣

""";

  static const String athkarMassa4 = """
اللَّهُمَّ مَا أمسى بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ
""";
  static const String athkarMassa4Footer = """
---------------------
 وإذا أصبح قال: اللَّهم ما أصبح بي
 من قالها حين يصبح فقد أدَّى شكر يومه، ومن قالها حين يمسي فقد أدَّى شكر ليلته. أخرجه أبو داود، ٤/ ٣١٨، برقم ٥٠٧٥، والنسائي في عمل اليوم والليلة، برقم ٧، وابن السني، برقم ٤١، وابن حبان، ((موارد)) برقم ٢٣٦١، وحسّن ابن باز - رحمه الله - إسناده في تحفة الأخيار، ص٢٤

""";

  static const String athkarMassa44 = """
اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ

اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ
 (ثلاثَ مرَّاتٍ)
""";
  static const String athkarMassa44Footer = """
---------------------
 ابو داود، ٤/ ٣٢٤، برقم ٥٠٩٢، وأحمد، ٥/ ٤٢، برقم ٢٠٤٣٠، والنسائي في عمل اليوم والليلة، برقم ٢٢، وابن السني، برقم ٦٩، والبخاري في الأدب المفرد، برقم ٧٠١، وحسّن العلامة ابن باز - رحمه الله - إسناده في تحفة الأخيار، ص٢٦

  """;

  static const String athkarMassa5 = """
حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ
(سَبْعَ مَرّاتٍ)
""";
  static const String athkarMassa5Footer = """
---------------------
 من قالها حين يصبح وحين يمسي سبع مرات كفاه اللَّه ما أهمّه من أمر الدنيا والآخرة. أخرجه ابن السني، برقم ٧١ مرفوعاً، وأبو داود موقوفاً، ٤/ ٣٢١، برقم ٥٠٨١، وصحّح إسناده شعيب وعبد القادر الأرناؤوط. انظر: زاد المعاد ٢/ ٣٧٦

""";

  static const String athkarMassa55 = """
 اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي
""";
  static const String athkarMassa55Footer = """
---------------------
 أبو داود، برقم ٥٠٧٤، وابن ماجه، برقم ٣٨٧١، وانظر: صحيح ابن ماجه، ٢/ ٣٣٢

  """;

  static const String athkarMassa6 = """
اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ
""";
  static const String athkarMassa6Footer = """
---------------------
 الترمذي، برقم ٣٣٩٢، وأبو داود، برقم ٥٠٦٧،. وانظر: صحيح الترمذي، ٣/ ١٤٢

""";

  static const String athkarMassa66 = """
بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ 
(ثلاثَ مرَّاتٍ)
""";
  static const String athkarMassa66Footer = """
---------------------
 من قالها ثلاثاً إذا أصبح، وثلاثاً إذا أمسى لم يضره شيء. أخرجه أبو داود، ٤/ ٣٢٣، برقم، ٥٠٨٨، والترمذي، ٥/ ٤٦٥، برقم ٣٣٨٨، وابن ماجه، برقم ٣٨٦٩، وأحمد، برقم ٤٤٦. وانظر: صحيح ابن ماجه، ٢/ ٣٣٢، وحسّن إسناده العلامة ابن باز - رحمه الله - في تحفة الأخيار، ص٣٩

  """;

  static const String athkarMassa7 = """
رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - نَبِيّاً
(ثلاثَ مرَّاتٍ)
""";
  static const String athkarMassa7Footer = """
---------------------
(٣) من قالها ثلاثاً حين يصبح وثلاثاً حين يمسي كان حقاً على اللَّه أن يرضيه يوم القيامة. أحمد، ٤/ ٣٣٧، برقم ١٨٩٦٧، والنسائي في عمل اليوم والليلة، برقم ٤، وابن السني، برقم ٦٨، وأبو داود
٤/ ٣١٨، برقم ١٥٣١، والترمذي، ٥/ ٤٦٥، برقم، ٣٣٨٩، وحسّنه ابن باز - رحمه الله - في تحفة الأخيار ص٣٩

  """;

  static const String athkarMassa8 = """
يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ
""";
  static const String athkarMassa8Footer = """
---------------------
(١) الحاكم وصححه، ووافقه الذهبي، ١/ ٥٤٥، وانظر: صحيح الترغيب والترهيب، ١/ ٢٧٣

  """;
  static const String athkarMassa9 = """
 أمسينا وأمسى الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَه الليلة فَتْحَهُا، وَنَصْرَها، وَنورَها وَبَرَكَتَها، وَهُدَاها، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيها وَشَرِّ مَا بَعْدَه
""";
  static const String athkarMassa9Footer = """
---------------------
 وإذا أصبح قال: أصبحنا وأصبح الملك للَّه ربّ العالمين
 وإذا أمسى قال: اللَّهم إني أسألك خير هذه الليلة: فتحها، ونصرها، ونورها، وبركتها، وهداها، وأعوذ بك من شر ما فيها، وشر ما بعدها
 
  """;
  static const String athkarMassa10 = """
أمسينا عَلَى فِطْرَةِ الْإِسْلاَمِ ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ
""";
  static const String athkarMassa10Footer = """
---------------------
 وإذا أصبح قال: أصبحنا على فطرة الإسلام
 أحمد، ٣/ ٤٠٦، و٤٠٧، برقم ١٥٣٦٠، ورقم ١٥٥٦٣، وابن السني في عمل اليوم والليلة، برقم ٣٤، وانظر: صحيح الجامع، ٤/ ٢٠٩

 """;
  static const String athkarMassa1111 = """
سُبْحَانَ اللَّهِ وَبِحَمْدِهِ
 (مائة مرَّةٍ)
""";
  static const String athkarMassa1111Footer = """
---------------------
 من قالها مائة مرة حين يصبح وحين يمسي لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه. مسلم، ٤/ ٢٠٧١ برقم ٢٦٩٢

 """;
  static const String athkarMassa12 = """
لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ 
    (عشرَ مرَّات أَوْ مرَّةً واحدةً عندَ الكَسَل)
""";
  static const String athkarMassa12Footer = """
---------------------
 أبو داود، برقم ٥٠٧٧، وابن ماجه، برقم ٣٧٩٨، وأحمد، برقم ٨٧١٩، وانظر: صحيح الترغيب والترهيب، ١/ ٢٧٠، وصحيح أبي داود، ٣/ ٩٥٧، وصحيح ابن ماجه، ٢/ ٣٣١، وزاد المعاد، ٢/ ٣٧٧

  """;
  static const String athkarMassa13 = """
لاَ إِلَهَ إِلاَّ اللَّهُ، وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ
   (مائةَ مرَّةٍ إذا أصبحَ)
""";
  static const String athkarMassa13Footer = """
---------------------
 من قالها مائة مرة في يوم كانت له عدل عشر رقاب، وكُتِبَ له مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان يومه ذلك حتى يمسي، ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك. البخاري، ٤/ ٩٥، برقم ٣٢٩٣، ومسلم، ٤/ ٢٠٧١، برقم ٢٦٩١

 """;

  static const String athkarMassa16 = """
أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ
  (مِائَةَ مَرَّةٍ فِي الْيَوْمِ)
""";
  static const String athkarMassa16Footer = """
---------------------
 البخاري مع الفتح، ١١/ ١٠١، برقم ٦٣٠٧، ومسلم، / ٢٠٧٥، برقم ٢٧٠٢

""";
  static const String athkarMassa17 = """
أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ
  (ثلاثَ مرَّاتٍ إذا أمسى)
""";
  static const String athkarMassa17Footer = """
---------------------
 من قالها حين يمسي ثلاث مرات لم تضرّه حُمَة تلك الليلة، أخرجه أحمد، ٢/ ٢٩٠، برقم ٧٨٩٨، والنسائي في عمل اليوم والليلة، برقم ٥٩٠، وابن السني، برقم ٦٨، وانظر: صحيح الترمذي، ٣/ ١٨٧، وصحيح ابن ماجه، ٢/ ٢٦٦، وتحفة الأخيار لابن باز، ص٤٥

""";
  static const String athkarMassa18 = """
اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّد
  (عشرَ مرَّاتٍ)
""";
  static const String athkarMassa18Footer = """
---------------------
 ((من صلّى عليَّ حين يصبح عشراً، وحين يمسي عشراً، أدركته شفاعتي يوم القيامة)) أخرجه الطبراني بإسنادين: أحدهما جيد، انظر: مجمع الزوائد، ١٠/ ١٢٠، وصحيح الترغيب والترهيب، ١/ ٢٧٣

""";
}
