class AthkarBeforeGoToBedText {
  static const String athkarBeforeGoToBed1 = """
 كان رسول الله صلى الله عليه وسلم يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيهِمَا ثم يقرأ

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ {قُلْ هُوَ اللَّهُ أَحَدٌ* اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ}

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ}

بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ {قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَالنَّاسِ} ثُمَّ يَمْسَحُ بِهِمَا مَا
اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقبَلَ مِنْ جَسَدِهِ)) (يفعلُ ذلك ثلاثَ مرَّاتٍ) (١)
""";

  static const String athkarBeforeGoToBed1Footer = """
----------
(١) من قالها حين يمسي ثلاث مرات لم تضرّه حُمَة تلك الليلة، أخرجه أحمد، ٢/ ٢٩٠، برقم ٧٨٩٨، والنسائي في عمل اليوم والليلة، برقم ٥٩٠، وابن السني، برقم ٦٨، وانظر: صحيح الترمذي، ٣/ ١٨٧، وصحيح ابن ماجه، ٢/ ٢٦٦، وتحفة الأخيار لابن باز، ص٤٥
(١) البخاري مع الفتح، ٩/ ٦٢، برقم ٥٠١٧، ومسلم، برقم ٢١٩٢

 """;
// 2
  static const String athkarBeforeGoToBed2 = """
  ١٠٠ - (٢) {اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ} (٢)
 """;
  static const String athkarBeforeGoToBed2Footer = """
----------
  (٢) سورة البقرة، الاية: ٢٥٥، من قرأها إذا أوى إلى فراشه فإنه لن يزال عليه من اللَّه حافظ ولا يقربه شيطان حتى يصبح، البخاري مع الفتح، ٤/ ٤٨٧، برقم ٢٣١١
  """;
// 3
  static const String athkarBeforeGoToBed3 = """
  ١٠١ - (٣) {آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللَّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ
  الْكَافِرِينَ} (١)
""";
  static const String athkarBeforeGoToBed3Footer = """
----------
  (١) من قرأهما في ليلة كفتاه، البخاري مع الفتح، ٩/ ٩٤، برقم ٤٠٠٨، ومسلم، ١/ ٥٥٤، برقم ٨٠٧، والآيتان من سورة البقرة، ٢٨٥ - ٢٨٦
  """;

  static const String athkarBeforeGoToBed4 = """
  ١٠٢ - (٤) ((بِاسْمِكَ (٢) رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِن أَمْسَكْتَ نَفْسِي فارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ)) (٣)
   
    اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْياهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا. اللَّهُمَّ إِنِّي أَسْأَلُكَ العَافِيَةَ)) (١)
 """;
  static const String athkarBeforeGoToBed4Footer = """
----------
(١) أخرجه مسلم، ٤/ ٢٠٨٣، برقم ٢٧١٢، وأحمد بلفظه، ٢/ ٧٩، برقم ٥٥٠٢
(٢) ((إذا قام أحدكم من فراشه ثم رجع إليه فلينفضه بصَنِفَةِ إزاره ثلاث مرات، وليُسمِّ اللَّه؛ فإنه لا يدري ما خلفه عليه بعده، وإذا اضطجع فليقل: .. )) الحديث، [ومعنى بصَنِفة إزاره: طَرَفه مِمَّا يَلِي طُرَّته]. النهاية في غريب الحديث والأثر (صنف)
(٣) البخاري مع الفتح، ١١/ ١٢٦، برقم ٦٣٢٠. ومسلم، ٤/ ٢٠٨٤، برقم ٢٧١٤  
  """;

  static const String athkarBeforeGoToBed5 = """
  ١٠٤ - (٦) ((اللَّهُمَّ قِنِي (٢) عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ)) (٣)
١٠٥ - (٧) ((بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا)) (٤)
""";
  static const String athkarBeforeGoToBed5Footer = """
----------
(٢) ((كان - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - إذا أراد أن يرقد وضع يده اليمنى تحت خدِّه، ثم يقول: ... )) الحديث.
(٣) أبو داود بلفظه، ٤/ ٣١١، برقم ٥٠٤٥، والترمذي، برقم ٣٣٩٨، وانظر: صحيح الترمذي، ٣/ ١٤٣، وصحيح أبي داود، ٣/ ٢٤٠
(٤) البخاري مع الفتح، ١١/ ١١٣، برقم ٦٣٢٤، ومسلم، ٤/ ٢٠٨٣، برقم ٢٧١١
  """;

  static const String athkarBeforeGoToBed6 = """
 ١٠٦ - (٨) ((سُبْحَانَ اللَّهِ (ثلاثاً وثلاثين) وَالْحَمْدُ لِلَّهِ (ثلاثاً وثلاثين) وَاللَّهُ أَكْبَرُ (أربعاً وثلاثينَ))) (١) 
""";
  static const String athkarBeforeGoToBed6Footer = """
---------- 
(١) من قال ذلك عندما يأوي إلى فراشه كان خيراً له من خادم. البخاري مع الفتح، ٧/ ٧١، برقم ٣٧٠٥، ومسلم، ٤/ ٢٠٩١، برقم ٢٧٢٦
  """;

  static const String athkarBeforeGoToBed7 = """
  ١٠٧ - (٩) ((اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ
  فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ)) (١)
""";
  static const String athkarBeforeGoToBed7Footer = """
----------
  (١) مسلم، ٤/ ٢٠٨٤، برقم ٢٧١٣
  """;

  static const String athkarBeforeGoToBed8 = """
  ١٠٨ - (١٠) ((الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لاَ كَافِيَ لَهُ وَلاَ مُؤْوِيَ))
  
   (٢).١٠٩ - (١١) ((اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي
  وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ)) (١)
 """;
  static const String athkarBeforeGoToBed8Footer = """
----------
  (١) أبو داود، ٤/ ٣١٧، برقم ٥٠٦٧، والترمذي، برقم ٣٦٢٩، وانظر: صحيح الترمذي ٣/ ١٤٢
(٢) مسلم، ٤/ ٢٠٨٥، برقم ٢٧١٥
  """;

  static const String athkarBeforeGoToBed9 = """
  ١١٠ - (١٢) ((يَقْرَأُ {الم} تَنْزِيلَ السَّجْدَةِ، وَتَبَارَكَ الَّذي بِيَدِهِ الْمُلْكُ)) (٢)
  
  ١١١ - (١٣) ((اللَّهُمَّ (٣) أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ
  رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ)) (١)
""";
  static const String athkarBeforeGoToBed9Footer = """
----------
(١) قال - صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - لمن قال ذلك: ((فإن مُتَّ مُتَّ على الفطرة)). البخاري مع الفتح، ١١/ ١١٣، برقم ٦٣١٣، ومسلم، ٤، ٢٠٨١، برقم ٢٧١٠
(٢) الترمذي، برقم ٣٤٠٤، والنسائي في عمل اليوم والليلة، برقم ٧٠٧، وانظر: صحيح الجامع ٤/ ٢٥٥  
(٣) ((إذا أخذت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن، ثم قل: ... )) الحديث
  """;
}
