class AthkarAfterSalatText {
  static const athkarAfterSalat1 = """
أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله
""";
  static const athkarAfterSalat2 = """
اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام  

""";

  static const athkarAfterSalat33 = """
 لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير
 """;

  static const athkarAfterSalat3 = """
لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ، لهُ المُـلْكُ ولهُ الحَمْد، وهوَ على كلّ شَيءٍ قَدير، اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت، وَلا مُعْطِـيَ لِما مَنَـعْت، وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد

""";
  static const athkarAfterSalat4 = """
لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمد، وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه, لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون

""";
  static const athkarAfterSalat5 = """
سُـبْحانَ اللهِ
الحَمْـدُ لله
اللهُ أكْـبَر

"ثلاثا وثلاثين "

لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو علي كل شيء قدير

----------
غفرت له خطاياه وإن كانت مثل زبد البحر - مسلم
""";

  static const athkarAfterSalat7 = """
بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ

بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ

بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ

----------
ثلاث مرات بعد صلاتي الفجر والمغرب. ومرة بعد الصلوات الأخرى

""";
  static const athkarAfterSalat6 = """
أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. 

----------
[آية الكرسى - البقرة 255] 
""";
  static const athkarAfterSalat8 = """
 لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ، لهُ المُلكُ ولهُ الحَمْد، يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير
----------
 عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح
""";

  static const athkarAfterSalat9 = """
اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ
""";

  static const athkarAfterSalat10 = """
اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكُفْرِ وَالْفَقْرِ وَعَذَابِ الْقَبْرِ 
----------
 عَنْ مُسْلِمِ بْنِ أَبِي بَكْرَةَ قَالَ
كَانَ أَبِي يَقُولُ فِي دُبُرِ الصَّلَاةِ " اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكُفْرِ وَالْفَقْرِ وَعَذَابِ الْقَبْرِ " فَكُنْتُ أَقُولُهُنَّ فَقَالَ أَبِي : أَيْ بُنَيَّ عَمَّنْ أَخَذْتَ هَذَا ؟ قُلْتُ : عَنْكَ ، قَالَ : إِنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَقُولُهُنَّ فِي دُبُرِ الصَّلَاةِ 
وإسناد الحديث حسن ، وصححه ابن حبان في " صحيحه " ( 3 / 303 ) وابن خزيمة في " صحيحه " ( 1 / 367 ) والحاكم في " مستدركه " ( 1 / 383 ) والألباني في " صحيح النسائي " ، وقوَّاه محققو " مسند أحمد " ( 34 / 17 ) وغيرهم 
""";
}
