class DuaMenSunnahText {
  static const String duamensunnah13 = """
٥٥ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَفِتْنَةِ الْقَبْرِ، وَعَذَابِ الْقَبْرِ، وَشَرِّ فِتْنَةِ الْغِنَى، وَشَرِّ فِتْنَةِ الْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ قَلْبِي بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنْ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنْ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْكَسَلِ وَالْمَأْثَمِ وَالْمَغْرَمِ)) (١)

٥٦ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ، وَالْكَسَلِ، وَالْجُبْنِ، وَالْهَرَمِ، والْبُخْلِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا
""";
  static const String duamensunnah13_Footer= """
---------------------
(١) البخاري، برقم ٨٣٢، ومسلم، برقم ٥٨٩

 """;

  static const String duamensunnah14 = """
   وَالْمَمَاتِ)) (١)

٥٧ - ((اللهمَّ إنِّي أعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الْأَعْدَاءِ)) (٢)

٥٨ - ((اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ)) (٣)

٥٩ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى، وَالتُّقَى
""";
  static const String duamensunnah14_Footer= """
---------------------
(١) البخاري، برقم ٢٨٢٣، ومسلم، برقم ٢٧٠٦
(٢) البخاري، برقم ٦٣٤٧، ومسلم، برقم ٢٧٠٧، ولفظه: ((كان رسول الله - صلى الله عليه وسلم - يتعوذ من جهد البلاء، ودرك الشقاء، وسوء القضاء، وشماتة الأعداء))
(٣) أخرجه مسلم، برقم ٢٧٢٠

""";

  static const String duamensunnah15 = """
   وَالْعَفَافَ، وَالْغِنَى)) (١)

٦٠ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ، وَالْكَسَلِ، وَالْجُبْنِ، وَالْبُخْلِ، وَالْهَرَمِ، وَعَذَابِ الْقَبْرِ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا)) (٢)

٦١ - ((اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالسَّدَادَ)) (٣)

٦٢ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ
""";
  static const String duamensunnah15_Footer= """
---------------------
(١) أخرجه مسلم، برقم ٢٧٢١
(٢) أخرجه مسلم، برقم ٢٧٢٢
(٣) أخرجه مسلم، برقم ٢٧٢٥

""";
  static const String duamensunnah16 =
      """ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ)) (١)

٦٣ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ، وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ)) (٢)

٦٤ - ((اللَّهُمَّ أكْثِرْ مَالِي، وَوَلَدِي، وَبَارِكْ لِي فِيمَا أعْطَيْتَنِي)) (٣)، (([وَأطِلْ حَيَاتِي عَلَى طَاعَتِكَ، وَأحْسِنْ عَمَلِي،] وَاغْفِرْ لِي)) (٤)
""";
  static const String duamensunnah16_Footer="""
---------------------
(١) أخرجه مسلم، برقم ٢٧٣٩
(٢) مسلم، برقم ٢٧١٦
(٣) يدل عليه دعاء النبي - صلى الله عليه وسلم - لأنس: ((اللهمّ أكثر ماله، وولده، وبارك له فيما أعطيته)) البخاري، برقم ١٩٨٢، ومسلم، برقم ٦٦٠
(٤) البخاري في الأدب المفرد، برقم ٦٥٣، وصححه الألباني في سلسلة الأحاديث الصحيحة، برقم ٢٢٤١، وفي صحيح الأدب المفرد، ص ٢٤٤، وما بين المعقوفين يدل عليه قوله - صلى الله عليه وسلم - عندما سئل: من خير الناس؟ فقال: ((من طال عمره وحسن عمله))، الترمذي، برقم ٢٣٢٩، وأحمد، برقم ١٧٧١٦، وصححه الألباني في صحيح الترمذي، ٢/ ٢٧١، وقد سألت سماحة شيخنا ابن باز رحمه الله عن الدعاء به وهل هو سنة؟ فقال: ((نعم))

""";
  static const String duamensunnah17 =
      """ ٦٥ - ((لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ، وَرَبُّ الْأَرْضِ، وَرَبُّ الْعَرْشِ الْكَرِيمِ)) (١)

٦٦ - ((اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ لَا إِلَهَ إِلَّا أَنْتَ)) (٢)

٦٧ - ((لاَ إِلَهَ إِلاَّ أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ
""";
  static const String duamensunnah17_Footer ="""
---------------------
(١) البخاري، برقم ٦٣٤٥، ومسلم، برقم ٢٧٣٠
(٢) أبو داود، برقم ٥٠٩٠، وأحمد، ٥/ ٤٢، وحسنه الألباني في صحيح أبي داود، ٣/ ٢٥٠، وفي صحيح الأدب المفرد، ٢٦٠، وقد حسن إسناده أيضاً العلامة ابن باز في تحفة الأخيار، ص ٢٤

""";
  static const String duamensunnah18 = """ مِنَ الظَّالِمِينَ)) (١)

٦٨ - ((اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي)) (٢)

---------------------
(١) الترمذي، برقم ٣٥٠٥، والحاكم، وصححه ووافقه الذهبي، ١/ ٥٠٥، وصححه الألباني في صحيح الترمذي، ٣/ ١٦٨، ولفظه: ((دعوة ذي النون إذْ دعاه وهو في بطن الحوت: {أَنْ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ}، فإنه لم يدعُ بها رجل مسلم في شيء قط إلا استجاب الله له))
(٢) أحمد، ١/ ٣٩١، ٤٥٢، والحاكم، ١/ ٥٠٩، وحسنه الحافظ في تخريج الأذكار، وصححه الألباني في تخريج الكلم الطيب، ص٧٣

""";
  static const String duamensunnah19 =
      """ ٦٩ - ((اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ)) (١)

٧٠ - ((يَا مُقَلِّبَ القُلُوبِ ثَبِّت قَلْبِي عَلَى دِينِكَ)) (٢)

٧١ - ((اللَّهُمَّ إنِّي أسْألُكَ [الْيَقِينَ] و [الْعَفْوَو] الْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ)) (٣)
""";
  static const String duamensunnah19_Footer ="""
---------------------
(١) مسلم، برقم ٢٦٥٤
(٢) الترمذي، برقم ٣٥٢٢، وأحمد، ٤/ ١٨٢، والحاكم، ١/ ٥٢٥، و٥٢٨، وصححه ووافقه الذهبي، وصححه الألباني في صحيح الجامع، ٦/ ٣٠٩، وصحيح الترمذي، ٣/ ١٧١. وقد قالت أم سلمة رضي الله عنها: ((كان أكثر دعائه - صلى الله عليه وسلم -))
(٣) الترمذي، برقم ٣٥١٤، والبخاري في الأدب المفرد، برقم ٧٢٦، ولفظه عند الترمذي: ((سلوا الله العافية في الدنيا والآخرة))، وفي لفظ: ((سلوا الله العفو والعافية فإن أحداً لم يعط بعد اليقين خيراً من العافية))، وقد صححه الألباني في صحيح ابن ماجه، ٣/ ١٨٠، و٣/ ١٨٥
و٣/ ١٧٠، وله شواهد، انظرها في: مسند الإمام أحمد بترتيب أحمد شاكر، ١/ ١٥٦ - ١٥٧

""";
  static const String duamensunnah20 =
      """ ٧٢ - ((اللهمّ أحْسِنْ عَاقِبَتَنَا فِي الأُمُورِ كُلِّهَا، وَأجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ)) (١)

٧٣ - ((رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَلَا تَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الهُدَى إِلَيَّ، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ، رَبِّ اجْعَلْنِي لَكَ شَكَّارًا، لَكَ ذَكَّارًا، لَكَ رَهَّابًا، لَكَ مِطْوَاعًا، إِلَيْكَ مُخْبِتًا أَوَّاهاً مُنِيبًا، رَبِّ تَقَبَّلْ تَوْبَتِي، وَاغْسِلْ حَوْبَتِي، وَأَجِبْ دَعْوَتِي، وَثَبِّتْ حُجَّتِي، وَاهْدِ قَلْبِي، وَسَدِّدْ لِسَانِي، وَاسْلُلْ سَخِيمَةَ قَلْبِي)) (٢)
""";
  static const String duamensunnah20_Footer="""
---------------------
(١) أحمد، ٤/ ١٨١، والطبراني في الكبير، ٢/ ٣٣/ ١١٦٩، وفي الدعاء، برقم ١٤٣٦، وابن حبان، برقم ٢٤٢٤، ٢٤٢٥ (موارد)، قال الحافظ الهيثمي في مجمع الزوائد، ١٠/ ١٧٨: ((رجال أحمد وأحد أسانيد الطبراني ثقات))
(٢) البخاري في الأدب المفرد، برقم ٦٦٤، و٦٦٥، وأبو داود، برقم ١٥١٠، ١٥١١، والترمذي، برقم ٣٥٥١، وابن ماجه، برقم ٣٨٣٠، وأحمد ١/ ١٢٧، والحاكم وصححه ووافقه الذهبي، ١/ ٥١٩، وصححه الألباني في صحيح أبي داود، ١/ ٤١٤، وفي صحيح الترمذي، ٣/ ١٧٨

""";
  static const String duamensunnah21 =
      """٧٤ - ((اللَّهُمَّ إِنَّا نَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ - صلى الله عليه وسلم -، وَنَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ - صلى الله عليه وسلم -، وَأَنْتَ الْمُسْتَعَانُ، وَعَلَيْكَ الْبَلَاغُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ)) (١)

٧٥ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي، وَمِنْ شَرِّ بَصَرِي، وَمِنْ شَرِّ لِسَانِي، وَمِنْ شَرِّ قَلْبِي، وَمِنْ شَرِّ مَنِيِّي)) (٢)
""";
  static const String duamensunnah21_Footer="""
---------------------
(١) الترمذي، برقم ٣٥٢١، وابن ماجه، برقم ٣٨٤٦، بمعناه، وقال الترمذي: ((هذا حديث حسن غريب))، وضعفه الألباني في ضعيف الترمذي، ص ٣٨٧
(٢) أبو داود، برقم ١٥٥١، والترمذي، برقم ٣٤٩٢، والنسائي، برقم ٥٤٧٠، وغيرهم. وصححه الألباني في صحيح الترمذي، ٣/ ١٦٦، وصحيح النسائي، ٣/ ١١٠٨

 """;
  static const String duamensunnah22 =
      """ ٧٦ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَمِنْ سَيِّئِ الأَسْقَامِ)) (١)

٧٧ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الْأَخْلَاقِ، وَالْأَعْمَالِ، وَالْأَهْوَاءِ)) (٢)

٧٨ - ((اللَّهُمَّ إِنَّكَ عُفُوٌّ كَرِيمٌ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي)) (٣)

٧٩ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ
""";
  static const String duamensunnah22_Footer="""
---------------------
(١) أبو داود، برقم ١٥٥٤، والنسائي، برقم ٥٤٩٣، وأحمد، ٣/ ١٩٢ وصححه الألباني في صحيح النسائي، ٣/ ١١١٦، وصحيح الترمذي ٣/ ١٨٤
(٢) الترمذي، برقم ٣٥٩١، وابن حبان، برقم ٢٤٢٢ (موارد)، والحاكم، ١/ ٥٣٢، والطبراني في الكبير، ١٩/ ١٩/٣٦. وصححه الألباني في صحيح الترمذي، ٣/ ١٨٤
(٣) الترمذي، برقم ٣٥١٣، والنسائي في الكبرى، برقم ٧٧١٢، وصححه الألباني في صحيح الترمذي، ٣/ ١٧٠

""";
  static const String duamensunnah24 =
      """الْمُنْكَرَاتِ، وَحُبَّ الْمَسَاكِينِ، وَأَنْ تَغْفِرَ لِي، وَتَرْحَمَنِي، وَإِذَا أَرَدْتَ فِتْنَةَ قَوْمٍ فَتَوَفَّنِي غَيْرَ مَفْتُونٍ، وَأَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَحُبَّ عَمَلٍ يُقَرِّبُنِي إِلَى حُبِّكَ)) (١)

٨٠ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ: عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ. اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ
""";
  static const String duamensunnah24_Footer="""
---------------------
(١) أخرجه أحمد بلفظه، ٥/ ٢٤٣ والترمذي، برقم ٣٢٣٥، بنحوه، وحسنه، وقال: سألت محمد بن إسماعيل - يعني البخاري - فقال: ((هذا حديث حسن صحيح))، وفي آخر الحديث قال - صلى الله عليه وسلم -: ((إنها حقٌّ فادرسوها وتعلّموها))، والحاكم ١/ ٥٢١، وصححه الألباني في صحيح الترمذي، ٣/ ٣١٨

 """;
  static const String duamensunnah25 =
      """ مِنْ شَرِّ [مَا اسْتَعَاذَ بِكَ] [مِنْهُ] عَبْدُكَ وَنَبِيُّكَ. اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا)) (١)

٨١ - ((اللَّهُمَّ احْفَظنِي بالإِسْلاَمِ قائِماً، واحْفَظْنِي بالإِسْلاَمِ قاعِداً، واحْفَظنِي بالإِسْلاَمِ راقِداً، ولا تُشْمِتْ بِي عَدُوّاً ولا حاسِداً. اللَّهُمَّ إِنِّي أسْألُكَ مِنْ كُلِّ خَيْر خزائِنُهُ بِيَدِكَ، وأعُوذُ بِكَ مِنْ كُلِّ شَرٍّ خَزَائِنُهُ بِيَدِكَ)) (٢)
""";
  static const String duamensunnah25_Footer="""
---------------------
(١) ابن ماجه، برقم ٣٨٤٦، بلفظه، وأحمد، ٦/ ١٣٤، ولفظ الزيادة الثانية له، والحاكم وصححه، ووافقه الذهبي، ١/ ٥٢١، ولفظ الزيادة الأولى له، وصححه الألباني في صحيح ابن ماجه، ٢/ ٣٢٧
(٢) الحاكم، ١/ ٥٢٥ وصححه ووافقه الذهبي، وحسنه الألباني في صحيح الجامع، ٢/ ٣٩٨، وفي سلسلة الأحاديث الصحيحة، ٤/ ٥٤، برقم ١٥٤٠

""";
  static const String duamensunnah26 =
      """٨٢ - ((اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا تَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ، وَمِنَ الْيَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا، اللَّهُمَّ مَتِّعْنَا بِأَسْمَاعِنَا، وَأَبْصَارِنَا، وَقُوَّاتِنَا مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الْوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَى مَنْ عَادَانَا، وَلَا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا، وَلَا تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا، وَلَا مَبْلَغَ عِلْمِنَا، وَلَا تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا)) (١)

٨٣ - ((اللَّهُمَّ إنِّي أَعوذُ بِكَ مِنَ الجُبْنِ، وَأعُوذُ
""";
  static const String duamensunnah26_Footer="""
---------------------
(١) الترمذي، برقم ٣٥٠٢، والحاكم، ١/ ٥٢٨ وصححه ووافقه الذهبي، وابن السني، برقم ٤٤٦، وحسنه الألباني في صحيح الترمذي، ٣/ ١٦٨، وصحيح الجامع، ١/ ٤٠٠

 """;
  static const String duamensunnah27 =
      """ بِكَ مِنَ البُخْلِ، وَأعُوذُ بِكَ مِنْ أنْ أُرَدَّ إِلَى أَرْذَلِ العُمُرِ، وَأعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ القَبْرِ)) (١)

٨٤ - ((اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي، وَجَهْلِي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي هَزْلِي، وَجِدِّي، وَخَطَئي، وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي)) (٢)

٨٥ - ((اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ)) (٣)

٨٦ - ((اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ
""";
  static const String duamensunnah27_Footer="""
---------------------
(١) البخاري، برقم ٢٨٢٢
(٢) متفق عليه: البخاري، برقم ٦٣٩٨، ومسلم، برقم ٢٧١٩
(٣) متفق عليه: البخاري، برقم ٨٣٤، مسلم، برقم ٢٧٠٥

""";
  static const String duamensunnah28 =
      """ وَعَلَيْكَ تَوَكَّلْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ. اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ لَا إِلَهَ إِلَّا أَنْتَ أَنْ تُضِلَّنِي، أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ، وَالْجِنُّ وَالْإِنْسُ يَمُوتُونَ)) (١)

٨٧ - ((اللَّهُمَّ إنَّا نَسْألُكَ مُوجِباتِ رَحْمَتِكَ، وَعَزائِمَ مَغْفِرَتِكَ، والسَّلامَةَ مِنْ كُلِّ إثمٍ، والغَنِيمَةَ مِنْ كُلِّ بِرٍّ، والفَوْزَ بالجَنَّةِ، والنَّجاةَ مِنَ النَّارِ)) (٢)

٨٨ - ((اللَّهُمَّ اغْفِرْ لِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ)) (٣)
""";
  static const String duamensunnah28_Footer="""
---------------------
(١) متفق عليه: البخاري، برقم ٦٣٩٨، ومسلم، برقم ٢٧١٩
(٢) الحاكم، ١/ ٥٢٥، وصححه، ووافقه الذهبي، والبيهقي في الدعوات، برقم ٢٠٦، وانظر: الأذكار للنووي، ص٣٤٠، فقد حسنه المحقق عبد القادر الأرنؤوط
(٣) لحديث عبادة - رضي الله عنه -، قال: سمعت النبي - صلى الله عليه وسلم - يقول: ((من استغفر للمؤمنين والمؤمنات كتب الله له بكل مؤمن ومؤمنة حسنة))، الطبراني في الكبير، ٥/ ٢٠٢، برقم ٥٠٩٢، و٣/ ٣٣٤، وبرقم ٢١٥٥، وجوَّد إسناده الهيثمي في مجمع الزوائد، ١٠/ ٢١٠، وحسَّنه الألباني في صحيح الجامع، برقم ٥٩٠٢، ٥/ ٢٤٢

""";
  static const String duamensunnah29 =
      """ ٨٩ - ((اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَوَسِّعْ لِي فِي دَارِي، وَبَارِكْ لِي فِيمَا رَزَقْتَنِي)) (١)

٩٠ - ((اللَّهُمَّ إنِّي أَسْأَلُك مِنْ فَضْلِكَ وَرَحْمَتِكَ؛ فَإِنَّهُ لاَ يَمْلِكُهَا إِلاَّ أَنْتَ)) (٢)

٩١ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَرَمِ، وَالتَّرَدِّي، وَالْهَدْمِ، وَالْغَمِّ، وَالْغَرَقِ، وَالْحَرَقِ، وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِيَ الشَّيْطَانُ عِنْدَ الْمَوْتِ، وَأَعُوذُ بِكَ أَنْ أَمُوتَ
""";
  static const String duamensunnah29_Footer="""
---------------------
(١) أخرجه أحمد، ٤/ ٦٣، برقم ١٦٥٩٩، ورقم ٢٣١١٤، ورقم ٢٣١٨٨، والترمذي، برقم ٣٥٠٠، وقال محققو المسند، ٢٧/ ١٤٤، وفي ٣٨/ ١٩٧، وفي ٣٨/ ١٤٥: ((حسن لغيره))، وحسنه الألباني في صحيح الجامع، ١/ ٣٩٩
(٢) أخرجه الطبراني. وقال الهيثمي في مجمع الزوائد، ١٠/ ١٥٩: ((رجاله رجال الصحيح غير محمد بن زياد وهو ثقة))، وصححه الألباني في صحيح الجامع، ١/ ٤٠٤، برقم ١٢٧٨

""";
  static const String duamensunnah31 =
      """ فِي سَبِيلِكَ مُدْبِرًا، وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا)) (١)

٩٢ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُوعِ؛ فَإِنَّهُ بِئْسَ الضَّجِيعُ، وَأَعُوذُ بِكَ مِنَ الْخِيَانَةِ؛ فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ)) (٢)

٩٣ - ((اللَّهُمَّ إنِّي أعُوذُ بِكَ مِنَ العَجْزِ، والكَسَلِ، والجُبْنِ، والبُخْلِ، والهَرَمِ، والقَسْوَةِ، والغَفْلَةِ، والعَيْلَةِ، والذِّلَّةِ، والمَسْكَنَةِ، وأعُوذُ بِكَ مِنَ الفَقْرِ، والكُفْرِ، والفُسُوقِ، والشِّقاقِ، والنِّفاقِ، والسُّمْعَةِ، والرِّياءِ، وأعُوذُ بِكَ مِنَ الصَّمَمِ، والبَكَمِ، والجُنُونِ
""";
  static const String duamensunnah31_Footer="""
---------------------
(١) أخرجه أبو داود، برقم ١٥٥٢، والنسائي، برقم ٥٥٣١، ورقم ٥٥٣٢، وصححه الألباني في صحيح النسائي، ٣/ ١١٢٣، وصحيح سنن أبي داود، ١/ ٤٢٥
(٢) أخرجه أبو داود، برقم ١٥٤٧، والنسائي، برقم ٥٤٨٣، وحسنه الألباني في صحيح النسائي، ٣/ ١١١٢

""";
  static const String duamensunnah32 =
      """ والجُذامِ، والبَرَصِ، وَسَيِّىءِ الأَسْقامِ)) (١)

٩٤ - ((اللهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ، [وَالْفَاقَةِ]، وَالْقِلَّةِ، وَالذِّلَّةِ، وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أو أُظْلَمَ)) (٢)

٩٥ - ((اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ جَارِ السُّوءِ فِي دَارِ الْمُقَامَةِ؛ فَإِنَّ جَارَ الْبَادِيَةِ يَتَحَوَّلُ)) (٣)

٩٦ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لاَ يَخْشَعُ، ومِنْ َدُعَاءٍ لاَ يُسْمَعُ، وَمِنْ نَفْسٍ لاَ

  """;static const String duamensunnah32_Footer ="""
---------------------
(١) أخرجه النسائي، برقم ٥٤٩٣، والحاكم، ١/ ٥٣٠، وصححه الألباني في صحيح الجامع، ١/ ٤٠٦، وإرواء الغليل، برقم ٨٥٢
(٢) أخرجه أبو داود، برقم ١٥٤٤،والنسائي، برقم ٥٤٧٥،وصححه الألباني في صحيح النسائي
٣/ ١١١١، وصحيح الجامع، ١/ ٤٠٧، وما بين المعقوفين عند ابن حبان (موارد)، وصححه الألباني، في صحيح موارد الظمآن، ٢/ ٤٥٥
(٣) البخاري في الأدب المفرد، برقم ١١٧، والحاكم، ١/ ٥٣٢، وصححه ووافقه الذهبي، وأخرجه النسائي، برقم ٥٥١٧، وصححه الألباني في صحيح الجامع، ١/ ٤٠٨، وصحيح النسائي، ٣/ ١١١٨

""";
  static const String duamensunnah34 =
      """ تَشْبَعُ، وَمِنْ عِلْمٍ لاَ يَنْفَعُ، أَعُوذُ بِكَ مِنْ هُؤُلاَءِ الأَرْبَعِ)) (١).

٩٧ - ((اللَّهُمَّ إنّي أعُوذُ بِكَ مِنْ يَوْمِ السُّوءِ، وَمِنْ لَيْلَةِ السُّوءِ، وَمِنْ سَاعَةِ السُّوءِ، وَمِنْ صَاحِبِ السُّوءِ، وَمِنْ جَارِ السُّوءِ في دَارِ الْمُقامَةِ)) (٢)

٩٨ - ((اللَّهُمَّ إنِّي أَسْأَلُكَ الْجَنَّةَ وَأَسْتَجِيْرُ بِكَ مِنَ النَّارِ)) (ثَلاَثَ مَرَّاتٍ) (٣)
""";
  static const String duamensunnah34_Footer ="""
---------------------
(١) الترمذي، برقم ٣٤٨٢، وأبو داود، برقم ١٥٤٩، وصححه العلامة الألباني في صحيح الجامع، برقم ١٢٩٥، وصحيح النسائي، ٣/ ١١١٣
(٢) أخرجه الطبراني وقال الهيثمي في الزوائد، ١٠/ ١٤٤: ((ورجاله رجال الصحيح)). وحسنه الألباني في صحيح الجامع، ١/ ٤١١، برقم ١٢٩٠
(٣) أخرجه الترمذي، برقم ٢٥٧٢، وابن ماجه، برقم ٣٣٤٠، والنسائي، برقم ٥٥٣٦، وصححه الألباني في صحيح الترمذي، ٢/ ٣١٩، وصحيح النسائي، ٣/ ١١٢١، ولفظه: ((من سأل الله الجنة ثلاث مرات قالت الجنة: اللهمّ أدخله الجنة ومن استجار من النار ثلاث مرات قالت النار: اللهمّ أجره من النار))

""";
  static const String duamensunnah35 =
      """ ٩٩ - ((اللَّهُمَّ فَقِّهْنِي فِي الدِّينِ)) (١)

١٠٠ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لاَ أَعْلَمُ)) (٢)

١٠١ - ((اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي، وَعَلِّمْنِي مَا يَنْفَعُنِي، وَزِدْنِي عِلْمًا)) (٣)

١٠٢ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا
"""; 

  static const String duamensunnah35_Footer =
  """
---------------------
(١) يدل عليه رواية البخاري ومسلم في دعاء النبي - صلى الله عليه وسلم - لابن عباس رضي لله عنهما. البخاري، برقم ١٤٣، ومسلم، برقم ٢٤٧٧
(٢) رواه أحمد، ٤/ ٤٠٣، وابن أبي شيبة، ١٠/ ٣٣٧، والطبراني في المعجم الأوسط
٤/ ٢٨٤، وحسنه الألباني في صحيح الترغيب والترهيب، ١/ ١٩
(٣) أخرجه الترمذي، برقم ٣٥٩٩، وابن ماجه، برقم ٢٥٩،وصححه الألباني في صحيح ابن ماجه، ١/ ٤٧

""";
  static const String duamensunnah36 =
      """ طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا)) (١)

١٠٣ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا أَللَّهُ بِأَنَّكَ الْوَاحِدُ الْأَحَدُ، الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ)) (٢)

١٠٤ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ، لاَ إِلَهَ إِلاَّ أَنْتَ [وَحْدَكَ لاَ شَرِيكَ لَكَ] الْمَنَّانُ [يَا] بَدِيعَ السَّمَوَاتِ وَالأَرْضِ، يَا ذَا الْجَلالِ وَالإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ، إِنِّي أَسْأَلُكَ [الْجَنَّة
""";
  static const String duamensunnah36_Footer="""
---------------------
(١) أخرجه ابن ماجه، برقم ٩٢٥،والنسائي في عمل اليوم والليلة، برقم ١٠٢،وأحمد، ٦/ ٢٩٤
و٣٠٥، وصححه الألباني في صحيح ابن ماجه، ١/ ١٥٢
(٢) أخرجه النسائي، برقم ١٣٠٠، واللفظ له، والنسائي في الكبرى، برقم ٧٦٦٥، وأبو داود، برقم ٩٨٥، وصححه الألباني في صحيح سنن النسائي، ١/ ١٤٧

""";
  static const String duamensunnah37 = """
   وَأَعُوذُ بِكَ مِنَ النَّارِ])) (١)

١٠٥ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللهُ لاَ إِلَهَ إِلاَّ أَنْتَ، الأَحَدُ، الصَّمَدُ، الَّذِي لَمْ يَلِدْ، وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ)) (٢)

١٠٦ - ((رَبِّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الْغَفُورُ)) (٣)
""";
  static const String duamensunnah37_Footer= """
---------------------
(١) أبو داود، برقم ١٤٩٥، وابن ماجه، برقم ٣٨٥٨، والنسائي، برقم ١٢٩٩، والترمذي، برقم ٣٥٤٤، وصححه الألباني في صحيح النسائي، ١/ ٢٧٩، وفي صحيح ابن ماجه، ٢/ ٣٢٩
(٢) أبو داود، برقم ٩٨٥، والترمذي، برقم ٣٤٧٥، وابن ماجه، برقم ٣٨٥٧، وأحمد ٥/ ٣٦٠، وصححه الألباني في صحيح سنن الترمذي، ٣/ ١٦٣
(٣) أبو داود، برقم ١٥١٨، والترمذي، برقم ٣٤٣٤، واللفظ له، والنسائي في الكبرى، بر قم ١٠٢٩٢، وابن ماجه، برقم ٣٨١٤، وصححه الألباني في صحيح ابن ماجه، ٢/ ٣٢١، وفي صحيح الترمذي، ٣/ ١٥٣

  """;
  static const String duamensunnah38 =
      """ ١٠٧ - ((اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ، وَقُدْرَتِكَ عَلَى الْخَلْقِ، أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيمَاً لاَ يَنْفَدُ، وأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعْ، وَأَسْأَلُكَ الرِّضَا بَعَدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأْلُكَ لَذَّةَ النَّظَرِ إلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ، فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلاَ فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ)) (١)
""";
  static const String duamensunnah38_Footer="""
---------------------
(١) النسائي، برقم ١٣٠٥، وأحمد، ٤/ ٢٦٤، وصححه الألباني في صحيح النسائي، ١/ ٢٨٠
و١/ ٢٨١

""";
  static const String duamensunnah39 =
      """ ١٠٨ - ((اللَّهُمَّ ارزُقني حُبَّكَ، وحُبَّ مَنْ يَنْفَعُني حُبُّهُ عندَك، اللَّهُمَّ مَا رَزَقْتَني مِمَّا أُحِبُّ فَاجْعَلْهُ قُوَّةً لِي فِيمَا تُحِبُّ، اللَّهُمَ مَا زَوَيْتَ عَنِّي مِمَّا أُحِبُّ فَاجْعَلْهُ فَرَاغاً لِي فِيمَا تُحِبُّ)) (١)

١٠٩ - ((اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، اللَّهُمَّ نَقِّنِي مِنْهَا كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنْ الدَّنَسِ، اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ)) (٢)
""";
  static const String duamensunnah39_Footer="""
---------------------
(١) أخرجه الترمذي، برقم ٣٤٩١، وحسنه. وقال الشيخ عبد القادر الأرنؤوط: ((وهو كما قال)). انظر تحقيقه لجامع الأصول، ٤/ ٣٤١
(٢) أخرجه مسلم، برقم ٤٧٦، والنسائي، برقم ٤٠٠

""";
  static const String duamensunnah40 =
      """١١٠ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَالْجُبْنِ، وَسُوءِ الْعُمُرِ، وَفِتْنَةِ الصَّدْرِ، وَعَذَابِ الْقَبْرِ)) (١)

١١١ - ((اللَّهُمَّ رَبَّ جِبْرَائِيلَ، وَمِيكَائِيلَ، وَرَبَّ إِسْرَافِيلَ، أَعُوذُ بِكَ مِنَ حَرِّ النَّارِ، وَمِنْ عَذَابِ الْقَبْرِ)) (٢)

١١٢ - ((اللَّهُمَّ أَلْهِمْنِي رُشْدِي، وَأَعِذْنِي مِنْ شَرِّ نَفْسِي)) (٣)
""";
  static const String duamensunnah40_Footer="""
---------------------
(١) النسائي، برقم ٥٤٦٩، ولفظه: ((كان النبي - صلى الله عليه وسلم - يتعوذ من خمس: من البخل، والجبن، وسوء العمر، وفتنة الصدر، وعذاب القبر))، وأخرجه أبو داود، برقم ١٥٣٩، وحسنه الأرنؤوط في تخريجه لجامع الأصول، ٤/ ٣٦٣
(٢) أخرجه النسائي، برقم ١٣٤٤، وأحمد، ٦/ ٦١، والبيهقي في الدعوات، برقم ١٠٩، وصححه الألباني في صحيح النسائي، ٣/ ١١٢١، وسلسلة الأحاديث الصحيحة، برقم ١٥٤٤
(٣) رواه الترمذي واللفظ له، ٥/ ٥١٩، برقم ٣٤٨٣، وأخرجه أحمد، ٢٣/ ١٩٧، برقم ١٩٩٩٢،، والحاكم، ١/ ٥١٠، بنحوه أيضاً. وقال محققو المسند عن الحديث عند أحمد، ٣٣/ ١٩٧: ((إسناده صحيح على شرط الشيخين ... ))، وأما لفظ الترمذي فضعفه الألباني في ضعيف الترمذي، ص ٣٧٩

 """;
  static const String duamensunnah41 =
      """١١٣ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَأَعُوذُ بِكَ مِنْ عِلْمٍ لاَ يَنْفَعُ)) (١)

١١٤ - ((اللَّهُمَّ رَبَّ السَّمَوَاتِ [السَّبْعِ] وَرَبَّ الْأَرْضِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِر
""";
  static const String duamensunnah41_Footer= """
---------------------
(١) أخرجه النسائي في الكبرى، برقم ٧٨٦٧، وابن ماجه، برقم ٣٨٤٣، وحسنه الألباني في صحيح سنن ابن ماجه، ٢/ ٣٢٧، ولفظه: ((سلوا الله علماً نافعاً، وتعوذوا بالله من علم لا ينفع))

 """;
  static const String duamensunnah42 =
      """فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ)) (١)

١١٥ - ((اللَّهُمَّ أَلِّفْ بَيْنَ قُلُوبِنَا، وَأَصْلِحْ ذَاتَ بَيْنِنَا، وَاهْدِنَا سُبُلَ السَّلَامِ، وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ، وَجَنِّبْنَا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ، وَبَارِكْ لَنَا فِي أَسْمَاعِنَا، وَأَبْصَارِنَا، وَقُلُوبِنَا، وَأَزْوَاجِنَا، وَذُرِّيَّاتِنَا، وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ، وَاجْعَلْنَا شَاكِرِينَ لِنِعَمِكَ مُثْنِينَ بِهَا عَلَيْكَ، قَابِلِينَ لَهَا، وَأَتِمِمْهَا عَلَيْنَا)) (٢)
""";
  static const String duamensunnah42_Footer="""
---------------------
(١) أخرجه مسلم، برقم ٢٧١٣، عن أبي هريرة - رضي الله عنه -
(٢) أخرجه أبو داود، برقم ٩٦٩، والحاكم، واللفظ له ١/ ٢٦٥، وقال: ((صحيح على شرط مسلم))، ووافقه الذهبي، ١/ ٢٦، وصححه الألباني في صحيح الأدب المفرد، برقم ٦٣٠

 """;
  static const String duamensunnah43 =
      """١١٦ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَسْأَلَةِ، وَخَيْرَ الدُّعَاءِ، وَخَيْرَ النَّجَاحِ، وَخَيْرَ الْعَمَلِ، وَخَيْرَ الثَّوَابِ، وَخَيْرَ الْحَيَاةِ، وَخَيْرَ الْمَمَاتِ، وَثَبِّتْنِي، وَثَقِّل مَوَازِينِي، وَحَقِّقْ إِيمَانِي، وَارْفَعْ دَرَجَاتِي، وَتَقَبَّلْ صَلاَتِي، وَاغْفِرْ خَطِيئَتِي، وَأَسْأَلُكَ الدَّرَجَاتِ العُلاَ مِنَ الْجَنَّةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ فَوَاتِحَ الْخَيْرِ، وَخَوَاتِمَهُ، وَجَوَامِعَهُ، وَأَوَّلَهُ، وَظَاهِرَهُ، وَبَاطِنَهُ 
وَالدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ آمِينْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ مَا آتِي، وَخَيْرَ مَا أَفْعَلُ، وَخَيْرَ مَا أَعْمَلُ، وَخَيْرَ مَا بَطَنَ، وَخَيْرَ مَا ظَهَرَ، وَالدَّرَجَاتِ العُلَا مِنَ الْجَنَّةِ آمِينْ، اللَّهُمَّ إنِّي أَسْأَلُكَ أنْ تَرْفَعَ ذِكْرِي، وَتَضَعَ وِزْرِي، وَتُصْلِحَ أمْرِي، وَتُطَهِّرَ قَلْبِي، وَتُحَصِّنَ

 """;
  static const String duamensunnah45 =
      """فَرْجِي، وَتُنَوِّرَ قَلْبِي، وَتَغْفِرَ لِي ذَنْبِي، وَأَسْأَلُكَ الدَّرَجَاتِ الْعُلَا مِنَ الْجَنَّةِ آمِينْ، اللَّهُمَّ إنِّي أَسْأَلُكَ أنْ تُبَارِكَ فِي نَفْسِي، وَفِي سَمْعِي، وَفِي بَصَرِي، وَفِي رُوحِي، وَفِي خَلْقِي، وَفِي خُلُقِي، وَفِي أَهْلِي، وَفِي مَحْيَايَ، وَفِي مَمَاتِي، وَفِي عَمَلِي، فَتَقَبَّلْ حَسَنَاتِي، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَا مِنَ الْجَنَّةِ، آمِينْ)) (١)

١١٧ - ((اللَّهُمَّ جَنِّبْنِي مُنْكَرَاتِ اَلْأَخْلَاقِ، وَالْأَهْوَاءِ، وَالْأَعْمَالِ، وَالْأَدْوَاءِ)) (٢)
""";
  static const String duamensunnah45_Footer="""
---------------------
(١) أخرجه الحاكم عن أم سلمة مرفوعاً، ١/ ٥٢٠، وصححه ووافقه الذهبي، ١/ ٥٢٠، والبيهقي في الدعوات، برقم ٢٢٥، والطبراني في الكبير، ٢٣/ ٣٢٦، برقم ٧١٧
(٢) أخرجه الحاكم، ١/ ٥٢٣، وقال: ((صحيح على شرط مسلم))، ووافقه الذهبي، ١/ ٥٣٢، وأخرجه الطبراني في المعجم الكبير، ١٩/ ١٩ برقم ٣٦، وصححه الألباني في ظلال الجنة، برقم ١٣

 """;
  static const String duamensunnah46 =
      """١١٨ - ((اللَّهُمَ قَنِّعْنِي بِمَا رَزَقْتَنِي، وَبَارِكْ لي فِيهِ، وَاخْلُفْ عَلَيَّ كُلَّ غَائِبَةٍ لِي بِخَيْرٍ)) (١)

١١٩ - ((اللَّهُمَّ حَاسِبْنِي حِسَابَاً يَسِيرَاً)) (٢)

١٢٠ - ((اللَّهُمَّ أعِنَّا عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ)) (٣)
""";
  static const String duamensunnah46_Footer="""
---------------------
(١) أخرجه الحاكم، ١/ ٥٣٢، وصححه ووافقه الذهبي، ١/ ٥١٠، عن ابن عباس رضي الله عنهما، والبيهقي في الآداب، برقم ١٠٨٤، وفي الدعوات الكبير، ٢١١، وحسنه الحافظ ابن حجر في الفتوحات الربانية، ٤/ ٣٨٣
(٢) رواه أحمد، ٦/ ٤٨، والحاكم، ١/ ٢٥٥، وقال: ((صحيح على شرط مسلم))، ووافقه الذهبي، ١/ ٢٥٥، قالت عائشة رضي الله عنها: فلما انصرف قلت: يا نبي الله ما الحساب اليسير؟ قال: ((أن ينظر في كتابه فيتجاوز عنه إنه من نوقش الحساب يومئذ يا عائشة هلك، وكل ما يصيب المؤمن يكفر الله - عز وجل - به عنه حتى الشوكة تشوكه))، وقال عنه العلامة الألباني في مشكاة المصابيح: ((وإسناده جيد))
(٣) أخرجه أحمد، ٢/ ٢٩٩، والحاكم، ١/ ٤٩٩، وصححه، ووافقه الذهبي، وهو كما قالا، وهو عند أبي داود، برقم ١٥٢٤، والنسائي في الكبرى، برقم ٩٩٧٣، وصححه الألباني في صحيح الأدب المفرد، برقم ٥٣٤

 """;
  static const String duamensunnah47 =
      """١٢١ - ((اللَّهُمّ إِنِّي أَسْأَلُكَ إِيمَانًا لاَ يَرْتَدُّ، وَنَعِيمًا لاَ يَنْفَدُ، وَمُرَافَقَةَ مُحَمَّدٍ - صلى الله عليه وسلم - فِي أَعْلَى جَنَّةِ الْخُلْدِ)) (١)

١٢٢ - ((اللَّهُمَّ قِنِي شَرَّ نَفْسِي، وَاعْزِمْ لِي عَلَى أَرْشَدِ أَمْرِي، اللَّهُمَّ اغْفِرْ لِي مَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَخْطَأْتُ، وَمَا عَمَدْتُ، وَمَا عَلِمْتُ، وَمَا جَهِلْتُ)) (٢)
""";
  static const String duamensunnah47_Footer="""
---------------------
(١) أخرجه ابن حبان (موارد)، ص ٦٠٤، برقم ٢٤٣٦، عن ابن مسعود - رضي الله عنه - موقوفاً، ورواه أحمد من طريق آخر، ١/ ٣٨٦، ٤٠٠، والنسائي في عمل اليوم والليلة، برقم ٨٦٩، وحسنه الألباني في السلسلة الصحيحة، تحت رقم ٢٣٠١ 
(٢) أخرجه النسائي في الكبرى، ٦/ ٢٤٦، برقم ١٠٨٣٠، والحاكم، ١/ ٥١٠ وصححه، ووافقه الذهبي، وأخرجه أحمد، ٤/ ٤٤٤، والمسند المحقق، ٣٣/ ١٩٧، برقم ١٩٩٩٢، وقال الحافظ في الإصابة: ((إسناده صحيح))، وصححه الألباني في تخريج رياض الصالحين، في تعليقه على الحديث رقم ١٤٩٥

 """;
  static const String duamensunnah48 =
      """١٢٣ - ((اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَغَلَبَةِ الْعَدُوِّ، وَشَمَاتَةِ الأعْدَاءِ)) (١)

١٢٤ - ((اللَّهُمَّ اغْفِرْ لِي، وَاهْدِنِي، وَارْزُقْنِي، وَعَافِنِي، أَعُوذُ بِاللَّهِ مِنْ ضِيقِ الْمَقَامِ يَوْمَ الْقِيَامَةِ)) (٢)

١٢٥ - ((اللَّهُمَّ مَتِّعْنِي بِسَمْعِي، وَبَصَرِي، وَاجْعَلْهُمَا الْوَارِثَ مِنِّي، وَانْصُرْنِي عَلَى
""";
  static const String duamensunnah48_Footer="""
---------------------
(١) أخرجه النسائي، برقم ٥٤٧٥، وأحمد ٢/ ١٧٣، وصححه الألباني في صحيح النسائي
٣/ ١١١٣
(٢) النسائي، برقم ١٦١٧، وابن ماجه، برقم ١٣٥٦، وصححه الألباني في صحيح سنن النسائي، ١/ ٣٥٦، وفي صحيح ابن ماجه، ١/ ٢٢٦

 """;
  static const String duamensunnah49 =
      """مَنْ يَظْلِمُنِي، وَخُذْ مِنْهُ بِثَأْرِي)) (١)

١٢٦ - ((اللَّهُمَّ إنِّي أسْألُكَ عِيشَةً نَقِيَّةً، ومِيتَةً سَوِيَّةً، ومَرَدّاً غَيْرَ مَخْزٍ ولا فاضِحٍ)) (٢)

١٢٧ - ((اللَّهُمَّ لَكَ الْحَمْدُ كُلُّهُ، اللَّهُمَّ لاَ قَابِضَ لِمَا بَسَطْتَ، وَلاَ بَاسِطَ لِمَا قَبَضْتَ، وَلاَ هَادِيَ لِمَنْ أَضْلَلْتَ، وَلاَ مُضِلَّ لِمَنْ هَدَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُقَرِّبَ لِمَا بَاعَدْتَ، وَلاَ مُبَاعِدَ لِمَا قَرَّبْتَ، اللَّهُمَّ ابْسُطْ عَلَيْنَا مِن
""";
  static const String duamensunnah49_Footer="""
---------------------
(١) أخرجه الترمذي، برقم ٣٦٨١، والبخاري في الأدب المفرد، برقم ٦٥٠، والحاكم
١/ ٥٢٣، وصححه ووافقه الذهبي، وحسنه الألباني في صحيح الترمذي، ٣/ ١٨٨
(٢) أخرجه الحاكم، ١/ ٥٤١، وزوائد مسند البزار، ٢/ ٤٤٢، برقم ٢١٧٧، والطبراني في الدعاء، برقم ١٤٣٥، وقال الهيثمي في مجمع الزوائد، ١٠/ ١٧٩: ((إسناد الطبراني جيد))

 """;
  static const String duamensunnah50 =
      """بَرَكَاتِكَ، وَرَحْمَتِكَ، وَفَضْلِكَ، وَرِزْقِكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ الْمُقِيمَ الَّذِي لاَ يَحُولُ وَلاَ يَزُولُ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ الْعَيْلَةِ، وَالأَمْنَ يَوْمَ الْخَوْفِ، اللَّهُمَّ إِنِّي عَائِذٌ بِكَ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَنَا، اللَّهُمَّ حَبِّبْ إِلَيْنَا الإِيمَانَ وَزِيِّنْهُ فِي قُلُوبِنَا، وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ، اللَّهُمَّ تَوَفَّنَا مُسْلِمِينَ، وَأَحْيِنَا مُسْلِمِينَ، وَأَلْحِقْنَا بِالصَّالِحِينَ غَيْرَ خَزَايَا وَلاَ مَفْتُونِينَ، اللَّهُمَّ قَاتِلِ الْكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ، وَيَصُدُّونَ عَنْ سَبِيلِكَ، وَاجْعَلْ عَلَيْهِمْ رِجْزَكَ وَعَذَابَكَ، اللَّهُمَّ قَاتِلْ كَفَرَةَ الَّذِين

 """;
  static const String duamensunnah51 =
      """أُوتُوا الْكِتَابَ، إِلَهَ الْحَقِّ [آمِينْ])) (١)

١٢٨ - ((اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي، وَارْزُقْنِي)) (٢)

(( ... وَاجْبُرْنِي، وَارْفَعْنِي)) (٣)

١٢٩ - ((اللَّهُمَّ زِدْنَا وَلَا تَنْقُصْنَا، وَأَكْرِمْنَا وَلَا تُهِنَّا، وَأَعْطِنَا وَلَا تَحْرِمْنَا، وَآثِرْنَا وَلَا تُؤْثِرْ
""";
  static const String duamensunnah51_Footer="""
---------------------
(١) أحمد بلفظه، ٣/ ٤٢٤، و٢٤/ ٢٤٦، برقم ١٥٤٩٢، وما بين المعقوفين للحاكم، ١/ ٥٠٧، ٣/ ٢٣ - ٢٤، وأخرجه البخاري في الأدب المفرد، برقم ٦٩٩، وصححه الألباني في تخريج فقه السيرة، ص ٢٨٤، وفي صحيح الأدب المفرد للبخاري، برقم ٥٣٨، ص ٢٥٩، وقال محققو المسند، ٢٤/ ٢٤٦: ((رجاله ثقات))
(٢) مسلم، برقم ٢٦٩٦، ورقم ٢٦٩٧، وفي رواية لمسلم: ((فإن هؤلاء تجمع لك دنياك وآخرتك))، وفي سنن أبي داود، برقم ٨٥٠: قال: ((فلما ولَّى الأعرابي قال النبي - صلى الله عليه وسلم -: ((لقد ملأ يديه من الخير))
(٣) انظر: الترمذي، برقم ٢٨٤، وابن ماجه، برقم ٨٩٨، وصححه الألباني في صحيح ابن ماجه، ١/ ١٤٨، وصحيح الترمذي، ١/ ٩٠

 """;
  static const String duamensunnah52 =
      """عَلَيْنَا، وَأرْضِنَا وَارْضَ عَنَّا)) (١)

١٣٠ - ((اللَّهُمَّ أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي)) (٢)

١٣١ - ((اللَّهُمَّ ثَبِّتْنِي وَاجْعَلْنِي هَادِياً مَهْدِيَّاً)) (٣)

١٣٢ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ، وَأَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ، وَحُسْنَ عِبَادَتِكَ، وَأَسْأَلُكَ
""";
  static const String duamensunnah52_Footer="""
---------------------
(١) الترمذي، ٥/ ٣٢٦، برقم ٣١٧٣، والحاكم، ٢/ ٩٨، وصححه، وحسنه الشيخ عبد القادر الأرنؤوط في تحقيقه لجامع الأصول، ١١/ ٢٨٢، برقم ٨٨٤٧
(٢) أخرجه أحمد، ٦/ ٦٨، و١٥٥، و١/ ٤٠٣، وابن حبان (٢٤٢٣ - موارد)،والطيالسي،٣٧٤، ومسند أبي يعلى، برقم ٥٠٧٥، وصححه الألباني في إرواء الغليل، ١/ ١١٥، برقم ٧٤
(٣) دلّ عليه دعاء النبي - صلى الله عليه وسلم - لجرير - رضي الله عنه -. انظر: البخاري، برقم ٦٣٣٣، وكذلك بأرقام ٣٠٢٠، ٣٠٣٦، وغيرها 

 """;
  static const String duamensunnah53 =
      """قَلْبَاً سَلِيمَاً، وَلِسَانَاً صَادِقَاً، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أنْتَ عَلاَّمُ الْغُيُوبِ)) (١)

١٣٣ - ((اللَّهُمَّ إنِّي أَسْأَلُكَ الْفِرْدَوْسَ أَعْلَى الْجَنَّة)) (٢)

  """;static const String duamensunnah53_Footer="""
---------------------
(١) أحمد، ٢٨/ ٣٣٨، برقم ١٧١١٤، و٢٨/ ٣٥٦، برقم ١٧١٣٣، والترمذي، برقم ٣٤٠٧، والطبراني في المعجم الكبير بلفظه، برقم ٧١٣٥، وبرقم ٧١٥٧، و٧١٧٥، ورقم ٧١٧٦، و٧١٧٧، و٧١٧٨، و٧١٧٩، و ٧١٨٠، وأخرجه ابن حبان في صحيحه، ٣/ ٢١٥، برقم ٩٣٥، و٥/ ٣١٠، برقم ١٩٧٤، وحسنه شعيب الأرنؤوط في صحيح ابن حبان، ٥/ ٣١٢، وحسنه بطرقه محققو المسند، ٢٨/ ٣٣٨، وذكره الألباني سلسلة الأحاديث الصحيحة في المجلد السابع، برقم ٣٢٢٨، وفي صحيح موارد الظمآن، برقم ٢٤١٦، ٢٤١٨، وقال: ((صحيح لغيره))
(٢) مأخوذ من قول النبي - صلى الله عليه وسلم -: (( ... فَإذِا سَأَلْتُمُ اللهَ فَاسْأَلُوهُ الْفِرْدَوْسَ؛ فَإِنًّهُ أَوْسَطُ الْجَنَّةِ، وَأَعْلَى الْجَنَّةِ، وَفَوْقَهُ عَرْشُ الرَّحْمَنِ، وَمِنْهُ تُفَجَّرُ أَنْهَارُ الْجَنَّةِ)). البخاري، برقم ٢٧٩٠، ورقم ٧٤٢٣

 """;
  static const String duamensunnah54 =
      """١٣٤ - ((اللَّهُمَّ جَدِّدِ الإيْمَانَ فِي قَلْبِي)) (١)

١٣٥ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ صَلَاةٍ لَا تَنْفَعُ)) (٢)

١٣٦ - ((اللَّهُمَّ إنِّي أّعُوذُ بِكَ مِنْ جَارِ السُّوءِ، وَمِنْ زَوْجٍ تُشَيِّبُنِي قَبْلَ المَشِيبِ، وَمِنْ وَلَدٍ يَكُونُ عَليَّ رَبّاً، وَمِنْ مَالٍ يَكُونُ عَلَيَّ عَذَابَاً، وَمِنْ خَلِيْلٍ مَاكِرٍ عَيْنُهُ تَرَانِي، وَقَلْبُهُ يَرْعَانِي؛ إِنْ رَأَى حَسَنَةً دَفَنَهَا، وَإِذَا
""";
  static const String duamensunnah54_Footer="""
---------------------
(١) مقتبس من حديث عبد الله بن عمر رضي الله عنهما، قال: قال رسول الله - صلى الله عليه وسلم -: ((إنّ الإِيمانَ لَيَخْلَقُ في جَوْفِ أحدِكُمْ كما يَخْلَقُ الثَّوْبُ الخَلقُ، فاسْأَلُوا اللَّهَ أن يُجَدِّدَ الإِيمانَ في قُلُوبِكُمْ))، الحاكم
١/ ٤، وصححه، ووافقه الذهبي، وقال الهيثمي في مجمع الزوائد، ١/ ٥٢: ((رواه الطبراني في الكبير، وإسناده حسن))، وحسنه الألباني في سلسلة الأحاديث الصحيحة
٤/ ١١٣، برقم ١٥٨٥
(٢) أبو داود، برقم ١٥٤٩، وصححه الألباني في صحيح سنن أبي داود، ١/ ٤٢٤

 """;
  static const String duamensunnah55 = """
  رَأَى سَيِّئَةً أَذَاعَهَا)) (١)

١٣٧ - ((اللَّهُمَّ لاَ تُخْزِنِي يَوْمَ الْقِيَامَةِ)) (٢)

١٣٨ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ الْمُعَافَاةَ فِي الدُّنْيَا وَالْآخِرَةِ)) (٣)

١٣٩ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لاَ يَنْفَعُ، وَعَمَلٍ لاَ يُرْفَعُ، وَقَلَبٍ لاَ يَخْشَعُ، وَقَولٍ لاَ يُسْمَعُ)) (٤)
""";
  static const String duamensunnah55_Footer= """
---------------------
(١) الطبراني في الدعاء، ٣/ ١٤٢٥، برقم ١٣٣٩، وقال الألباني في سلسلة الأحاديث الصحيحة، ٧/ ٣٧٧، برقم ٣١٣٧،: ((قلت: وهذا إسناد جيد، رجاله كلهم من رجال التهذيب ... ))
(٢) أحمد في المسند، ٢٩/ ٥٩٦، برقم ١٨٠٥٦، وقال محققو المسند: ((إسناده صحيح))، وأخرجه الطبراني في المعجم الكبير، ٣/ ٢٠، برقم ٢٥٢٤ بلفظ: ((اللهم لا تخزني يوم القيامة، ولا تخزني يوم البأس))
(٣) ابن ماجه، برقم ٣٨٥١، وصححه الألباني في صحيح ابن ماجه، ٣/ ٢٥٩، وفي سلسلة الأحاديث الصحيحة، برقم ١١٣٨.
(٤) أخرجه ابن حبان، برقم ٢٤٤٠ (موارد)، وصححه الألباني في صحيح موارد الظمآن
٢/ ٤٥٤، برقم ٢٠٦٦

 """;
  static const String duamensunnah56 =
      """١٤٠ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ)) (١)

١٤١ - ((اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوذُ بِكَ مِنَ الْفِتَنِ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدَّجالِ)) (٢)

١٤٢ - ((اللَّهُمَّ إِنِّي أَسْأَلُكَ شَهَادَةً فِي سَبِيلِكَ)) (٣)
""";
  static const String duamensunnah56_Footer="""
---------------------
(١) البخاري، برقم ٦٣٦٣، قال أنس: ((كُنْتُ أَخْدُمُ رَسُولَ اللهِ - صلى الله عليه وسلم - كُلَّمَا نَزَلَ، فَكُنْتُ أَسْمَعُهُ يُكْثِرُ أَنْ يَقُولَ: ((اللهُمَّ إِنِّي أَعُوذُ بِكَ ... ))
(٢) مسلم، برقم ٢٨٦٧، وفيه: ((تَعَوَّذُوا بِاَللَّهِ مِنْ عَذَاب النَّار)) ... ، [تَعَوَّذُوا بِاَللَّهِ مِنْ عَذَاب الْقَبْر ... ] إلى آخره
(٣) مسلم، برقم ١٩٠٩، مقتبس من قوله - صلى الله عليه وسلم -: ((مَنْ سَأَلَ اللَّهَ الشَّهَادَةَ بِصِدْقٍ بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ، وَإِنْ مَاتَ عَلَى فِرَاشِهِ))

 """;
  static const String duamensunnah57=
      """١٤٣ - ((اللَّهُمَّ اغْفِرْ لِي، اللَّهُمَّ اجْعَلْنِي يَوْمَ الْقِيَامَةِ فَوْقَ كَثِيرٍ مِنْ خَلْقِكَ مِنَ النَّاسِ، اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَأَدْخِلْنِي يَوْمَ الْقِيَامَةِ مُدْخَلاً كَرِيمًا)) (١)
١٤٤ - ((اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّمَا قْضَيْتَ، إِنَّهُ لا يَذِلُّ مَنْ وَالَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ)) (٢)
""";
  static const String duamensunnah57_Footer="""
---------------------
(١) البخاري، برقم ٤٣٢٣، ومسلم، برقم ٢٤٩٨، وهو مقتبس من دعاء النبي - صلى الله عليه وسلم - لعُبَيْدٍ أبي عامر، ومن دعائه - صلى الله عليه وسلم - لأبي بردة رضي الله عنهما
(٢) أحمد في المسند، ٣/ ٢٤٩، برقم ١٧٢٣، وقال محققو المسند، ٣/ ٢٤٩: ((إسناده صحيح))، وهذه رواية مطلقة غير مقيدة بالوتر كما جاء في الرواية الأخرى، ففي هذه الرواية قال أنس - رضي الله عنه -: ((وكان يعلمنا هذا الدعاء ... ))

 """;
  static const String duamensunnah58 =
      """١٤٥ - ((رَبِّ اغْفِرْ لِي خَطِيئَتِي يَوْمَ الدِّينِ)) (١)

١٤٦ - ((أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ)) (٢)

١٤٧ - ((اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَأَذْهِبْ غَيْظَ قَلْبِي، وَأَعِذْنِي مِنْ مُضِلاتِ الْفِتَنِ)) (٣)
""";
  static const String duamensunnah58_Footer ="""
---------------------
(١) مسلم، برقم ٢١٤، قيل للنبي - صلى الله عليه وسلم -: يَا رَسُولَ اللهِ، إِنَّ ابْنَ جُدْعَانَ كَانَ فِي الْجَاهِلِيَّةِ يَصِلُ الرَّحِمَ، وَيُطْعِمُ الْمِسْكِينَ، فَهَلْ ذَاكَ نَافِعُهُ؟ قَالَ: ((لَا يَنْفَعُهُ، إِنَّهُ لَمْ يَقُلْ يَوْمًا رَبِّ اغْفِرْ لِي خَطِيئَتِي يَوْمَ الدِّينِ))
(٢) الترمذي، برقم ٣٥٧٧، وصححه الألباني في صحيح الترمذي، ٣/ ٤٦٩: ((مَنْ قَالَهُ غَفَرَ اللهُ لَهُ وَإِنْ كَانَ فَرَّ مِنْ الزَّحْفِ))
(٣) مأخوذ من دعاء النبي - صلى الله عليه وسلم - لعائشة رضي الله عنها: ((اللهمَّ اغفرْ لهَا ذنبَهَا، وأذْهِبْ غَيْظَ قَلْبِهَا، وَأَعِذْهَا مِنْ مُضِلاّتِ الفِتَنْ)) أخرجه ابن عساكر بإسناده في ((الأربعين في مناقب أمهات المؤمنين))، ص ٨٥ عن عائشة رضي الله عنها، وقال: ((هذا حديث صحيح حسن، من حديث بقية بن الوليد))، وأخرجه ابن السني بنحوه في عمل اليوم والليلة، برقم ٤٥٧، وفي نسخة أخرى لابن السني قال: ((وأجرني من الشيطان)) بدل: ((من مضلات الفتن))، وانظر تخريجه عند الألباني في الضعيفة، برقم ٤٢٠٧

وله شاهد عن أم سلمة رضي الله عنها عند أحمد، برقم ٢٦٥٧٦، ٤٤/ ٢ بنحوه، ولفظه: ((قُولِي اللَّهُمَّ رَبَّ مُحَمَّدٍ النَّبِيِّ اغْفِرْ لِي ذَنْبِي، وَأَذْهِبْ غَيْظَ قَلْبِي، وَأَجِرْنِي مِنْ مُضِلَّاتِ الْفِتَنِ مَا أَحْيَيْتَنَا))، وحسنه الهيثمي في مجمع الزوائد، ١٠/ ٢٧، وهو عند الطبراني في المعجم الكبير، ٢٣/ ٣٣٨، برقم ٧٨٥، بدون لفظة: ((ما أحييتنا))
وله شاهد عن أم هانئ رضي الله عنها قالت: يَا رَسُولَ اللَّهِ عَلِّمْنِي دَعاءً أَدْعُو بِهِ، قَالَ: ((قُولِي: اللَّهُمَّ اغْفِرْ لِي ذَنْبِي ... )) الحديث، أخرجه الخرائطي في اعتلال القلوب، برقم ٥٢، ومساوئ الأخلاق، برقم ٣٢٣

 """;
  static const String duamensunnah59 =
      """١٤٨ - ((اللَّهُمَّ أَحْيِنِي عَلَى سُنَّةِ نَبِيِّكَ - صلى الله عليه وسلم - وَتَوَفَّنِي عَلَى مِلَّتِهِ، وَأَعِذْنِي مِنْ مُضِلاَّتِ الْفِتَنِ)) (١)
""";
  static const String duamensunnah59_Footer="""
---------------------
(١) أخرجه البيهقي في الكبرى، ٥/ ٩٥ من دعاء ابن عمر موقوفاً عليه، وقد نقل ذلك ابن الملقن في البدر المنير، ٦/ ٣٠٩، وقال نقلاً عن الضياء: ((إسنادها جيد)). وقال ابن مسعود - رضي الله عنه -: ((لا يقل أحدكم: اللهم إني أعوذ بك من الفتنة، فليس أحد إلا وهو مشتمل على فتنة؛ لأن الله يقول: {إِنَّمَا أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ} [التغابن: ١٥]، فأيكم استعاذ فليستعذ بالله من مضلات الفتن))، أخرجه ابن جرير، في تفسيره، ١٣/ ٤٧٥، برقم ١٥٩١٢، وذكره ابن بطال في شرحه على صحيح البخاري، ٤/ ١٣

 """;

  static const String duamensunnah60 =
      """١٤٩ - ((اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ، وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ، وَعَلَى آلِ إِبْرَاهِيمَ، [فِي الْعَالَمِينَ] إِنَّكَ حَمِيدٌ مَجِيدٌ)) (١)

والحمد لله رب العالمين، كما يليق بجلاله، وعظيم سلطانه، اللهم صلِّ وسلِّم على نبينا محمد، وعلى آله، وأصحابه، وأتباعه بإحسان إلى يوم الدين
""";
  static const String duamensunnah60_Footer="""
---------------------
(١) البخاري، برقم ٣٣٧٠، وما بين المعقوفين من حديث أبي هريرة - رضي الله عنه - عند مسلم، برقم ٤٠٥ 

 """;
}
