class DuaMenQuranText {
  static const String duamenquran1 = """ 
 الْحَمْدُ لِلهِ وَحْدَهُ، وَالصَّلاةُ وَالسَّلاَمُ عَلَى مَنْ لاَ نَبِيَّ بَعْدَهُ.

١ - {بِسْمِ اللَّهِ الرَّحْمَنِ الرَّحِيمِ * الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ * الرَّحْمَنِ الرَّحِيمِ * مَالِكِ يَوْمِ الدِّينِ * إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ * اهْدِنَا الصِّرَاط الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ} (١).

٢ - {رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ} (٢).

٣ - {وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ} (٣).

٤ - {رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ

---------------------
(١) سورة الفاتحة، الآيات ١ - ٧.
(٢) سورة البقرة، الآية: ١٢٧.
(٣) سورة البقرة، الآية: ١٢٨.

  """;

  static const String duamenquran2 = """ 
  
حَسَنَةً وَقِنَا عَذَابَ النَّارِ} (١).

٥ - {سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ} (٢).

٦ - {رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ} (٣).

٧ - {رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ} (٤).

٨ - {رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ} (٥).

---------------------
(١) سورة البقرة، الآية: ٢٠١.
(٢) سورة البقرة، الآية: ٢٨٥.
(٣) سورة البقرة، الآية: ٢٨٦.
(٤) سورة آل عمران، الآية: ٨.
(٥) سورة آل عمران، الآية: ١٦.

  """;

  static const String duamenquran3 = """ 
٩ - {رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ} (١).

١٠ - {رَبَّنَا آمَنَّا بِمَا أَنزَلَتْ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ} (٢).

١١ - {ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ} (٣).

١٢ - {رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ * رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ * رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ * رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى

\n---------------------
(١) سورة آل عمران، الآية: ٣٨.
(٢) سورة آل عمران، الآية: ٥٣.
(٣) سورة آل عمران، الآية: ١٤٧.
  
  """;

  static const String duamenquran4 = """ 
رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ} (١).

١٣ - {رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ} (٢).

١٤ - {رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ} (٣).

١٥ - {رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ} (٤).

١٦ - اللَّهُمَّ {أَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الْغَافِرِينَ* وَاكْتُبْ لَنَا فِي هَذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ} (٥).

١٧ - {حَسْبِيَ اللَّهُ لا إِلَهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ

---------------------
(١) سورة آل عمران، الآيات: ١٩١ - ١٩٤.
(٢) سورة المائدة، الآية: ٨٣.
(٣) سورة الأعراف، الآية: ٢٣.
(٤) سورة الأعراف، الآية: ٤٧.
(٥) سورة الأعراف، الآيتان: ١٥٥ - ١٥٦. 

  """;

  static const String duamenquran5 = """ 
رَبُّ الْعَرْشِ الْعَظِيمِ} (١).

١٨ - {رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ * وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ} (٢).

١٩ - {رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ} (٣).

٢٠ - )) اللَّهُم يا {فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ} (٤).

٢١ - {رَبِّ اجْعَلْ هَذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَن

---------------------
(١) سورة التوبة، الآية: ١٢٩.
(٢) سورة يونس، الآيتان: ٨٥ - ٨٦.
(٣) سورة هود، الآية: ٤٧.
(٤) سورة يوسف، الآية: ١٠١،وانظر للفائدة: كتاب الفوائد لابن القيم، ص ٤٣٦، و٤٣٧.

  """;

  static const String duamenquran6 = """ 
  نَّعْبُدَ الأَصْنَامَ} (١).

٢٢ - {رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ} (٢).

٢٣ - {رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ} (٣).

٢٤ - {رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا} (٤).

٢٥ - {رَبِّ اشْرَحْ لِي صَدْرِي* وَيَسِّرْ لِي أَمْرِي* وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي، يَفْقَهُوا قَوْلِي} (٥).

---------------------
(١) سورة إبراهيم، الآية: ٣٥.
(٢) سورة إبراهيم، الآية: ٤٠.
(٣) سورة إبراهيم، الآية: ٤١.
(٤) سورة الكهف، الآية: ١٠.
(٥) سورة طه، الآيات: ٢٥ - ٢٨.  

  """;

  static const String duamenquran7 = """ 

 ٢٦ - {رَّبِّ زِدْنِي عِلْمًا} (١).

٢٧ - {لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ} (٢).

٢٨ - {رَبِّ لا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ} (٣).

٢٩ - {رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ * وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ} (٤).

٣٠ - {رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ} (٥).

٣١ - {رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ} (٦).

---------------------
(١) سورة طه، الآية: ١١٤.
(٢) سورة الأنبياء، الآية: ٨٧.
(٣) سورة الأنبياء، الآية: ٨٩.
(٤) سورة المؤمنون، الآيتان: ٩٧ - ٩٨.
(٥) سورة المؤمنون، الآية: ١٠٩.
(٦) سورة المؤمنون، الآية: ١١٨.

  """;

  static const String duamenquran8 = """ 
٣٢ - {رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا*إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا} (١).

٣٣ - {رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا} (٢).

٣٤ - {رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ* وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الآخِرِينَ * وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ} (٣).

٣٥ - {وَلا تُخْزِنِي يَوْمَ يُبْعَثُونَ * يَوْمَ لَا يَنْفَعُ مَالٌ وَلَا بَنُونَ * إِلَّا مَنْ أَتَى اللَّهَ بِقَلْبٍ سَلِيمٍ} (٤).

---------------------
(١) سورة الفرقان، الآيتان: ٦٥ - ٦٦.
(٢) سورة الفرقان، الآية: ٨٤.
(٣) سورة الشعراء، الآيات: ٨٣ - ٨٥.
(٤) سورة الشعراء، الآيات: ٨٧ - ٨٩.

  """;

  static const String duamenquran9 = """ 
 ٣٦ - {رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِين} (١).

٣٧ - {رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي} (٢).

٣٨ - {رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ} (٣).

٣٩ - {عَسَى رَبِّي أَن يَهْدِيَنِي سَوَاءَ السَّبِيلِ} (٤).

٤٠ - {رَبِّ إِنِّي لِمَا أَنزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ} (٥).

٤١ - {رَبِّ انصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ} (٦).

---------------------
(١) سورة النمل، الآية: ١٩.
(٢) سورة القصص، الآية: ١٦.
(٣) سورة القصص، الآية: ٢١.
(٤) سورة القصص، الآية: ٢٢.
(٥) سورة القصص، الآية: ٢٤.
(٦) سورة العنكبوت، الآية: ٣٠.

  """;

  static const String duamenquran10 = """ 
٤٢ - {رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ} (١).

٤٣ - {رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ} (٢).

٤٤ - {رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيمَانِ وَلا تَجْعَلْ فِي قُلُوبِنَا غِلاً لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَؤُوفٌ رَّحِيمٌ} (٣).

٤٥ - {رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ} (٤).

٤٦ - {رَبَّنَا لا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنتَ

---------------------
(١) سورة الصافات، الآية: ١٠٠.
(٢) سورة الأحقاف، الآية: ١٥.
(٣) سورة الحشر، الآية: ١٠.
(٤) سورة الممتحنة، الآية: ٤.

  """;

  static const String duamenquran11 = """ 
  
 الْعَزِيزُ الْحَكِيمُ} (١).

٤٧ - {رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ} (٢).

٤٨ - {رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ} (٣).

٤٩ - ((اللَّهُمَّ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ)) (٤).

٥٠ - ((اللَّهُمَّ آتِني الحِكْمَةَ الَّتي مَنْ أُوتِيهَا

---------------------
(١) سورة الممتحنة، الآية: ٥.
(٢) سورة التحريم، الآية: ٨.
(٣) سورة نوح، الآية: ٢٨.
(٤) مقتبس من سورة البقرة، الآية: ٢١٣.

  """;

  static const String duamenquran12 = """ 
  
 فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا)) (١).

٥١ - ((اللَّهُمَّ ثَبِّتْنِي بِالْقَوْلِ الثَّابِتِ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ)) (٢).

٥٢ - ((اللَّهُمَ حَبَّبْ إِلَيْنَا الْإِيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا، وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ)) (٣).

٥٣ - ((اللَّهُمَّ قِنِي شُحَّ نَفْسِي وَاجْعَلْنِي مِنَ الْمُفْلِحِينَ)) (٤).

٥٤ - ((اللهمّ آتنا في الدنيا حسنة، وفي الآخرة حسنة وقنا عذاب النار)) (٥).

---------------------
(١) مقتبس من سورة البقرة، الآية:٢٦٩.
(٢) مقتبس من سورة إبراهيم، الآية: ٢٧.
(٣) مقتبس من سورة الحجرات، الآية: ٧.
(٤) مقتبس من سورة التغابن، الآية: ١٦.
(٥) البخاري، برقم ٤٥٢٢، ورقم ٦٣٨٩، ومسلم، برقم ٢٦٩٠.

  """;
}
