class EstigfarText {
  static const String estigfar1 = """
 أستغفر الله 
 """;

  static const String estigfar2 = """
   أستغفر الله العظيم""";

  static const String estigfar3 = """
أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه""";

  static const String estigfar4 = """
لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ
""";
  static const String estigfar4Footer = """
----------
(٢) سورة الأنبياء، الآية: ٨٧
  """;

  static const String estigfar5 = """
أستغفر الله وأتوب إليه
""";
  static const String estigfar5Footer = """
----------
  عن أبى هريرة رضى الله عنه قال: (ما رأيت أحدا أكثر أن يقول: (أستغفر الله وأتوب إليه من رسول الله صلى الله عليه وسلم
  """;

  static const String estigfar6 = """
اللهم اغفر لى
  """;

  static const String estigfar7 = """
ربي إغفر لي وتب علي 
  """;

  static const String estigfar8 = """
رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي
 """;
  static const String estigfar8Footer = """
----------
(٢) سورة القصص، الآية: ١٦
  """;

  static const String estigfar9 = """
  ربي إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم
  """;

  static const String estigfar10 = """
رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ
""";
  static const String estigfar10Footer = """
----------
(٣) سورة إبراهيم، الآية: ٤١
  """;

  static const String estigfar11 = """
سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ
""";
  static const String estigfar11Footer = """
------------
(٢) سورة البقرة، الآية: ٢٨٥

  """;

  static const String estigfar12 = """
رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ
""";

  static const String estigfar16 = """
رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيمَانِ وَلا تَجْعَلْ فِي قُلُوبِنَا غِلاً لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَؤُوفٌ رَّحِيمٌ
""";
  static const String estigfar16Footer = """
----------
(٣) سورة الحشر، الآية: ١٠
 """;
  static const String estigfar17 = """
رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ
""";
  static const String estigfar17Footer = """
----------
(٣) سورة الأعراف، الآية: ٢٣
 """;

  static const String estigfar13 = """
رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ
""";
  static const String estigfar13Footer = """
----------
(٢) سورة التحريم، الآية: ٨
 """;
  static const String estigfar14 = """
رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ
""";
  static const String estigfar14Footer = """
----------
(٣) سورة نوح، الآية: ٢٨
 """;
  static const String estigfar15 = """
اللهم اغفر لنا وارحمنا وتب علينا إنك أنت التواب الرحيم
 """;
  static const String estigfar15Footer = """
----------
  وقد روى عن النبى صلى الله عليه وسلم: (أن من قاله غفر له وإن كان فر من الزحف (خرجه أبو داود والترمذى وفى كتاب عمل اليوم والليلة للنسائى عن خباب بن الأرت قال: قلت يا رسول الله كيف نستغفر؟ قال: قل) اللهم اغفر لنا وارحمنا وتب علينا إنك أنت التواب الرحيم) 

 """;
  static const String estigfar18 = """
  رب اغفر لى وتب على إنك أنت التواب الغفور
 """;
  static const String estigfar18Footer = """
----------
  (وفى الأربعة عن ابن عمر قال: (إن كنا لنعد لرسول الله صلى الله عليه وسلم فى المجلس الواحد مائة مرة يقول: (رب اغفر لى وتب على إنك أنت التواب الغفور)

   """;

  static const String estigfar20 = """
  وفى صحيح البخارى عن أبى هريرة عن النبى صلى الله عليه وسلم قال
   (والله إنى لأستغفر الله وأتوب إليه فى اليوم أكثر من سبعين مرة) 
""";
  static const String estigfar21 = """
وفى سنن أبى داود عن ابن عباس عن النبى صلى الله عليه وسلم قال: (من أكثر من الإستغفار جعل الله له من كل هم فرجا، ومن كل ضيق مخرجا، ورزقه من حيث لا يحتسب) 
 """;

  static const String estigfar22 = """
أسألك من خير ما تعلم وأعوذ بك من شر ما تعلم وأستغفرك لما تعلم إنك أنت علام الغيوب
""";
  static const String estigfar22Footer = """
----------
 (يَومَ يَبعَثُهُمُ اللهُ جَمِيعاً فَيُنِبّئُهُم بِماَ عَمِلُوا أَحصَاهُ اللهُ وَنَسُوهُ) سورة المجادلة: آية ٦ وفى حديث شداد بن أوس عن النبى صلى الله عليه وسلم: (أسألك من خير ما تعلم وأعوذ بك من شر ما تعلم وأستغفرك لما تعلم إنك أنت علام الغيوب) 
 """;
  static const String estigfar23 = """
ربي إغفر لي   
  """;
  static const String estigfar24 = """
رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ
""";
  static const String estigfar24Footer = """
----------
(٣) سورة البقرة، الآية: ٢٨٦
 """;
  static const String estigfar25 = """
رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ
""";
  static const String estigfar25Footer = """
----------
(٥) سورة آل عمران، الآية: ١٦.
 """;
  static const String estigfar26 = """
ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ
""";
  static const String estigfar26Footer = """
----------
(٣) سورة آل عمران، الآية: ١٤٧.
 """;
}
