class HamdText {
  static const String hamd0 = """
          كتاب صيغ الحمد - إبن القيم
                                                                 
  """;

  static const String hamd1 = """
الْحَمد لله رب الْعَالمين الرَّحْمَن الرَّحِيم مَالك يَوْم الدّين

----------
كَقَوْلِه تَعَالَى 
الْحَمد لله رب الْعَالمين الرَّحْمَن الرَّحِيم مَالك يَوْم الدّين}

وَقَوله {فَقطع دابر الْقَوْم الَّذين ظلمُوا وَالْحَمْد لله رب الْعَالمين}

وَقَوله {وَقضي بَينهم بِالْحَقِّ وَقيل الْحَمد لله رب الْعَالمين} وَقَوله حِكَايَة عَن الحمادين من عباده أَن قَالُوا {الْحَمد لله الَّذِي هدَانَا لهَذَا وَمَا كُنَّا لنهتدي لَوْلَا أَن هدَانَا الله}
  
  """;

  static const String hamd2 = """
  وَقَوله تَعَالَى فِي حَمده لنَفسِهِ الَّذِي أَمر رَسُول الله صلى الله عَلَيْهِ وَسلم أَن يحمده بِهِ {وَقل الْحَمد لله الَّذِي لم يتَّخذ ولدا وَلم يكن لَهُ شريك فِي الْملك وَلم يكن لَهُ ولي من الذل وَكبره تَكْبِيرا}

وَقَالَ {قل الْحَمد لله وَسَلام على عباده الَّذين اصْطفى}

وَقَالَ الْحَمد لله الَّذِي لَهُ مَا فِي السَّمَوَات وَمَا فِي الأَرْض وَله الْحَمد فِي الْآخِرَة وَهُوَ الْحَكِيم الْخَبِير

وَقَالَ الْحَمد لله فاطر السَّمَوَات وَالْأَرْض جَاعل الْمَلَائِكَة رسلًا أولي أَجْنِحَة مثنى وَثَلَاث وَربَاع يزِيد فِي الْخلق مَا يَشَاء إِن الله على كل شَيْء قدير

وَقَالَ {وَهُوَ الله لَا إِلَه إِلَّا هُوَ لَهُ الْحَمد فِي الأولى وَالْآخِرَة وَله الحكم وَإِلَيْهِ ترجعون}



  """;

  static const String hamd3 = """
وَقَالَ فسبحان الله حِين تمسون وَحين تُصبحُونَ وَله الْحَمد فِي السَّمَوَات وَالْأَرْض وعشيا وَحين تظْهرُونَ

وَقَالَ يسبح لله مَا فِي السَّمَوَات وَمَا فِي الأَرْض لَهُ الْملك وَله الْحَمد وَهُوَ على كل شَيْء قدير

وَقَالَ عَن أهل الْجنَّة {وَقَالُوا الْحَمد لله الَّذِي صدقنا وعده وأورثنا الأَرْض نتبوأ من الْجنَّة حَيْثُ نشَاء فَنعم أجر العاملين}

وَقَالَ {الْحَمد لله الَّذِي أذهب عَنَّا الْحزن إِن رَبنَا لغَفُور شكور}

فَهَذَا حَمده لنَفسِهِ الَّذِي أنزلهُ فِي كِتَابه وَعلمه لِعِبَادِهِ وَأخْبر عَن أهل جنته بِهِ وَهُوَ آكِد من كل حمد وَأفضل وأكمل كَيفَ يبر الْحَالِف فِي يَمِينه بالعدول إِلَى لفظ لم يحمد بِهِ نَفسه وَلَا ثَبت عَن رَسُول الله صلى الله عَلَيْهِ وَسلم وَلَا عَن سَادَات العارفين من أمته
 """;

  static const String hamd5 =
      """ وَالنَّبِيّ صلى الله عَلَيْهِ وَسلم كَانَ إِذا حمد الله فِي الْأَوْقَات الَّتِي يتَأَكَّد فِيهَا الْحَمد لم يكن يذكر هَذَا الْحَمد الْبَتَّةَ كَمَا فِي حمد الْخطْبَة وَالْحَمْد الَّذِي تستفتح بِهِ الْأُمُور وكما فِي تشهد الْحَاج وكما فِي الْحَمد
عقب الطَّعَام وَالشرَاب واللباس وَالْخُرُوج من الْخَلَاء وَالْحَمْد عِنْد رُؤْيَة مَا يسره وَمَا لَا يسره

فروى البُخَارِيّ فِي صَحِيحه عَن أبي أُمَامَة أَن النَّبِي صلى الله عَلَيْهِ وَسلم كَانَ إِذا رفع مائدته قَالَ الْحَمد لله حمدا كثيرا طيبا مُبَارَكًا فِيهِ غير مكفي وَلَا مُودع وَلَا مُسْتَغْنى عَنهُ

وَفِي لفظ آخر فِي هَذَا الحَدِيث كَانَ إِذا فرغ من طَعَامه قَالَ الْحَمد الله الَّذِي كفانا وآوانا غير مكفي وَلَا مكفور

""";
  static const String hamd6 =
      """فَإِن أُرِيد أَن حمد الله وَالثنَاء عَلَيْهِ وَذكره أجل وَأفضل من النعم الَّتِي أنعم بهَا على العَبْد من رزقه وعافيته وَصِحَّته والتوسعة عَلَيْهِ فِي دُنْيَاهُ فَهَذَا حق يشْهد لَهُ قَوْله صلى الله عَلَيْهِ وَسلم مَا أنعم الله على عبد بِنِعْمَة فَقَالَ الْحَمد لله إِلَّا كَانَ مَا أعْطى أفضل مِمَّا أَخذ رَوَاهُ ابْن مَاجَه فَإِن حَمده لوَلِيّ الْحَمد نعْمَة أُخْرَى هِيَ أفضل وأنفع لَهُ وأجدى 
      عائده من النِّعْمَة العاجلة فَإِن أفضل النعم وأجلها على الْإِطْلَاق نعْمَة مَعْرفَته تَعَالَى وحمده وطاعته فَإِن أُرِيد أَن فعل العَبْد
       """;
  static const String hamd7 =
      """ قَالَ الإِمَام أَحْمد وَحدثنَا عبد الرَّحْمَن قَالَ حَدثنَا جَابر بن زيد عَن الْمُغيرَة بن شُعْبَة قَالَ لما أنزل على دَاوُد اعْمَلُوا آل دَاوُد شكرا وَقَلِيل من عبَادي الشكُور قَالَ يَا رب كَيفَ أُطِيق شكرا وَأَنت الَّذِي تنعم عَليّ ثمَّ ترزقني على النِّعْمَة الشُّكْر ثمَّ تزيدني نعْمَة بعد نعْمَة فالنعمة مِنْك يَا رب وَالشُّكْر مِنْك فَكيف أُطِيق شكرك قَالَ الْآن عَرفتنِي يَا دَاوُد فَمن ذَا الَّذِي يقوم بشكر ربه الَّذِي يسْتَحقّهُ سُبْحَانَهُ فضلا عَن أَن يكافيه

""";
  static const String hamd8 =
      """٢ - وَعَن أبي سعيد الْخُدْرِيّ أَن النَّبِي صلى الله عَلَيْهِ وَسلم كَانَ إِذا فرغ من طَعَامه قَالَ الْحَمد لله الَّذِي أطعمنَا وأسقانا وَجَعَلنَا مُسلمين رَوَاهُ أَبُو دَاوُد وَغَيره

 """;
  static const String hamd9 =
      """ ٣ - وَعَن أبي أَيُّوب قَالَ كَانَ رَسُول الله صلى الله عَلَيْهِ وَسلم إِذا أكل أَو شرب قَالَ الْحَمد لله الَّذِي أطْعم وَسَقَى وسوغه وَجعل لَهُ مخرجا رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ وَإِسْنَاده

٤ - وَفِي السّنَن أَيْضا عَن معَاذ بن أنس قَالَ قَالَ رَسُول الله صلى الله عَلَيْهِ وَسلم من أكل طَعَاما فَقَالَ الْحَمد الله الَّذِي أطعمنَا هَذَا من غير حول مني وَلَا قُوَّة غفر لَهُ مَا تقدم من ذَنبه

قَالَ التِّرْمِذِيّ حَدِيث حسن


""";
  static const String hamd10 = """

٥ - وَفِي سنَن النَّسَائِيّ عَن عبد الرَّحْمَن بن جُبَير أَنه رجل خدم النَّبِي صلى الله عَلَيْهِ وَسلم ثَمَان سِنِين أَنه كَانَ يسمع النَّبِي صلى الله عَلَيْهِ وَسلم إِذا قرب إِلَيْهِ طَعَاما يَقُول بِسم الله وَإِذا فرغ من طَعَامه

قَالَ اللَّهُمَّ أطعمت وسقيت وأغنيت وأقنيت وهديت وأحييت فلك الْحَمد على مَا أَعْطَيْت وَإِسْنَاده صَحِيح

٦ - وروى أَبُو دَاوُد فِي السّنَن من حَدِيث عبد الله بن عَمْرو بن الْعَاصِ عَن النَّبِي صلى الله عَلَيْهِ وَسلم أَنه كَانَ يَقُول فِي الطَّعَام إِذا فرغ الْحَمد لله الَّذِي من علينا وهدانا وَالَّذِي أشبعنا وأروانا



""";
  static const String hamd11 =
      """ ٧ - وَكَذَلِكَ الحَدِيث الَّذِي رَوَاهُ أهل السّنَن بِالْإِسْنَادِ الصَّحِيح عَن عبد الله بن مَسْعُود قَالَ علمنَا رَسُول الله صلى الله عَلَيْهِ وَسلم خطْبَة الْحَاجة الْحَمد لله نستعينه وَنَسْتَغْفِرهُ ونعوذ بِاللَّه من شرور أَنْفُسنَا من يهده الله فَلَا مضل لَهُ وَمن يضلل الله فَلَا هادي لَهُ وَأشْهد أَن لَا إِلَه إِلَّا الله وَأشْهد أَن مُحَمَّدًا عَبده وَرَسُوله اتَّقوا الله الَّذِي تسْأَلُون بِهِ والأرحام إِن الله كَانَ عَلَيْكُم رقيبا يَا أَيهَا الَّذين آمنُوا اتَّقوا الله حق تُقَاته وَلَا تموتن إِلَّا وَأَنْتُم مُسلمُونَ يَا أَيهَا الَّذين آمنُوا اتَّقوا الله وَقُولُوا قولا سديدا يصلح لكم أَعمالكُم وَيغْفر لكم ذنوبكم وَمن يطع الله وَرَسُوله فقد فَازَ فوزا عظميا

٨ - وَشرع النَّبِي صلى الله عَلَيْهِ وَسلم لمن رأى مبتلى أَن يَقُول مَا رَوَاهُ التِّرْمِذِيّ عَن أبي هُرَيْرَة عَن النَّبِي صلى الله عَلَيْهِ وَسلم أَنه قَالَ

""";
  static const String hamd12 =
      """ من رأى مبتلى فَقَالَ الْحَمد لله الَّذِي عافاني مِمَّا ابتلاك بِهِ وفضلني على كثير مِمَّن خلق تَفْضِيلًا إِلَّا لم يصبهُ ذَلِك الْبلَاء قَالَ التِّرْمِذِيّ حَدِيث حسن

""";
  static const String hamd13 = """ وَرُوِيَ نَحوه عَن عمر

٩ - وَشرع النَّبِي صلى الله عَلَيْهِ وَسلم للقائم من الْمجْلس أَن يَقُول مَا رَوَاهُ أَبُو هُرَيْرَة عَنهُ صلى الله عَلَيْهِ وَسلم من جلس فِي مجْلِس فَكثر فِيهِ لغطه فَقَالَ قبل أَن يقوم من مَجْلِسه سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِك أشهد أَن لَا إِلَه إِلَّا أَنْت أستغفرك وَأَتُوب إِلَيْك إِلَّا غفر لَهُ مَا كَانَ فِي مَجْلِسه ذَلِك قَالَ التِّرْمِذِيّ حَدِيث حسن صَحِيح

""";
  static const String hamd14 =
      """ فصل فِي الْمَأْثُور عَنهُ صلى الله عَلَيْهِ وَسلم

١٠ - وَشرع صلى الله عَلَيْهِ وَسلم للعاطس أَن يَقُول مَا رَوَاهُ أَبُو دَاوُد بِإِسْنَاد صَحِيح عَن أبي هُرَيْرَة أَن النَّبِي صلى الله عَلَيْهِ وَسلم قَالَ إِذا عطس أحدكُم فَلْيقل الْحَمد لله على كل حَال وَليقل أَخُوهُ أَو صَاحبه يَرْحَمك الله وَيَقُول هُوَ يهديكم الله وَيصْلح بالكم

""";
  static const String hamd15 =
      """١١ - وَفِي جَامع التِّرْمِذِيّ عَن ابْن عمر أَن رجلا عطس إِلَى جنبه فَقَالَ الْحَمد لله وَالصَّلَاة وَالسَّلَام على رَسُول الله فَقَالَ ابْن عمر وَأَنا أَقُول الْحَمد لله وَالسَّلَام على رَسُول الله وَلَيْسَ هَكَذَا علمنَا رَسُول الله صلى الله عَلَيْهِ وَسلم أَن نقُول الْحَمد لله على كل حَال

 """;
  static const String hamd16 =
      """ ١٢ - وَكَذَلِكَ شرع لأمته عِنْد ركُوب الدَّابَّة مَا رَوَاهُ أهل السّنَن بِالْإِسْنَادِ الصَّحِيح عَن عَليّ بن ربيعَة قَالَ شهِدت عَليّ بن أبي طَالب أُتِي بِدَابَّة ليرْكبَهَا فَلَمَّا وضع رجله فِي الركاب قَالَ بِسم الله فَلَمَّا اسْتَوَى على ظهرهَا قَالَ الْحَمد لله الَّذِي سخر لنا هَذَا وَمَا كُنَّا لَهُ مُقرنين وَإِنَّا إِلَى رَبنَا لمنقلبون ثمَّ قَالَ الْحَمد لله ثَلَاث مَرَّات ثمَّ قَالَ الله أكبر ثَلَاث مَرَّات ثمَّ قَالَ سُبْحَانَكَ ظلمت نَفسِي فَاغْفِر لي إِنَّه لَا يغْفر الذُّنُوب إِلَّا أَنْت ثمَّ ضحك فَقَالَ فَقلت يَا أَمِير الْمُؤمنِينَ من أَي شَيْء ضحِكت قَالَ رَأَيْت النَّبِي صلى الله عَلَيْهِ وَسلم فعل كَمَا فعلت ثمَّ ضحك فَقلت يَا رَسُول الله من أَي شَيْء ضحِكت قَالَ إِن رَبك سُبْحَانَهُ يعجب من عَبده إِذا قَالَ اغْفِر لي ذُنُوبِي يعلم أَنه لَا يغْفر الذُّنُوب غَيْرِي

""";
  static const String hamd17 =
      """ ١٣ - وروى ابْن مَاجَه فِي سنَنه عَن عَائِشَة قَالَت كَانَ رَسُول الله صلى الله عَلَيْهِ وَسلم إِذا رأى مَا يُحِبهُ قَالَ الْحَمد لله الَّذِي بنعمته تتمّ الصَّالِحَات وَإِذا رأى مَا يكره قَالَ الْحَمد الله على كل حَال قَالَ الْحَاكِم هَذَا حَدِيث صَحِيح الْإِسْنَاد فِي صَحِيح مُسلم عَن عَليّ رَضِي الله عَنهُ قَالَ كَانَ رَسُول الله صلى الله عَلَيْهِ وَسلم إِذا رفع رَأسه قَالَ سمع الله لمن حَمده رَبنَا لَك الْحَمد ملْء السَّمَوَات وملء الأَرْض وملء مَا شِئْت من شَيْء بعد

""";
  static const String hamd18 =
      """١٤ - وَفِيه عَن أبي سعيد الْخُدْرِيّ أَن رَسُول الله صلى الله عَلَيْهِ وَسلم كَانَ إِذا رفع رَأسه من الرُّكُوع قَالَ اللَّهُمَّ رَبنَا لَك الْحَمد ملْء السَّمَوَات وملء الأَرْض وملء مَا شِئْت من شَيْء بعد أهل الثَّنَاء وَالْمجد أَحَق مَا قَالَ العَبْد كلنا لَك عبد اللَّهُمَّ لَا مَانع لما أَعْطَيْت وَلَا معطي لما منعت وَلَا ينفع ذَا الْجد مِنْك الْجد

 """;
  static const String hamd19 =
      """١٥ - وروى البُخَارِيّ فِي صَحِيحه عَن رِفَاعَة بن رَافع الزرقي قَالَ كُنَّا نصلي وَرَاء النَّبِي صلى الله عَلَيْهِ وَسلم فَلَمَّا رفع رَأسه من الرُّكُوع قَالَ سمع الله لمن حَمده قَالَ رجل وَرَاءه رَبنَا لَك الْحَمد حمدا كثيرا طيبا مُبَارَكًا فِيهِ فَلَمَّا انْصَرف قَالَ من الْمُتَكَلّم قَالَ أَنا قَالَ

 """;
  static const String hamd20 =
      """ قد رَأَيْت بضعَة وَثَلَاثِينَ ملكا يبتدرونها أَيهمْ يَكْتُبهَا أول

١٦ - وَفِي صَحِيح البُخَارِيّ وَمُسلم عَن ابْن عَبَّاس أَن النَّبِي صلى الله عَلَيْهِ وَسلم كَانَ إِذا قَامَ من اللَّيْل يُصَلِّي يَقُول اللَّهُمَّ لَك الْحَمد أَنْت نور السَّمَوَات وَالْأَرْض وَمن فِيهِنَّ وَلَك الْحَمد أَنْت قيوم السَّمَوَات وَالْأَرْض وَمن فِيهِنَّ وَلَك الْحَمد أَنْت الْحق وَوَعدك حق ولقاؤك حق وَالْجنَّة حق وَالنَّار حق والنبيون حق الحَدِيث

""";
  static const String hamd21 =
      """١٧ - وَفِي صَحِيح مُسلم عَن عبد الله بن عمر قَالَ بَيْنَمَا نَحن نصلي مَعَ رَسُول الله صلى الله عَلَيْهِ وَسلم قَالَ رجل الله أكبر كَبِيرا وَالْحَمْد لله كثيرا وَسُبْحَان الله بكرَة وَأَصِيلا فَقَالَ النَّبِي صلى الله عَلَيْهِ وَسلم من الْقَائِل كَذَا وَكَذَا فَقَالَ رجل من الْقَوْم أَنا قلتهَا يَا رَسُول الله قَالَ عجبت لَهَا فتحت لَهَا أَبْوَاب السَّمَاء

 """;
  static const String hamd22 =
      """قَالَ ابْن عمر فَمَا تركتهن مُنْذُ سَمِعت رَسُول الله صلى الله عَلَيْهِ وَسلم يقولهن

 """;
  static const String hamd23 =
      """١٨ - وَفِي السّنَن عَن رِفَاعَة بن رَافع قَالَ صليت خلف النَّبِي صلى الله عَلَيْهِ وَسلم فعطست فَقلت الْحَمد لله حمدا كثير طيبا مُبَارَكًا فِيهِ كَمَا يحب رَبنَا ويرضى فَلَمَّا صلى رَسُول الله صلى الله عَلَيْهِ وَسلم انْصَرف فَقَالَ من الْمُتَكَلّم فِي الصَّلَاة فَلم يجبهُ أحد ثمَّ قَالَهَا الثَّانِيَة من الْمُتَكَلّم فِي الصَّلَاة فَقَالَ رِفَاعَة بن رَافع أَنا يَا رَسُول الله قَالَ كَيفَ قلت قَالَ قلت الْحَمد لله حمدا كثيرا طيبا مُبَارَكًا فِيهِ كَمَا يحب رَبنَا ويرضى فَقَالَ وَالَّذِي نَفسِي بِيَدِهِ لقد ابتدرها بضعَة وَثَلَاثُونَ ملكا أَيهمْ يصعدها قَالَ التِّرْمِذِيّ حَدِيث حسن

 """;
  static const String hamd24 =
      """١٩ - وَفِي سنَن أبي دَاوُد عَن عَامر بن ربيعَة قَالَ عطس شَاب من الْأَنْصَار خلف رَسُول الله صلى الله عَلَيْهِ وَسلم وَهُوَ فِي الصَّلَاة فَقَالَ الْحَمد لله حمدا كثيرا طيبا مُبَارَكًا فِيهِ حَتَّى يرضى رَبنَا وَبعد مَا يرضى من أَمر الدُّنْيَا وَالْآخِرَة فَلَمَّا انْصَرف رَسُول الله صلى الله عَلَيْهِ وَسلم قَالَ من الْقَائِل الْكَلِمَة فَسكت الشَّاب ثمَّ قَالَ من الْقَائِل الْكَلِمَة فَإِنَّهُ

 """;
  static const String hamd25 =
      """لم يقل باسا فَقَالَ يَا رَسُول الله أَنا قلتهَا لم أرد بهَا إِلَّا خيرا فَقَالَ مَا تناهت دون عرش الرَّحْمَن جلّ ذكره

 """;
  static const String hamd26 =
      """٢٠ - وَفِي مُسْند الإِمَام أَحْمد عَن وَائِل بن حجر قَالَ صليت مَعَ رَسُول الله صلى الله عَلَيْهِ وَسلم فَقَالَ رجل الْحَمد لله حمدا كثيرا طيبا مُبَارَكًا فِيهِ فَلَمَّا صلى رَسُول الله صلى الله عَلَيْهِ وَسلم قَالَ من الْقَائِل قَالَ الرجل أَنا يَا رَسُول الله وَمَا أردْت إِلَّا الْخَيْر فَقَالَ لقد فتحت لَهَا أَبْوَاب السَّمَاء فَلم ينهنها شَيْء دون الْعَرْش

 """;
  static const String hamd27 =
      """٢١ - وَثَبت عَنهُ صلى الله عَلَيْهِ وَسلم فِي الصَّحِيح أَنه كَانَ يَقُول فِي اعتداله بعد الرُّكُوع فِي صَلَاة اللَّيْل لرَبي الْحَمد لرَبي الْحَمد وَكَانَ قيَاما طَويلاi 
      وَشرع لأمته فِي هَذَا الْموضع وَفِي غَيره أفضل الْحَمد وأكمله فَلَو كَانَ قَول الْقَائِل الْحَمد لله حمدا يوافي نعمه ويكا فِي مزيده أفضل الْحَمد لَكَانَ أولى الْمَوَاضِع بِهِ هَذَا الْموضع وَمَا أشبهه فيا سُبْحَانَ الله لَا يَأْتِي عَنهُ هَذَا الْحَمد الْأَكْمَل الْأَفْضَل الْجَامِع فِي مَوضِع وَاحِد الْبَتَّةَ لَا قولا وَلَا تَعْلِيما وَلَا يَقُوله أحد من الصَّحَابَة وَلَا يعرف عَنْهُم فِي خطْبَة وَلَا تشهد حَاجَة وَلَا عقيب الطَّعَام وَالشرَاب وَإِنَّمَا الَّذِي جَاءَ عَنْهُم حمد هُوَ دونه فِي الْفَضِيلَة والكمال هَذَا من الْمحَال

 """;
  static const String hamd28 =
      """٢٢ - وَكَذَلِكَ حمد الْمَلَائِكَة لَهُ سُبْحَانَهُ كَمَا فِي صَحِيح مُسلم عَن أبي هُرَيْرَة رَضِي الله عَنهُ أَن النَّبِي صلى الله عَلَيْهِ وَسلم أُتِي لَيْلَة أسرِي بِهِ بقدح من خمر وقدح من لبن فَقَالَ جِبْرِيل فَنظر إِلَيْهِمَا فَأخذ اللَّبن فَقَالَ جِبْرِيل عَلَيْهِ السَّلَام الْحَمد لله الَّذِي هداك للفطرة لَو أخذت الْخمر غوت أمتك

 """;
  static const String hamd29 =
      """٢٣ - وَكَذَلِكَ حمد الصَّحَابَة لَهُ سُبْحَانَهُ كَمَا فِي صَحِيح البُخَارِيّ أَن عمر بن الْخطاب رَضِي الله عَنهُ لما طعن أرسل ابْنه عبد الله إِلَى عَائِشَة رَضِي الله عَنْهَا يستأذنها أَن يدْفن مَعَ صَاحِبيهِ فَلَمَّا أقبل عبد الله قَالَ عمر مَا لديك قَالَ الَّذِي يحب أَمِير الْمُؤمنِينَ أَذِنت قَالَ الْحَمد لله مَا كَانَ شَيْء أهم إِلَيّ من ذَلِك

 """;
  static const String hamd30 =
      """٢٤ - وروى ابْن مَاجَه فِي سنَنه أَن النَّبِي صلى الله عَلَيْهِ وَسلم كَانَ إِذا خرج من الخلا قَالَ الْحَمد لله الَّذِي أذهب عني الْأَذَى وعافاني

 """;
  static const String hamd31 =
      """٢٥ - وَفِي مُعْجم الطَّبَرَانِيّ عَن ابْن عمر رَضِي الله عَنْهُمَا قَالَ كَانَ رَسُول الله صلى الله عَلَيْهِ وَسلم إِذا خرج قَالَ الْحَمد لله الَّذِي أذاقني لذته وَدفع عني أَذَاهُ

 """;
  static const String hamd32 =
      """٢٦ - وَعَن أبي سعيد الْخُدْرِيّ رَضِي الله عَنهُ أَن النَّبِي صلى الله عَلَيْهِ وَسلم كَانَ إِذا استجد ثوبا سَمَّاهُ باسمه عِمَامَة أَو قَمِيصًا أَو رِدَاء ثمَّ يَقُول اللَّهُمَّ لَك الْحَمد أَنْت كسوتنيه أَسأَلك خَيره وَخير مَا صنع لَهُ وَأَعُوذ بك من شَره وَشر مَا صنع لَهُ

رَوَاهُ أَبُو دَاوُد وَالنَّسَائِيّ وَإِسْنَاده صَحِيح قَالَ التِّرْمِذِيّ حَدِيث حسن

 """;
  static const String hamd33 =
      """٢٧ - وَفِي التِّرْمِذِيّ عَن عمر رَضِي الله عَنهُ قَالَ سَمِعت رَسُول الله صلى الله عَلَيْهِ وَسلم يَقُول من لبس ثوبا جَدِيدا فَقَالَ الْحَمد لله الَّذِي كساني مَا أواري بِهِ عورتي وأتجمل بِهِ فِي حَياتِي ثمَّ مُحَمَّد إِلَى الثَّوْب الَّذِي
      أخلق فَتصدق بِهِ كَانَ فِي حفظ الله وَفِي كنف الله وَفِي سَبِيل الله حَيا وَمَيتًا

 """;
  static const String hamd34 =
      """٢٨ - وَفِي مُسْند الإِمَام أَحْمد من حَدِيث معَاذ بن أنس عَن النَّبِي صلى الله عَلَيْهِ وَسلم قَالَ من أكل طَعَاما فَقَالَ الْحَمد لله الَّذِي أَطْعمنِي هَذَا ورزقنيه من غير حول مني وَلَا قُوَّة غفر لَهُ مَا تقدم من ذَنبه وَمن لبس ثوبا فَقَالَ الْحَمد لله الَّذِي كساني هَذَا ورزقنيه من غير حول مني وَلَا قُوَّة غفر الله لَهُ مَا تقدم من ذَنبه

 """;
  static const String hamd35 =
      """٢٩ - وَفِي جَامع التِّرْمِذِيّ عَن عَليّ رَضِي الله عَنهُ قَالَ كَانَ أَكثر دُعَاء النَّبِي صلى الله عَلَيْهِ وَسلم يَوْم عَرَفَة فِي المواقف اللَّهُمَّ لَك الْحَمد كَالَّذي نقُول وَخير مِمَّا نقُول اللَّهُمَّ لَك صَلَاتي ونسكي ومحياي ومماتي وَإِلَيْك مَالِي وَلَك رب تراثي اللَّهُمَّ إِنِّي أعوذ بك من عَذَاب الْقَبْر ووسوسة الصَّدْر وشتات الْأَمر اللَّهُمَّ إِنِّي أعوذ بك من شَرّ مَا تَجِيء بِهِ الرّيح

 """;
  static const String hamd36 =
      """٣٠ - وَفِي أثر آخر مَعْرُوف اللَّهُمَّ لَك الْحَمد كُله وَلَك الْملك كُله وبيدك الْخَيْر كُله وَإِلَيْك يرجع الْأَمر كُله عَلَانِيَته وسره وَأَنت أهل الْحَمد

وَهَذَا من أجمع الْحَمد وَأحسنه

وَقد علم النَّبِي صلى الله عَلَيْهِ وَسلم أمته الْحَمد الْمُفْرد والمضاعف فَلم يعلمهُمْ فِي شَيْء مِنْهُ هَذَا الْحَمد الْمَسْئُول عَنهُ

 """;
  static const String hamd37 =
      """٣١ - وَفِي صَحِيح مُسلم عَن سعد بن أبي وَقاص رَضِي الله عَنهُ قَالَ جَاءَ أَعْرَابِي إِلَى رَسُول الله صلى الله عَلَيْهِ وَسلم فَقَالَ عَلمنِي

      كلَاما أقوله قَالَ لَا إِلَه إِلَّا الله وَحده لَا شريك لَهُ الله أكبر كَبِيرا وَالْحَمْد لله كثيرا وَسُبْحَان الله رب الْعَالمين لَا حول وَلَا قُوَّة إِلَّا بِاللَّه الْعَزِيز الْحَكِيم قَالَ هَؤُلَاءِ لرَبي فَمَا لي قَالَ اللَّهُمَّ اغْفِر لي وارحمني واهدني وارزقني



 """;
  static const String hamd38 =
      """ ٣٢ - وَفِي السّنَن عَن سعد بن أبي وَقاص أَنه دخل مَعَ النَّبِي صلى الله عَلَيْهِ وَسلم على امْرَأَة بَين يَديهَا نوى أَو حَصى تسبح بِهِ فَقَالَ أخْبرك بِمَا هُوَ أيسر عَلَيْك من هَذَا وَأفضل سُبْحَانَ الله عدد مَا خلق فِي السَّمَاء سُبْحَانَ الله عدد مَا خلق فِي الأَرْض وَسُبْحَان الله عدد مَا بَين ذَلِك وَسُبْحَان الله عدد مَا هُوَ خَالق وَالله أكبر مثل ذَلِك وَالْحَمْد لله مثل ذَلِك وَلَا إِلَه إِلَّا الله مثل ذَلِك وَلَا حول وَلَا قُوَّة إِلَّا بِاللَّه مثل ذَلِك
      فَلَو كَانَ الْحَمد لله حمدا يوافي نعمه ويكافي مزيده أفضل من هَذَا لعلمه إِيَّاهَا

""";

  static const String hamd39 =
      """٣٣ - وَفِي صَحِيح مُسلم عَن سَمُرَة بن جُنْدُب رَضِي الله عَنهُ قَالَ قَالَ رَسُول الله صلى الله عَلَيْهِ وَسلم أحب الْكَلَام إِلَى الله أَربع سُبْحَانَ الله وَالْحَمْد لله وَلَا إِلَه إِلَّا الله وَالله أكبر وَلَا يضر بأيهن بدأت

وَلَو كَانَ الْحَمد لله حمدا يوافي نعمه ويكافي مزيده أفضل من هَذَا لَكَانَ أحب إِلَى الله مِنْهُ

 """;
  static const String hamd40 =
      """٣٤ - وَفِي صَحِيح مُسلم أَيْضا عَن أبي هُرَيْرَة رَضِي الله عَنهُ قَالَ قَالَ رَسُول الله صلى الله عَلَيْهِ وَسلم لِأَن أَقُول سُبْحَانَ الله وَالْحَمْد لله وَلَا إِلَه إِلَّا الله وَالله أكبر أحب إِلَيّ مِمَّا طلعت عَلَيْهِ الشَّمْس

 """;
  static const String hamd41 =
      """٣٥ - وروى إِسْرَائِيل عَن أبي سِنَان عَن أبي صَالح عَن أبي سعيد وَأبي هُرَيْرَة قَالَا قَالَ رَسُول الله صلى الله عَلَيْهِ وَسلم إِن الله اصْطفى من الْكَلَام سُبْحَانَ الله وَالْحَمْد لله وَلَا إِلَه إِلَّا الله وَالله أكبر
      فَإِذا قَالَ العَبْد سُبْحَانَ الله كتب لَهُ عشْرين حَسَنَة أَو حط عَنهُ عشْرين سَيِّئَة فَإِذا قَالَ الله أكبر فَمثل ذَلِك فَإِذا قَالَ لَا إِلَه إِلَّا الله فَمثل ذَلِك وَإِذا قَالَ الْحَمد رب الْعَالمين من قبل نَفسه كتبت لَهُ ثَلَاثُونَ حَسَنَة وَحط عَنهُ ثَلَاثُونَ سَيِّئَة
 
 """;
  static const String hamd42 =
      """ ٣٦ - وَفِي صَحِيح مُسلم عَن أبي مَالك الْأَشْعَرِيّ عَن النَّبِي صلى الله عَلَيْهِ وَسلم أَنه كَانَ يَقُول الطّهُور شطر الْإِيمَان وَالْحَمْد لله تملأ الْمِيزَان وَسُبْحَان الله وَالْحَمْد لله تملآن أَو تملأ مَا بَين السَّمَاء وَالْأَرْض وَالصَّلَاة نور وَالصَّدَََقَة برهَان وَالصَّبْر ضِيَاء وَالْقُرْآن حجَّة لَك أَو عَلَيْك كل النَّاس يَغْدُو فبائع نَفسه فموبقها أَو مبتاعها فمعتقها

""";
  static const String hamd43 =
      """٣٧ - وَقد روى ابْن ماجة وَالتِّرْمِذِيّ من حَدِيث طَلْحَة بن خرَاش بن عمر عَن جَابر بن عبد الله قَالَ سَمِعت رَسُول الله صلى الله عَلَيْهِ وَسلم يَقُول أفضل الذّكر لَا إِلَه إِلَّا الله وَأفضل الدُّعَاء الْحَمد لله

      وَسُئِلَ ابْن عَيْنِيَّة عَن هَذَا الحَدِيث فَقيل لَهُ كَأَن الْحَمد لله دُعَاء فَقَالَ أما سَمِعت قَول أُميَّة ابْن أبي الصَّلْت لعبد الله بن جدعَان يَرْجُو نائلة

أأذكر حَاجَتي أم قد كفاني ... حباؤك إِن شيمتك الْحيَاء

إِذا أثني عَلَيْك الْمَرْء يَوْمًا ... كَفاهُ من تعرضه الثَّنَاء

كريم لَا يُغَيِّرهُ صباح ... عَن الْخلق الْجَمِيل وَلَا مسَاء

فَهَذَا مَخْلُوق اكْتفى من مَخْلُوق بالثناء عَلَيْهِ فَكيف بالخالق سُبْحَانَهُ قلت الدُّعَاء يُرَاد بِهِ دُعَاء الْمَسْأَلَة وَدُعَاء الْعِبَادَة والمثني على ربه بِحَمْدِهِ وَالْآيَة دَاع لَهُ بالاعتبارين فَإِنَّهُ طَالب مِنْهُ طَالب لَهُ فَهُوَ الدَّاعِي حَقِيقَة قَالَ تَعَالَى {هُوَ الْحَيّ لَا إِلَه إِلَّا هُوَ فَادعوهُ مُخلصين لَهُ الدّين الْحَمد لله رب الْعَالمين}


 """;
  static const String hamd44 =
      """ ٣٨ - وروى ابْن مَاجَه فِي سنَنه من حَدِيث عبد الله بن عمر أَن رَسُول الله صلى الله عَلَيْهِ وَسلم حَدثهمْ أَن عبدا من عباد الله قَالَ يَا رب لَك الْحَمد كَمَا يَنْبَغِي لجلال وَجهك ولعظيم سلطانك فعظمت بالملكين فَلم يدريا كَيفَ يكتبانها فصعدا إِلَى السَّمَاء فَقَالَ يارب إِن عَبدك قَالَ مقَالَة لَا ندية كَيفَ نكتبها قَالَ الله عز وَجل وَهُوَ أعلم بِمَا قَالَ عَبده

      مَاذَا قَالَ عَبدِي قَالَا يارب إِنَّه قَالَ يَا رب لَك الْحَمد كَمَا يَنْبَغِي لجلال وَجهك وعظيم سلطانك فَقَالَ الله عز وَجل اكتباها كَمَا قَالَ عَبدِي حَتَّى يلقاني فأجزيه بهَا


""";
  static const String hamd45 =
      """ ٣٩ - وَفِي سنَن ابْن مَاجَه أَيْضا من حَدِيث مُحَمَّد بن ثَابت عَن أبي هُرَيْرَة أَن النَّبِي صلى الله عَلَيْهِ وَسلم كَانَ يَقُول الْحَمد الله على كل حَال أعوذ بِاللَّه من حَال أهل النَّار

""";
  static const String hamd46 =
      """ ٤٠ - وَفِي مُسْند ابْن أبي شيبَة عَن أبي هُرَيْرَة أَن رَسُول الله صلى الله عَلَيْهِ وَسلم مر بِهِ وَهُوَ يغْرس فَقَالَ يَا أَبَا هُرَيْرَة مَا الَّذِي تغرس قلت غراسا قَالَ أَلا أدلك على غراس خير من هَذَا سُبْحَانَ الله وَالْحَمْد الله وَلَا إِلَه إِلَّا الله وَالله أكبر تغرس بِكُل وَاحِدَة شَجَرَة فِي الْجنَّة

""";
  static const String hamd47 =
      """ ٤١ - وَفِي سنَن ابْن مَاجَه عَن أبي الدَّرْدَاء قَالَ قَالَ لي رَسُول الله
  صلى الله عَلَيْهِ وَسلم عَلَيْك بسبحان الله وَالْحَمْد لله وَلَا إِلَه إِلَّا الله وَالله أكبر فَإِنَّهَا يَعْنِي تحط الْخَطَايَا كَمَا تحط الشَّجَرَة وَرقهَا


""";
  static const String hamd48 =
      """ ٤٢ - وَفِي التِّرْمِذِيّ عَن ابْن مَسْعُود عَن النَّبِي صلى الله عَلَيْهِ وَسلم قَالَ لقِيت إِبْرَاهِيم لَيْلَة أسرِي بِي فَقَالَ يَا مُحَمَّد أقريء أمتك السَّلَام وَأخْبرهمْ أَن الْجنَّة طيبَة التربة عذبة المَاء وَأَنَّهَا قيعان وَأَن غراسها سُبْحَانَ الله وَالْحَمْد لله وَلَا إِلَه إِلَّا الله وَالله أكبر قَالَ التِّرْمِذِيّ حَدِيث حسن

""";
  static const String hamd49 =
      """ وَالَّذِي حفظ من تحميد النَّبِي صلى الله عَلَيْهِ وَسلم فِي المجامع الْعِظَام كخطبة الْجُمُعَة وَالْخطْبَة فِي الْحَج عِنْد الْجَمْرَة وخطبة الْحَاجة الْحَمد لله نحمده ونستعينه وَنَسْتَغْفِرهُ ونعوذ بِاللَّه من شرور أَنْفُسنَا من يهده الله فَلَا مضل لَهُ وَمن يضلل فَلَا هادي لَهُ وَأشْهد أَن لَا إِلَه إِلَّا الله وَأشْهد أَن مُحَمَّدًا عَبده وَرَسُوله وفيهَا كلهَا أشبه بِلَفْظ الْإِفْرَاد ونستعينه بِلَفْظ الْجمع ونحمده وَنَسْتَغْفِرهُ بِلَفْظ الْجمع

""";
  static const String hamd50 =
      """ فَقَالَ شيخ الْإِسْلَام أَبُو الْعَبَّاس ابْن تَيْمِية قدس الله روحه لما كَانَ العَبْد قد يسْتَغْفر لَهُ ويستعين لَهُ وَلغيره حسن لفظ الْجمع فِي ذَلِك وَأما الشَّهَادَة لله بالوحدانية وَلِرَسُولِهِ بالرسالة فَلَا يَفْعَلهَا أحد عَن غَيره وَلَا تقبل الشَّهَادَة بِوَجْه من الْوُجُوه وَلَا تتَعَلَّق شَهَادَة الْإِنْسَان بِشَهَادَة غَيره المتشهد لَا يتَشَهَّد إِلَّا عَن نَفسه

هَذَا معنى كَلَامه

فَهَذِهِ جمل مواقع الْحَمد فِي كَلَام الله وَرَسُوله وَأَصْحَابه وَالْمَلَائِكَة قد جليت عَلَيْك عرائسها وجلبت عَلَيْك نفائسها فَلَو كَانَ الحَدِيث الْمَسْئُول عَنهُ أفضلهَا وأكملها وأجمعها كَمَا ظَنّه الظَّان لَكَانَ وَاسِطَة عقدهَا فِي النظام

""";
  static const String hamd51 =
      """ الظَّان لَكَانَ وَاسِطَة عقدهَا فِي النظام وأكثرها اسْتِعْمَالا فِي حمد ذِي الْجلَال وَالْإِكْرَام

فَالْحَمْد لله بمحامده الَّتِي حمد بهَا نَفسه وحمده بهَا الَّذين اصْطفى حمدا طيبا مُبَارَكًا فِيهِ كَمَا يحب رَبنَا ويرضى وَصلى الله على سيدنَا مُحَمَّد النَّبِي الْأُمِّي وَآله وَصَحبه وَسلم

إنتهت من تَحْقِيق الرسَالَة وَالتَّعْلِيق عَلَيْهَا وَتَخْرِيج أحاديثها بِحَمْد الله وَأَسْتَغْفِر الله من الْخَطَأ والزلل وَذَلِكَ فِي يَوْم الْأَحَد الْمُوَافق للخامس من شهر صفر لعام أَرْبَعَة عشر وَأَرْبع مائَة وَألف لِلْهِجْرَةِ

وَكتب مُحَمَّد بن إِبْرَاهِيم بن عبد الْعَزِيز السعران

""";

  static const String hamd52 = """
                                            من كتاب كتاب فقه الأدعية والأذكار
                                            [عبد الرزاق بن عبد المحسن البدر]

  
  ٤٧ / أفضلُ صِيَغِ الحمد وأكملُها

تقدّم بيانُ فضل الحمد وعظم ثوابه عند الله، والإشارةُ إلى بعض صِيَغه الواردة في القرآن الكريم وفي أحاديث الرسول الكريم صلى الله عليه وسلم، كقول: {الحَمْدُ للهِ رَبِّ العَالَمِينَ} ، وقول: "الحمد لله حمداً كثيراً طيِّباً مباركاً فيه كما يحب ربّنا ويرضى"، ونحو ذلك مما ورد في القرآن الكريم مما حمد به الربُّ نفسه، وما ورد في سنة النبي الكريم صلى الله عليه وسلم مما حمد به الرسول صلى الله عليه وسلم ربَّه، وهي صيغٌ عظيمةٌ مشتملةٌ على أحسن الحمد وأكمله وأوفاه، وقد ذكر بعضُ أهل العلم أنَّ أفضل صيغ الحمد "الحمد لله حمداً يوافي نعمه ويكافئ مزيده"، واحتجّ بما ورد عن أبي نصر التمّار أنَّه قال: قال آدم عليه السلام: يا رب شغلتَني بكسب يديّ فعلّمني شيئاً من مجامع الحمد والتسبيح، فأوحى الله إليه يا آدمُ إذا أصبحت فقل ثلاثاً وإذا أمسيت فقل ثلاثاً: "الحمدلله ربِّ العالمين حمداً يوافي نعمه ويكافئ مزيده، فذلك مجامع الحمد".

وقد رُفع ذلك للإمام المحقق ابن قيِّم الجوزية رحمه الله فأنكره على قائله غايةَ الإنكار وبيَّن رحمه الله أنَّ ذلك لم يَرِد عن النبي صلى الله عليه وسلم في شيء من الصحاح أو السنن أو المسانيد ولا يُعرف في شيء من كتب الحديث المعتمدة، وبَسَط القول رحمه الله في ذلك في رسالة مفردة.

قال رحمه الله: "هذا الحديث ليس في الصحيحين ولا في أحدهما ولا يُعرف في شيء من كتب الحديث المعتمدة، ولا له إسناد معروف، وإنَّما يُروى عن أبي نصر التمّار عن آدم أبي البشر، لا يَدري كم بين
  """;

  static const String hamd53 =
      """ أبي نصر وآدم إلا الله تعالى، وذكر الحديث المتقدّم ثم قال: فهذا لو رواه أبو نصر التمّار عن سيِّد ولد آدم صلى الله عليه وسلم لما قبلت روايته لانقطاع الحديث فيما بينه وبين رسول الله صلى الله عليه وسلم فكيف بروايته له عن آدم.

وقد ظنَّ طائفة من الناس أنَّ هذا الحمد بهذا اللفظ أكمل حمدٍ حُمِد اللهُ به وأفضله وأجمعه لأنواع الحمد، وبنوا على هذا مسألة فقهيّة فقالوا: لو حلف إنسانٌ ليحمدنَّ اللهَ بمجامع الحمد وأجلِّ المحامد فطريقه في برِّ يمينه أن يقول: "الحمد لله حمداً يوافي نعمه ويكافئ مزيده" قالوا: ومعنى يوافي نعمه أي يلاقيها فتحصل النعم معه، ويكافئ ـ مهموز ـ أي يساوي مزيد نعمه، والمعنى: أنَّه يقوم بشكر ما زاد من النعم والإحسان".

قال ابن القيِّم رحمه الله: والمعروف من الحمد الذي حمد الله به نفسه وحمده به رسوله صلى الله عليه وسلم وسادات العارفين بحمده من أمته ليس فيه هذا اللفظ ألبتة، وأورد بعض صيغ الحمد الواردة في القرآن ثم قال: فهذا حمدُه لنفسه الذي أنزله في كتابه وعلَّمه لعباده، وأخبر عن أهل جنَّته به، وهو آكد من كلِّ حمدٍ وأفضلُ وأكملُ، كيف يبرُّ الحالف في يمينه بالعدول إلى لفظ لم يحمد به نفسه، ولا ثبت عن رسول الله صلى الله عليه وسلم، ولا سادات العارفين من أمته، والنبي صلى الله عليه وسلم كان إذا حمد الله في الأوقات التي يتأكّد فيها الحمد لم يكن يذكر هذا الحمدَ ألبتة كما في حمد الخطبة، والحمد الذي تستفتح به الأمور، وكما في تشهّد الحاجة، وكما في الحمد عقب الطعام والشراب واللباس والخروج من الخلاء، والحمد عند رؤية ما يسرّه وما لا يسرّه ... ".

""";

  static const String hamd54 =
      """ أبي نصر وآدم إلا الله تعالى، وذكر الحديث المتقدّم ثم قال: فهذا لو رواه أبو نصر التمّار عن سيِّد ولد آدم صلى الله عليه وسلم لما قبلت روايته لانقطاع الحديث فيما بينه وبين رسول الله صلى الله عليه وسلم فكيف بروايته له عن آدم.

وقد ظنَّ طائفة من الناس أنَّ هذا الحمد بهذا اللفظ أكمل حمدٍ حُمِد اللهُ به وأفضله وأجمعه لأنواع الحمد، وبنوا على هذا مسألة فقهيّة فقالوا: لو حلف إنسانٌ ليحمدنَّ اللهَ بمجامع الحمد وأجلِّ المحامد فطريقه في برِّ يمينه أن يقول: "الحمد لله حمداً يوافي نعمه ويكافئ مزيده" قالوا: ومعنى يوافي نعمه أي يلاقيها فتحصل النعم معه، ويكافئ ـ مهموز ـ أي يساوي مزيد نعمه، والمعنى: أنَّه يقوم بشكر ما زاد من النعم والإحسان".

قال ابن القيِّم رحمه الله: والمعروف من الحمد الذي حمد الله به نفسه وحمده به رسوله صلى الله عليه وسلم وسادات العارفين بحمده من أمته ليس فيه هذا اللفظ ألبتة، وأورد بعض صيغ الحمد الواردة في القرآن ثم قال: فهذا حمدُه لنفسه الذي أنزله في كتابه وعلَّمه لعباده، وأخبر عن أهل جنَّته به، وهو آكد من كلِّ حمدٍ وأفضلُ وأكملُ، كيف يبرُّ الحالف في يمينه بالعدول إلى لفظ لم يحمد به نفسه، ولا ثبت عن رسول الله صلى الله عليه وسلم، ولا سادات العارفين من أمته، والنبي صلى الله عليه وسلم كان إذا حمد الله في الأوقات التي يتأكّد فيها الحمد لم يكن يذكر هذا الحمدَ ألبتة كما في حمد الخطبة، والحمد الذي تستفتح به الأمور، وكما في تشهّد الحاجة، وكما في الحمد عقب الطعام والشراب واللباس والخروج من الخلاء، والحمد عند رؤية ما يسرّه وما لا يسرّه ... ".

""";
  static const String hamd55 =
      """ثم ساق رحمه الله جملةً كبيرةً مما ورد عن النبي صلى الله عليه وسلم من صيغ الحمد مما يقال في مثل هذه الأوقات، ثم قال: "فهذا جُملُ مواقع الحمد في كلام الله ورسوله وأصحابه والملائكة قد جُلِّيتْ عليك عرائسها وجُلِبَتْ إليك نفائسها، فلو كان الحديث المسؤول عنه أفضلَها وأكملَها وأجمعَها كما ظنّه الظانّ لكان واسطة عقدها في النظام، وأكثرِها استعمالاً في حمد ذي الجلال والإكرام"١. اهـ.

وبهذا التحقيق الذي ذكره رحمه الله يتبيّن ضعف هذه الصيغة في الحمد من جهة الرواية، وأنها لو كانت صحيحةً ومشتملةً على أكمل الصيغ لما عدل عنها رسول الله صلى الله عليه وسلم، ولما آثر غيرها عليها، قالت عائشة رضي الله عنها: "كان رسول الله صلى الله عليه وسلم يستحبّ الجوامع من الدعاء، ويدَعُ ما سوى ذلك"، رواه أبو داود وغيرُه.

وسبق أن مرّ معنا قول النبي صلى الله عليه وسلم: "أفضلُ الدعاء الحمد لله"، وبهذا يُعلم أنَّ هذه الصيغة في الحمد لو كانت أكملَ لما تركها رسول الله صلى الله عليه وسلم.

ثم إنَّه أيضاً لا يمكن للعبد أن يحمد الله حمداً يوافي نعمة واحدة من نعم الله، فضلاً عن موافاته جميع نعم الله، ولا يمكن أن يكون فعلُ العبد وحمدُه له مكافئاً للمزيد، قال ابن القيّم رحمه الله: "فهذا من أمحل المحال، فإنّ العبد لو أقْدَرَه الله على عبادة الثَّقلين لم يقم بشكر أدنى نعمة عليه ... فمن الذي يقوم بشكر ربِّه الذي يستحقه سبحانه فضلاً عن أن يكافئه"٢.

١ صيغ الحمد المطبوع باسم مطالع السعد (ص:٩٨) 
٢ صيغ الحمد المطبوع باسم مطالع السعد (ص:٤١،٤٤) 

 """;
  static const String hamd56 =
      """وقال رحمه الله: " ... ولكن يحمل على وجه يصح، وهو أنَّ الذي يستحقه الله سبحانه من الحمد حمداً يكون موافياً لنعمه ومكافئاً لمزيده وإن لم يَقدِر العبدُ أن يأتي به"١.

وأحسنُ من هذا وأكملُ ما ثبت في صحيح البخاري وغيره عن أبي أمامة الباهلي أنَّ النبيّ صلى الله عليه وسلم كان إذا رفع مائدته قال: "الحمد لله حمداً كثيراً طيّباً مباركاً فيه غير مكفيٍّ، ولا مودَّع، ولا مستغنى عنه ربّنا"٢، فلو كانت تلك الصيغة وهي قوله: "حمداً يوافي نعمه ويكافئ مزيده" أكمل وأفضل من هذه لما عدل عنها رسول الله صلى الله عليه وسلم، فإنّه لا يختار إلاّ الأفضل والأكمل.

قال شيخ الإسلام ابن تيمية رحمه الله في معنى هذا الحديث: "المخلوق إذا أنعم عليك بنعمة أمكنك أن تكافئه، ونعمُهُ لا تدوم عليك، بل لا بدّ أن يودِّعك ويقطعها عنك، ويمكنك أن تستغني عنه، والله عز وجل لا يمكن أن تكافئه على نعمه، وإذا أنعم عليك أدام نعمَه، فإنّه هو أغنى وأقنى، ولا يُستغنى عنه طرفة عين". اهـ٣.

وفيه بيانٌ لعظم دلالات الأدعية المأثورة والأذكار الثابتة وعمق معانيها وسلامتها من الخطأ الذي قد يعتري ما سواها، وبهذا تكون السلامةُ وتحصيل الكامل.

فالحمد لله بمحامده التي حمد بها نفسه، وحمده بها الذين اصطفى من خلقه حمداً كثيراً طيّباً مباركاً فيه كما يحب ربّنا ويرضى.

١ عدة الصابرين (ص:١٧٦) 
٢ صحيح البخاري (رقم:٥٤٥٩) 
٣ صيغ الحمد لابن القيم المطبوع باسم مطالع السعد (ص:٤٩) 

 """;
}
