class SalatAlaRasoulAllahText {
  static const String salat1 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ

---------------------
١ - عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَ: أَتَانَا رَسُولُ الله - صلى الله عليه وآله وسلم - وَنَحْنُ فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ: أَمَرَنَا اللهُ تَعَالَى أَنَّ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللهِ؛ فَكَيْفَ نُصَلِّي عَلَيْكَ؟

فَسَكَتَ رَسُولُ اللهِ - صلى الله عليه وآله وسلم - حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ، ثُمَّ قَالَ رَسُولُ اللهِ - صلى الله عليه وآله وسلم -: «قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ» (رواه مسلم).

ورواه الترمذي ولفظه: ... قَالَ رَسُولُ الله - صلى الله عليه وآله وسلم -: «قُولُوا: اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ» (صحيح).


 """;
  static const String salat2 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ

---------------------
      ٢ - عن أَبِي حُمَيْدٍ السَّاعِدِيُّ - رضي الله عنه - أَنَّهُمْ قَالُوا: يَا رَسُولَ اللهِ كَيْفَ نُصَلِّي عَلَيْكَ؟ فَقَالَ رَسُولُ الله - صلى الله عليه وآله وسلم -: «قُولُوا: اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَأَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ» (رواه البخاري).

 """;

  static const String salat3 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.
اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ

---------------------
٣ - عن عَبْدَ الرَّحْمَنِ بْنَ أَبِي لَيْلَى قَالَ لَقِيَنِي كَعْبُ بْنُ عُجْرَةَ فَقَالَ: أَلَا أُهْدِي لَكَ هَدِيَّةً سَمِعْتُهَا مِنْ النَّبِيِّ - صلى الله عليه وآله وسلم -؟

فَقُلْتُ: بَلَى، فَأَهْدِهَا لِي.

فَقَالَ: سَأَلْنَا رَسُولَ اللهِ - صلى الله عليه وآله وسلم -، فَقُلْنَا: يَا رَسُولَ اللهِ، كَيْفَ الصَّلَاةُ عَلَيْكُمْ أَهْلَ الْبَيْتِ فَإِنَّ اللهَ قَدْ عَلَّمَنَا كَيْفَ نُسَلِّمُ عَلَيْكُمْ؟

قَالَ: «قُولُوا: اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.
اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ». (رواه البخاري).

قَوْلهم: (كَيْف نُسَلِّم عَلَيْك) قَالَ الْبَيْهَقِيُّ: فِيهِ إِشَارَة إِلَى السَّلَام الَّذِي فِي التَّشَهُّد وَهُوَ قَوْل: «السَّلَام عَلَيْك أَيّهَا النَّبِيّ وَرَحْمَة اللهِ وَبَرَكَاته»؛ فَيَكُون الْمُرَاد بِقَوْلِهِمْ: «فَكَيْف نُصَلِّي عَلَيْك» أَيْ بَعْد التَّشَهُّد.


 """;

  static const String salat4 = """ 
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ. وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ

---------------------
  ٤ - عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ - رضي الله عنه - قَالَ: قُلْنَا: يَا رَسُولَ الله، هَذَا التَّسْلِيمُ فَكَيْفَ نُصَلِّي عَلَيْكَ؟

قَالَ: «قُولُوا: اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ. وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ» (رواه البخاري).

""";

  static const String salat5 = """
 اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ

---------------------
٥ - عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ - رضي الله عنه - قَالَ: قُلْنَا: يَا رَسُولَ اللهِ هَذَا السَّلَامُ عَلَيْكَ فَكَيْفَ نُصَلِّي؟
قَالَ: «قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ» (رواه البخاري).

 """;

  static const String salat8 = """
 اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وعَلَى أَهْلِ بَيْتِهِ وعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ بَيْتِهِ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ
 
---------------------
  (رواه أحمد والطحاوي بسند صحيح)

قال الشيخ الألباني: وهذا كان يدعو به هو نفسه - صلى الله عليه وآله وسلم -.

""";

  static const String salat10 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ
 
---------------------
  (رواه أحمد والنسائي وأبو يعلى)
""";

  static const String salat11 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ
 
---------------------
  (رواه مسلم وأبو عوانة)

""";

  static const String salat12 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى ِإبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ
 
---------------------
  (رواه البخاري والنسائي والطحاوي وأحمد)

""";

  static const String salat13 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ
 
---------------------
  (رواه البخاري ومسلم)

""";

  static const String salat14 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ وَبَارَكْتَ عَلَى إِبْرَاهِيمَ وَآلِ إِبْرَاهِيمَ؛ إِنَّكَ حَمِيدٌ مَجِيدٌ
  
---------------------
  (رواه النسائي والطحاوي)
""";

  static const salat15 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ 
 """;

  static const salat16 = """
اللهم صلى على محمد كما صليت على آل إبراهيم اللهم بارك على محمد كما باركت على آل إبراهيم 
---------------------
  صحيح الإسناد - النسائي """;

  static const salat17 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ

 """;

  static const salat18 = """
 اللهم صل وسلم على نبينا محمد عدد ماذكره الذاكرون وصل وسلم على نبينا محمد عدد ما غفل عنه ذكرة الغافلون""";

  static const salat19 = """ 
  اللهم صل وسلم على نبينا محمد في الاولين 
  وصل وسلم على نبينا محمد في الاخرين
   وصل وسلم على نبينا محمد في كل وقت وحين 
  وصل وسلم على نبينا محمد في الملأ الأعلى إلى يوم الدين 
  وصل وسلم على نبينا محمد حتى ترث الأرض ومن عليها وأنت ياالله خير الوارثين.
  """;

  static const salat20 = """
 اللهم صل وسلم وبارك على محمد عبدك ورسولك -النبي الأمي 
  وعلى اله وأصحابه وازواجه وذريته عدد خلقك ورضى نفسك وزنه عرشك ومداد كلماتك """;

  static const salat21 = """
اللهم صل على محمد عبدك ورسولك النبي الأمي وعلى آله وأصحابه
وازواجه وذريته وسلم تسليما كثيرا
 """;

  static const salat22 = """
اللهم لك الحمد كما أنت اهله فصل على محمد كما انت اهله
   وافعل بنا ما انت اهله فانك اهل التقوى واهل المغفرة
    """;

  static const salat23 = """
اللهم صل على محمد وعلى ال محمد صلاة دائمة بدوامك """;

  static const salat24 = """
اللهم صل وسلم على نبينا محمد صلاة تغفر بها ذنوبنا
 
اللهم صل وسلم على نبينا محمد صلاة تكشف بها كروبنا 
   
للهم صل وسلم على نبينا محمد صلاة ترضيك عنا

اللهم صل وسلم على نبينا محمد صلاة تقضى بها حوائجنا
  
اللهم صل على وسلم نبينا محمد صلاة تبلغنا فيما يرضيك أمالنا
 
اللهم صل وسلم على نبينا محمد صلاة تكفنا بها ما اهمنا 
 
اللهم صل وسلم على نبينا محمد صلاة تستر بها عوراتنا  
 
اللهم صل وسلم على نبينا محمد صلاة تصلح بها أحوالنا
 
اللهم صل وسلم على نبينا محمد صلاة تشفي بها أمراضنا 

اللهم صل وسلم على نبينا محمد صلاة تعافي بها أبداننا 

اللهم صل وسلم على نبينا محمد صلاة تعافي بها مبتلانا
 
للهم صل وسلم على نبينا محمد صلاة توسع بها أرزاقنا 
 
اللهم صل وسلم على نبينا محمد صلاة تهدي بها أبنائنا 
 
اللهم صل وسلم على نبينا محمد صلاة تدبر بها أمورنا 

اللهم صل وسلم على نبينا محمد صلاة تنجنا بها من الفتن

اللهم صل وسلم على نبينا محمد صلاة تفتح لنا بها أبواب الفرج

اللهم صل وسلم على نبينا محمد صلاة توفقنا بها إلى كل خير  
 
للهم صل وسلم على نبينا محمد صلاة تبعدنا بها عن كل شر

اللهم صل وسلم على نبينا محمد صلاة تثبتنا بها حتى نلقاك 

اللهم صل وسلم على نبينا محمد وآله وصحبة صلاة وسلاما ملئ السموات وملئ الأرض وملئ مابينهما وملئ ماشئت من شيء بعد 
   """;

  static const salat244 = """ 
اللهم صل وسلم على نبينا محمد كما أمرت أن يصلى عليه 
اللهم صل على وسلم على نبينا محمد كما ينبغي الصلاة عليه 
اللهم صل وسلم على نبينا محمد عدد من يصل عليه 
اللهم صل وسلم على نبينا محمد عدد من لم يصل عليه 
اللهم صل وسلم على نبينا محمد كما تحب أن يصلى عليه 
اللهم صل على نبينا محمد وعلى اله وصحبه أجمعين.
  """;

  static const salat2555 = """ 
اللهم صل وسلم على نبينا محمد عدد ذرات الرمال 
اللهم صل وسلم على نبينا محمد عدد أوراق الأشجار
اللهم صل وسلم على نبينا محمد عدد قطرات الأمطار
اللهم صل وسلم على نبينا محمد عدد مثاقيل البحار
اللهم صل وسلم على نبينا محمد عدد ما تعاقب عليه الليل وأشرق عليه النهار

  """;

  static const salat25 = """ 
صلى الله على محمد 

صل الله عليه وسلم 

عليه الصلاة والسلام 

اللهم صل على محمد وعلى اله وصحبه وسلم 
صلى الله عليه واله وصحبه وسلم 
  """;

  static const String salat255 = """
   ****************************
   فضائل الصلاة على نبينا محمد صلى الله عليه وسلم  
   ****************************
 """;

  static const String salat26 = """
٢ - حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ قَالَ أَنْبَأَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ سُلَيْمَانَ، مَوْلَى الْحَسَنِ بْنِ عَلِيٍّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ جَاءَ يَوْمًا وَالْبِشْرُ يُرَى فِي وَجْهِهِ فَقَالُوا: يَا رَسُولَ اللَّهِ إِنَّا نَرَى فِي وَجْهِكَ بِشْرًا لَمْ نَكُنْ نَرَاهُ قَالَ: " أَجَلْ إِنَّهُ أَتَانِي مَلَكٌ، فَقَالَ: يَا مُحَمَّدُ إِنَّ رَبَّكَ يَقُولُ أَمَا يُرْضِيكَ أَلَّا يُصَلِّيَ عَلَيْكَ أَحَدٌ مِنْ أُمَّتِكَ إِلَّا صَلَّيْتُ عَلَيْهِ عَشْرًا وَلَا سَلَّمَ عَلَيْكَ إِلَّا سَلَّمْتُ عَلَيْهِ عَشْرًا؟ "

  """;

  static const String salat27 =
      """أَنْبَأَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي أَخِي، عَنْ سُلَيْمَانَ بْنِ ⦗٢٤⦘ بِلَالٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، قَالَ أَنَسُ بْنُ مَالِكٍ: قَالَ أَبُو طَلْحَةَ: إِنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ خَرَجَ عَلَيْهِمْ يَوْمًا يَعْرِفُونَ الْبِشْرَ فِي وَجْهِهِ فَقَالُوا إِنَّا نَعْرِفُ الْآنَ فِي وَجْهِكَ الْبِشْرَ يَا رَسُولَ اللَّهِ قَالَ: «أَجَلْ، أَتَانِي الْآنَ آتٍ مِنْ رَبِّي فَأَخْبَرَنِي أَنَّهُ لَنْ يُصَلِّيَ عَلَيَّ أَحَدٌ مِنْ أُمَّتِي إِلَّا رَدَّهَا اللَّهُ عَلَيْهِ عَشْرَ أَمْثَالِهَا»

 """;
  static const String salat28 =
      """٣ - حَدَّثَنَا إِسْحَاقُ بْنُ مُحَمَّدٍ الْفَرْوِيُّ قَالَ ثنا أَبُو طَلْحَةَ الْأَنْصَارِيُّ، عَنْ أَبِيهِ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَنْ صَلَّى عَلَيَّ وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا فَلْيُكْثِرْ عَدَدَ ذَلِكَ أَوْ لِيُقِلَّ»

 """;
  static const String salat29 =
      """٤ - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَ: ثنا سَلَمَةُ بْنُ وَرْدَانَ قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ قَالَ: خَرَجَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَتَبَرَّزُ فَلَمْ يَجِدْ أَحَدًا يَتْبَعُهُ فَهَرَعَ عُمَرُ فَاتَّبَعَهُ بِمَطْهَرَةٍ - يَعْنِي: إِدَاوَةً - فَوَجَدَهُ سَاجِدًا فِي شَرَبَةٍ فَتَنَحَّى عُمَرُ فَجَلَسَ وَرَاءَهُ حَتَّى رَفَعَ رَأْسَهُ قَالَ: فَقَالَ: " أَحْسَنْتَ يَا عُمَرُ حِينَ وَجَدْتَنِي سَاجِدًا فَتَنَحَّيْتَ عَنِّي؛ إِنَّ جِبْرِيلَ عَلَيْهِ السَّلَامُ أَتَانِي فَقَالَ: مَنْ صَلَّى عَلَيْكَ وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا وَرَفَعَهُ عَشْرَ دَرَجَاتٍ "

 """;
  static const String salat30 =
      """٥ - حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدٍ، حَدَّثَنِي أَنَسُ بْنُ عِيَاضٍ، عَنْ سَلَمَةَ بْنِ وَرْدَانَ، حَدَّثَنِي مَالِكُ بْنُ أَوْسِ بْنِ الْحَدَثَانِ، عَنْ عُمَرَ بْنِ الْخَطَّابِ قَالَ: خَرَجَ النَّبِيُّ يَتَبَرَّزُ فَاتَّبَعْتُهُ بِإِدَاوَةٍ فَوَجَدْتُهُ قَدْ فَرَغَ وَوَجَدْتُهُ سَاجِدًا لِلَّهِ فِي شَرَبَةٍ، فَتَنَحَّيْتُ عَنْهُ فَلَمَّا فَرَغَ رَفَعَ رَأْسَهُ فَقَالَ: " أَحْسَنْتَ يَا عُمَرُ حِينَ تَنَحَّيْتَ عَنِّي، إِنَّ جِبْرِيلَ أَتَانِي فَقَالَ: «مَنْ صَلَّى عَلَيْكَ صَلَاةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا وَرَفَعَهُ عَشْرَ دَرَجَاتٍ»

 """;
  static const String salat300 =
      """٦ - حَدَّثَنَا عَاصِمُ بْنُ عَلِيٍّ قَالَ: ثنا شُعْبَةُ بْنُ الْحَجَّاجِ، عَنْ عَاصِمِ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، عَنْ أَبِيهِ قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا مِنْ عَبْدٍ يُصَلِّي عَلَيَّ إِلَّا صَلَّتْ عَلَيْهِ الْمَلَائِكَةُ مَا صَلَّى عَلَيَّ، فَلْيُقِلَّ مِنْ ذَلِكَ أَوْ لِيُكْثِرْ»

 """;
  static const String salat31 =
      """٧ - حَدَّثَنَا يَحْيَى بْنُ عَبْدِ الْحَمِيدِ قَالَ: ثنا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، عَنْ عَمْرِو بْنِ أَبِي عَمْرَةَ، عَنْ عَبْدِ الْوَاحِدِ بْنِ مُحَمَّدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ: أَتَيْتُ النَّبِيَّ وَهُوَ سَاجِدٌ فَأَطَالَ السُّجُودَ قَالَ: " أَتَانِي جِبْرِيلُ قَالَ: مَنْ صَلَّى عَلَيْكَ صَلَّيْتُ عَلَيْهِ، وَمَنْ سَلَّمَ عَلَيْكَ سَلَّمْتُ عَلَيْهِ فَسَجَدْتُ لِلَّهِ شُكْرًا "

 """;
  static const String salat32 =
      """٨ - حَدَّثَنَا أَبُو ثَابِتٍ قَالَ: ثنا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنِ الْعَلَاءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ صَلَّى عَلَيَّ، صَلَّى اللَّهُ عَلَيْهِ عَشْرًا»

 """;
  static const String salat33 =
      """٩ - حَدَّثَنَا عِيسَى بْنُ مِينَاءٍ قَالَ: ثنا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنِ الْعَلَاءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مَنْ صَلَّى عَلَيَّ وَاحِدَةً، صَلَّى اللَّهُ عَلَيْهِ عَشْرًا»

 """;
  static const String salat35 =
      """١٠ - حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ: ثنا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنِي مُوسَى بْنُ عُبَيْدَةَ قَالَ: أَخْبَرَنِي قَيْسُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَبِي صَعْصَعَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ: كَانَ لَا يُفَارِقُ فَيْءَ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِاللَّيْلِ وَالنَّهَارِ خَمْسَةُ نَفَرٍ مِنْ أَصْحَابِهِ أَوْ أَرْبَعَةٌ لِمَا يَنُوبُهُ مِنْ حَوَائِجِهِ. قَالَ: فَجِئْتُ فَوَجَدْتُهُ قَدْ خَرَجَ فَتَبِعْتُهُ فَدَخَلَ حَائِطًا مِنْ حِيطَانِ ⦗٢٩⦘ الْأَسْوَافِ فَصَلَّى فَسَجَدَ سَجْدَةً أَطَالَ فِيهَا فَحَزِنْتُ وَبَكَيْتُ فَقُلْتُ: لَأَرَى رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ قَبَضَ اللَّهُ رُوحَهُ قَالَ: فَرَفَعَ رَأْسَهُ وَتَرَاءَيْتُ لَهُ فَدَعَانِي فَقَالَ: «مَا لَكَ؟» قُلْتُ: يَا رَسُولَ اللَّهِ سَجَدْتَ سَجْدَةً أَطَلْتَ فِيهَا فَحَزِنْتُ وَبَكَيْتُ وَقُلْتُ: لَأَرَى رَسُولَ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَدْ قَبَضَ اللَّهُ رُوحَهُ قَالَ: «هَذِهِ سَجْدَةٌ سَجَدْتُهَا شُكْرًا لِرَبِّي فِيمَا آتَانِي فِي أُمَّتِي , مَنْ صَلَّى عَلَيَّ صَلَاةً كَتَبَ اللَّهُ لَهُ عَشْرَ حَسَنَاتٍ»

 """;
  static const String salat36 =
      """١٢ - حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ وَاقِدٍ الْعَطَّارُ قَالَ: ثنا هُشَيْمٌ قَالَ: ثنا الْعَوَّامُ بْنُ حَوْشَبٍ، حَدَّثَنِي رَجُلٌ مِنْ بَنِي أَسَدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَمْرٍو قَالَ: «مَنْ صَلَّى عَلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ كَتَبَ اللَّهُ لَهُ عَشْرَ حَسَنَاتٍ وَمَحَا عَنْهُ عَشْرَ سَيِّئَاتٍ وَرَفَعَ لَهُ عَشْرَ دَرَجَاتٍ»

 """;
  static const String salat37 =
      """١٣ - حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ قَالَ: ثنا سُفْيَانُ، عَنْ يَعْقُوبَ بْنِ زَيْدِ بْنِ طَلْحَةَ التَّيْمِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: " أَتَانِي آتٍ مِنْ رَبِّي فَقَالَ: مَا مِنْ عَبْدٍ يُصَلِّي عَلَيْكَ صَلَاةً إِلَّا صَلَّى اللَّهُ عَلَيْهِ بِهَا عَشْرًا ". فَقَامَ إِلَيْهِ رَجُلٌ فَقَالَ: يَا رَسُولَ اللَّهِ أَجْعَلُ نِصْفَ دُعَائِي لَكَ؟ قَالَ: «إِنْ شِئْتَ» قَالَ: أَلَا أَجْعَلُ ثُلُثَيْ دُعَائِي لَكَ؟ قَالَ: «إِنْ شِئْتَ» قَالَ: أَلَا أَجْعَلُ دُعَائِي لَكَ كُلَّهُ؟ قَالَ: «إِذَنْ يَكْفِيكَ اللَّهُ هَمَّ الدُّنْيَا، وَهَمَّ الْآخِرَةِ» . قَالَ شَيْخٌ كَانَ بِمَكَّةَ يُقَالُ لَهُ مَنِيعٌ لِسُفْيَانَ: عَمَّنْ أَسْنَدَهُ؟ قَالَ: لَا أَدْرِي

 """;
  static const String salat38 =
      """١٤ - حَدَّثَنَا سَعِيدُ بْنُ سَلَّامٍ الْعَطَّارُ قَالَ: ثنا سُفْيَانُ - يَعْنِي الثَّوْرِيَّ -، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنِ الطُّفَيْلِ بْنِ أُبَيِّ بْنِ كَعْبٍ، عَنْ أَبِيهِ قَالَ: كَانَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَخْرُجُ فِي ثُلُثَيِ اللَّيْلِ فَيَقُولُ: «جَاءَتِ الرَّاجِفَةُ تَتْبَعُهَا الرَّادِفَةُ، جَاءَ الْمَوْتُ بِمَا فِيهِ» ، وَقَالَ أُبَيٌّ: يَا رَسُولَ اللَّهِ إِنِّي أُصَلِّي مِنَ اللَّيْلِ أَفَأَجْعَلُ لَكَ ثُلُثَ صَلَاتِي قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: ⦗٣٢⦘ «الشَّطْرُ» قَالَ: أَفَأَجْعَلُ لَكَ شَطْرَ صَلَاتِي قَالَ رَسُولُ اللَّهِ «الثُّلُثَانِ أَكْثَرُ» قَالَ: أَفَأَجْعَلُ لَكَ صَلَاتِي كُلَّهَا؟ قَالَ: «إِذَنْ يُغْفَرُ لَكَ ذَنْبُكَ كُلُّهُ»

 """;
  static const String salat39 =
      """١٥ - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ قَالَ: ثنا سَلَمَةُ بْنُ وَرْدَانَ قَالَ: سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ: ارْتَقَى النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عَلَى الْمِنْبَرِ دَرَجَةً فَقَالَ: «آمِينَ» ثُمَّ ارْتَقَى الثَّانِيَةَ فَقَالَ: «آمِينَ» ثُمَّ ارْتَقَى الثَّالِثَةَ فَقَالَ: «آمِينَ» ثُمَّ اسْتَوَى فَجَلَسَ فَقَالَ أَصْحَابُهُ: عَلَامَ أَمَّنْتَ؟ قَالَ: " ⦗٣٣⦘ أَتَانِي جِبْرِيلُ فَقَالَ: رَغِمَ أَنْفُ امْرِئٍ ذُكِرْتَ عِنْدَهُ فَلَمْ يُصِلِّ عَلَيْكَ، فَقُلْتُ: آمِينَ، فَقَالَ: رَغِمَ أَنْفُ امْرِئٍ أَدْرَكَ أَبَوَيْهِ فَلَمْ يَدْخُلِ الْجَنَّةَ، فَقُلْتُ: آمِينَ، فَقَالَ: رَغِمَ أَنْفُ امْرِئٍ أَدْرَكَ رَمَضَانَ فَلَمْ يُغْفَرْ لَهُ فَقُلْتُ: آمِينَ "

 """;
  static const String salat40 =
      """٢٤ - حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْحَجَّاجِ قَالَ: ثنا وُهَيْبٌ، عَنْ أَيُّوبَ قَالَ: بَلَغَنِي - وَاللَّهُ أَعْلَمُ - أَنَّ مَلَكًا مُوَكَّلٌ بِكُلِّ مَنْ صَلَّى عَلَى النَّبِيِّ حَتَّى يُبَلِّغَهُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ

 """;
  static const String salat41 =
      """٤٤ - حَدَّثَنَا إِبْرَاهِيمُ بْنُ حَجَّاجٍ قَالَ: ثنا وُهَيْبٌ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ قَالَ: «مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ فَقَدْ خَطِئَ طَرِيقَ الْجَنَّةِ»

 """;
  static const String salat42 =
      """٥٤ - حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ قَالَ: ثنا سُفْيَانُ بْنُ سَعِيدٍ، عَنْ صَالِحٍ، مَوْلَى التَّوْأَمَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «مَا جَلَسَ قَوْمٌ مَجْلِسًا لَمْ يَذْكُرُوا اللَّهَ، وَلَمْ يُصَلُّوا عَلَى نَبِيِّهِمْ، إِلَّا كَانَ مَجْلِسُهُمْ عَلَيْهِمْ تِرَةً يَوْمَ الْقِيَامَةِ إِنْ شَاءَ عَفَا عَنْهُمْ وَإِنْ شَاءَ أَخَذَهُمْ»

 """;

  static const String salat43 = """مختصر فضلائل الصلاة على الرسول:-
     طاعة لله سبحانة وتعالى
      صلاة واحدة - تؤجر عشر حسنات
     صلاة واحدة - ترفع عشر درجات
     صلاة واحدة - تغفر لك عشر سيئات 
     صلاة واحدة - تتنزل عليك من الله عشر رحمات 
     صلاة واحدة - يوكل الله لك ملك يبلغ صلاتك للنبي
     صلاة واحدة - يرد النبي عليك السلام
     تنال شفاعة النبي
     تكفي همك ويغفر ذنبك 
     يزيد حب النبي في قلبك 
     لن تخطأ طريق الجنة
     ستكون اولى الناس بالنبي يوم القيامة إذا أكثرت من الصلاه عليه 
     يجاب دعائك 
 """;

  static const salat44 = """
اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ

---------------------
١ - عَنْ أَبِي مَسْعُودٍ الْأَنْصَارِيِّ قَالَ: أَتَانَا رَسُولُ الله - صلى الله عليه وآله وسلم - وَنَحْنُ فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ: أَمَرَنَا اللهُ تَعَالَى أَنَّ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللهِ؛ فَكَيْفَ نُصَلِّي عَلَيْكَ؟

فَسَكَتَ رَسُولُ اللهِ - صلى الله عليه وآله وسلم - حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ، ثُمَّ قَالَ رَسُولُ اللهِ - صلى الله عليه وآله وسلم -: «قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ» (رواه مسلم).
""";
}
