class TasbihText {
  static const String tasbih21 = """ 
 سبحان الله وبحمده أستغفر الله و أتوب إليه
 
----------
قال الامام أبو بكر بن ابي شيبة في مصنفه (29429) حدثنا محمد بن فضيل عن عاصم عن ثابت البناني قال حدثني رجل من اصحاب محمد صلى الله عليه و سلم عند هذه السارية قال:" من قال سبحان الله وبحمده أستغفر الله وأتوب إليه كتبت له في رق ثم طبع عليها خاتما من مسك فلم يكسر حتى يوافى بها يوم القيامة 
إسناد صحيح على شرط الشيخين.

  """;
  static const String tasbih22 = """ 
 سبحان الله و بحمده عدد خلقه و رضا نفسه و زنة عرشه ومداد كلماته
 
----------
عن أم المؤمنين جويرية بنت الحارث رضي الله عنها أن النبي صلى الله عليه وسلم خرج من عندها بكرة حين صلى الصبح وهي في مسجدها ثم رجع بعد أن أضحى وهي جالسة فقال مازلت على الحال التي فارقتك عليها قالت نعم فقال النبي صلى الله عليه وسلم لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن سبحان الله وبحمده عدد خلقه ورضاء نفسه وزنة عرشه ومداد كلماته
رواه مسلم .
وفي رواية له سبحان الله عدد خلقه سبحان الله رضاء نفسه سبحان الله زنة عرشه سبحان الله مداد كلماته .
وفي رواية الترمذي ألا أعلمك كلمات تقولينها سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله زنة عرشه سبحان الله مداد كلماته سبحان الله مداد كلماته سبحان الله مداد كلماته .
""";
  static const String tasbih23 = """ 
 سبحان الله وبحمده

----------
وعن جابر رضي الله عنه عن النبي صلى الله عليه وسلم قال من قال سبحان الله وبحمده غرست له نخلة في الجنة
رواه الترمذي وقال حديث حسن 
وثبت في صحيح مسلم من حديث أبي ذرٍّ أنَّ رسول الله صلى الله عليه وسلم سُئِل: أيُّ الكلام أفضل؟ قال: "ما اصطفى الله لملائكته أو لِعباده: سبحان الله وبحمده
صحيح مسلم (رقم:٢٧٣١) 

 وفي لفظ آخر للحديث أنَّ أبا ذرّ قال: قال رسول الله صلى الله عليه وسلم
 ألا أخبرك بأحبِّ الكلام إلى الله؟ قلتُ: يا رسول الله أخبرني بأحبِّ الكلام إلى الله. قال: إنَّ أحبَّ الكلام إلى الله: سبحان الله وبحمده. فدلّ هذا الحديث على عظيم مكانة هذه الكلمة عند الله عز وجل
صحيح مسلم (رقم:٢٧٣١)

ومِن فضائل التسبيح ما أخبر به النبيُّ صلى الله عليه وسلم أنَّ مَن قال: سبحان الله وبحمده في يومٍ مائة مرّة حُطَّت عنه ذنوبُه ولو كثُرت. ففي الصحيح من حديث أبي هريرة رضي الله عنه أنَّ النبيَّ صلى الله عليه وسلم قال: "مَن قال: سبحان الله وبحمده في يوم مائة مرّة حُطَّت خطاياه وإن كانت مِثلَ زَبَدِ البحر
 صحيح البخاري (رقم:٦٤٠٥) ، وصحيح مسلم (رقم:٢٦٩١) 
""";

  static const String tasbih24 = """ 
سبحان الله العظيم وبحمده

----------
عن أم المؤمنين جويرية بنت الحارث رضي الله عنها أن النبي صلى الله عليه وسلم خرج من عندها بكرة حين صلى الصبح وهي في مسجدها ثم رجع بعد أن أضحى وهي جالسة فقال مازلت على الحال التي فارقتك عليها قالت نعم فقال النبي صلى الله عليه وسلم لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن سبحان الله وبحمده عدد خلقه ورضاء نفسه وزنة عرشه ومداد كلماته
"من قال سبحان الله العظيم وبحمده غرست له نخلة في الجنة»
رواه ابن أبي شيبة في " المصنف " (6/54-طبعة مكتبة الرشد) والنسائي في سننه الكبرى
(9/304-ط.مؤسسة الرسالة) و صححه الألباني.""";

  static const String tasbih25 = """ 
سبحانك وبحمدك لا إله إلا أنت

----------
عن عائشة رضي الله عنها قالت
افتقدت النبي صلى الله عليه وسلم ذات ليلة فتحسست فإذا هو راكع أو ساجد يقول سبحانك وبحمدك لا إله إلا أنت
وفي رواية فوقعت يدي على بطن قدميه وهو في المسجد وهما منصوبتان وهو يقول اللهم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك
رواه مسلم .""";

  static const String tasbih26 = """ 
  سبحان الله والحمد لله ولا إله إلا الله والله أكبر

----------
عن ابن مسعود رضي الله عنه قال قال رسول الله صلى الله عليه وسلم لقيت إبراهيم صلى الله عليه وسلم ليلة أسري بي فقال يا محمد أقرئ أمتك مني السلام وأخبرهم أن الجنة طيبة التربة عذبة الماء وأنها قيعان وأن غراسها سبحان الله والحمد لله ولا إله إلا الله والله أكبر
رواه الترمذي وقال حديث حسن .""";

  static const String tasbih27 = """ 
  سبحان الله عدد ما خلق في السماء وسبحان الله عدد ما خلق في الأرض سبحان الله عدد ما بين ذلك وسبحان الله عدد ما هو خالق
والله أكبر مثل ذلك والحمد لله مثل ذلك ولا إله إلا الله مثل ذلك
----------
عن ابن مسعود رضي الله عنه قال قال رسول الله صلى الله عليه وسلم لقيت إبراهيم صلى الله عليه وسلم ليلة أسري بي فقال يا محمد أقرئ أمتك مني السلام وأخبرهم أن الجنة طيبة التربة عذبة الماء وأنها قيعان وأن غراسها سبحان الله والحمد لله ولا إله إلا الله والله أكبر
عن سعد بن أبي وقاص رضي الله عنه أنه دخل مع رسول الله صلى الله عليه وسلم على امرأة وبين يديها نوى أو حصى تسبح به فقال ألا أخبرك بما هو أيسر عليك من هذا أو أفضل فقال سبحان الله عدد ما خلق في السماء وسبحان الله عدد ما خلق في الأرض سبحان الله عدد ما بين ذلك وسبحان الله عدد ما هو خالق والله أكبر مثل ذلك والحمد لله مثل ذلك ولا إله إلا الله مثل ذلك ولا حول ولا قوة إلا بالله مثل ذلك
رواه الترمذي وقال حديث حسن""";

  static const String tasbih28 = """ 
سُبحانَ اللهُ لا شَريك لهُ ، لهُ الملكُ و لهُ الحمدُ ، وهوَ علَى كلِّ شيءٍ قديرٌ ، لا حولَ و لا قوَّةَ إلَّا باللهِ ، سُبحانَ اللهِ و بحمدِهِ
----------
عن ابن مسعود رضي الله عنه قال قال رسول الله صلى الله عليه وسلم لقيت إبراهيم صلى الله عليه وسلم ليلة أسري بي فقال يا محمد أقرئ أمتك مني السلام وأخبرهم أن الجنة طيبة التربة عذبة الماء وأنها قيعان وأن غراسها سبحان الله والحمد لله ولا إله إلا الله والله أكبر
أحبُّ الكلامِ إلى اللهِ : سُبحانَ اللهُ لا شَريك لهُ ، لهُ الملكُ و لهُ الحمدُ ، وهوَ علَى كلِّ شيءٍ قديرٌ ، لا حولَ و لا قوَّةَ إلَّا باللهِ ، سُبحانَ اللهِ و بحمدِهِ
الراوي: أبو ذر الغفاري المحدث: الألباني - المصدر: صحيح الأدب المفرد - الصفحة أو الرقم:496
خلاصة حكم المحدث: إسناده صحيح""";

  static const String tasbih29 = """
   سُبحانَ ربِّي و بِحمدِهِ

----------
عن ابن مسعود رضي الله عنه قال قال رسول الله صلى الله عليه وسلم لقيت إبراهيم صلى الله عليه وسلم ليلة أسري بي فقال يا محمد أقرئ أمتك مني السلام وأخبرهم أن الجنة طيبة التربة عذبة الماء وأنها قيعان وأن غراسها سبحان الله والحمد لله ولا إله إلا الله والله أكبر
أحَبُّ الكلامِ إلى اللهِ تعالَى ما اصْطفاهُ اللهُ لِملائكتِه : سُبحانَ ربِّي و بِحمدِهِ ، سُبحانَ ربِّي و بِحمدِهِ ، سُبحانَ ربِّي و بِحمدِهِ
الراوي: أبو ذر الغفاري المحدث: الألباني - المصدر: صحيح الجامع - الصفحة أو الرقم: 175
خلاصة حكم المحدث: صحيح
""";

//   static const String tasbih30 = """
//    سبحان الله وبحمده ، والحمد لله ، ولا إله إلا الله ، والله أكبر ، تبارك الله

// ----------
// قال ابن جرير : حدثني محمد بن إسماعيل الأحمسي ، أخبرني جعفر بن عون ، عن عبد الرحمن بن عبد الله المسعودي ، عن عبد الله بن المخارق ، عن أبيه المخارق بن سليم قال : قال لنا عبد الله - هو ابن مسعود - إذا حدثناكم حديثا أتيناكم بتصديق ذلك من كتاب الله : إن العبد المسلم إذا قال : " سبحان الله وبحمده ، والحمد لله ، ولا إله إلا الله ، والله أكبر ، تبارك الله " ، أخذهن ملك فجعلهن تحت جناحه ، ثم صعد بهن إلى السماء فلا يمر بهن على جمع من الملائكة إلا استغفروا لقائلهن ، حتى يجيء بهن وجه الرحمن عز وجل ، ثم قرأ عبد الله : ( إليه يصعد الكلم الطيب والعمل الصالح يرفعه ) .
// تفسير ابن كثير سورة فاطر.
// """;

  static const String tasbih32 = """ 
  لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنْ الظَّالِمِينَ

----------
روى الترمذي في سننه عن سعد بن أبي وقاص رضي الله عنه أن النبي صلى الله عليه وسلم قال
" دَعْوَةُ ذِي النُّونِ إِذْ دَعَا وَهُوَ فِي بَطْنِ الْحُوتِ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنْ الظَّالِمِينَ فَإِنَّهُ ما دعا بِهَا رَجُلٌ مُسْلِمٌ فِي شَيْءٍ قَطُّ إِلَّا اسْتَجَابَ اللَّهُ لَهُ "
(و الذكر وارد فى قصة ذي النون -عليه و على نبينا الصلاة والسلام- فى  
""";

  static const String tasbih33 = """ 
  سبحان ربي العظيم و بحمده ، سبحان ربي الأعلى و بحمده

----------
كانَ إذا ركَعَ قالَ : سُبحانَ ربِّيَ العَظيمِ و بحمدِه ( ثلاثًا ) و إذا سجدَ قالَ :سُبحانَ ربِّيَ الأعلَى وبحمدِه ( ثلاثًا )
الراوي: عقبة بن عامر المحدث: الألباني- المصدر: صحيح الجامع - الصفحة أو الرقم: 4734
خلاصة حكم المحدث: صحيح

  """;

  static const String tasbih36 = """ 
  ومن ذلك أنَّ النبيّ صلى الله عليه وسلم أخبر أنَّ التسبيح أفضل الكلام وأحبُّه إلى الله، وقد سبق أنْ مرَّ معنا قولُ النبيِّ صلى الله عليه وسلم: "أحبُّ الكلام إلى الله أربع: سبحان الله، والحمد لله، ولا إله إلاّ الله، والله أكبر

----------
 صحيح مسلم (رقم:٢١٣٧) .
""";

  static const String tasbih39 = """ 
وثبت عنه صلى الله عليه وسلم أنَّ من قالها في الصّباح مائة مرّة وفي المساء مائة مرّة، لم يأتِ أحدٌ يومَ القيامة بأفضلَ مما جاء به، إلاّ مَن قال مثل ذلك وزاد عليه. فقد روى مسلم في صحيحه من حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: " مَن قال حين يُصبحُ وحين يُمسي: سبحان الله وبحمده مائة مرّة لم يأتِ أحدٌ يومَ القيامة بأفضلَ مما جاء به، إلاّ أَحدٌ قال مثل ما قال أو زاد عليه

----------
صحيح مسلم (رقم:٢٦٩٢)
  """;

  static const String tasbih40 = """ 
وثبت عنه صلى الله عليه وسلم أنَّ من قالها في يومٍ مائة مرّة كُتبت له ألفُ حسنةٍ أو حُطَّت عنه ألفُ خطيئةٍ، والحسنةُ بِعشر أمثالها. روى مسلم في صحيحه عن سعد بن أبي وقَّاص رضي الله عنه قال: كُنَّا عند رسول الله صلى الله عليه وسلم فقال: "أيَعجزُ أحدُكم أن يكسب كلَّ يومٍ ألفَ
حسنةٍ؟ فسأله سائلٌ من جلسائِه: كيف يكسب أحدُنا ألفَ حسنة؟ قال: يسبِّح مائة تسبيحة فيُكتبُ له ألفُ حسنةٍ أو يُحطُّ عنه ألفُ خطيئةٍ 

----------
صحيح مسلم (رقم:٢٦٩٨) 
  """;

  static const String tasbih41 = """
سبحان الله وبحمده، سبحان الله العظيم 

----------
ومما ورد في فضل التسبيح إخبار النبيِّ صلى الله عليه وسلم عن ثِقل التسبيح في الميزان يوم القيامة مع خفّة ويسر العمل به في الدنيا. ففي الصحيحين عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كلمتان حبيبتان إلى الرّحمن، خفيفتان على اللّسان، ثقيلتان في الميزان: سبحان الله وبحمده، سبحان الله العظيم 

----------
- صحيح البخاري (رقم:٦٤٠٦) ، وصحيح مسلم (رقم:٢٦٩٤) 
- رواه الترمذي، وابن حبّان، والحاكم، وغيرهم، من طريق أبي الزبير عن جابر رضي الله عنه عن النبيِّ صلى الله عليه وسلم أنَّه قال: "مَن قال: سبحان الله العظيم وبحمده غُرست له نخلةٌ في الجنَّةِ "١، وله شاهدان
  """;

  static const String tasbih42 = """ 
ومن فضائل هذه الكلمة ما رواه الطبراني، والحاكم، من حديث نافع بن جُبير بن مطعم، عن أبيه، قال: قال رسول الله صلى الله عليه وسلم: "مَن قال سبحان الله وبحمده، سبحانك اللهمّ وبحمدك، أشهد أن لا إله إلاّ أنت، أستغفرك وأتوب إليك، فقالها في مجلس ذكرٍ كانت كالطّابع يطبع عليه، ومَن قالها في مجلس لغوٍ كانت كفَّارة له".

----------
قال الحاكم: "هذا حديث صحيح على شرط مسلم، ولم يخرجاه"، ووافقه الذهبي، وصحّحه العلاّمة الألبانيُّ
  """;

  static const String tasbih43 = """ 
وروى الترمذي وابن حبان والحاكم عن أبي هريرة رضي الله عنه عن النبيِّ صلى الله عليه وسلم أنَّه قال: "مَن جلس في مجلس فكثُر فيه لغَطُه، فقال قبل أن يقوم من مجلسه ذلك: سبحانك اللهمّ ربّنا وبحمدك، أشهد أن لا إله إلاّ أنت، أستغفرك وأتوب إليك، إلاّ غُفر له ما كان في مجلسه ذلك
  
----------
سنن الترمذي (رقم:٣٤٣٣) ، وصحيح ابن حبان (رقم:٥٩٤) ، والمستدرك (١/٥٣٦) ، وصححه العلامة الألباني في صحيح الجامع (رقم:٦١٩٢) 
  """;

  static const String tasbih2 = """٣٧/ فضل التسبيح

لقد كان الحديث فيما سبق عن كلمة التوحيد لا إله إلا الله، فضلِها ومعناها وشروطها، وأمورٍ أخرى هامّة متعلّقة بها، وفيما يلي ننتقل إلى الحديث عن كلمة: (سبحان الله) ، فهي إحدى الكلمات الأربع التي وصفها رسول الله صلى الله عليه وسلم بأنَّها خيرُ الكلام وأحبُّه إلى الله، وذلك في قوله صلى الله عليه وسلم: " أحبّ الكلام إلى الله أربع: سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر"١، وقد مرّ معنا جملة طيّبة من أحاديث النبيّ صلى الله عليه وسلم في تفضيل هؤلاء الكلمات، وبيان ما لهنّ من منزلةٍ عاليةٍ ومكانةٍ رفيعةٍ.

وكلمة: سبحان الله، التي هي إحدى هؤلاء لها شأن عظيم، فهي من أجلِّ الأذكار المقربة إلى الله، ومن أفضل العبادات الموصلة إليه، وقد جاء في بيان فضلها وشرفها وعِظم قدرها نصوصٌ كثيرة في الكتاب والسنة، بل إنَّ ما ورد في ذلك لا يُمكن حصرُه لكثرته وتعدّده، وقد ورد ذكر التسبيح في القرآن الكريم أكثر من ثمانين مرة، بصِيغ مختلفة وأساليب متنوِّعة، فورد تارة بلفظ الأمر كما في قوله تعالى: {يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللهَ ذِكْراً كَثِيراً وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً} ٢، وتارة بلفظ الماضي كما في قوله تعالى: {سَبَّحَ للهِ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ وَهُوَ العَزِيزُ الحَكِيمُ} ٣، وتارة بلفظ المضارع كما في قوله تعالى: {يُسَبِّحُ للهِ
----------
١ صحيح مسلم (رقم:٢١٣٧) .
٢ سورة الأحزاب، الآية: (٤١ ـ ٤٢) .
٣ سورة الحشر، الآية: (١) .

 """;

  static const String tasbih3 =
      """مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ المَلِكِ القُدُّوسِ العَزِيزِ الحَكِيمِ} ١، وتارة بلفظ المصدر كما في قوله تعالى: {سُبْحَانَ رَبِّكَ رَبِّ العِزَّةِ عَمَّا يَصِفُونَ وَسَلاَمٌ عَلَى المُرْسَلِينَ وَالحَمْدُ للهِ رَبِّ العَالَمِينَ} ٢.

وقد ذكر الله سبحانه وتعالى التسبيح في مُفتتح ثمان سُوَر من القرآن الكريم، فقال تعالى في أول سورة الإسراء: {سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ لَيْلاً مِنَ المَسْجِدِ الحَرَامِ إِلَى المَسْجِدِ الأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنا إِنَّهُ هُوَ السَّمِيعُ البَصِيرُ} ٣، وقال تعالى في أول سورة النحل: {أَتَى أَمْرُ اللهِ فَلاَ تَسْتَعْجِلُوهُ سُبْحَانَهُ وَتَعَالَى عَمَّا يُشْرِكُونَ} ٤، وقال تعالى في أوّل سورة الحديد: {سَبَّحَ للهِ مَا فِي السَّمَوَاتِ وَالأَرْضِ وَهُوَ العَزِيزُ الحَكِيمُ} ٥، وقال تعالى في أوّل سورة الحشر: {سَبَّحَ للهِ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ وَهُوَ العَزِيزُ الحَكِيمُ} ٦، وقال تعالى في أول سورة الصف: {سَبَّحَ للهِ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ وَهُوَ العَزِيزُ الحَكِيمُ} ٧، وقال تعالى في أول سورة الجمعة: {يُسَبِّحَ للهِ

----------
١ سورة الجمعة، الآية: (١) .
٢ سورة الصافات، الآية: (١٨٠ ـ ١٨٢) .
٣ سورة الإسراء، الآية: (١) .
٤ سورة النحل، الآية: (١ ـ ٢) .
٥ سورة الحديد، الآية: (١) .
٦ سورة الحشر، الآية: (١) .
٧ سورة الصف، الآية: (١) .

 """;

  static const String tasbih4 =
      """مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ المَلِكِ القُدُّوسِ العَزِيزِ الحَكِيمِ} ١، وقال تعالى في أول سورة التغابن: {يُسَبِّحَ للهِ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ} ٢، وقال تعالى في أول سورة الأعلى: {سَبِّحْ اسْمَ رَبِّكَ الأَعْلَى الَّذِي خَلَقَ فَسَوَّى وَالَّذِي قَدَّرَ فَهَدَى وَالَّذِي أَخْرَجَ المَرْعَى فَجَعَلَهُ غُثَآءً أَحْوَى} ٣.

قال بعض أهل العلم٤: والتسبيح ورد في القرآن على نحو من ثلاثين وجهاً، ستةٍ منها للملائكة، وتسعةٍ لنبيّنا محمد صلى الله عليه وسلم، وأربعةٍ لغيره من الأنبياء، وثلاثةٍ للحيوانات والجمادات، وثلاثةٍ للمؤمنين خاصة، وستةٍ لجميع الموجودات.

أما التي للملائكة فمنها قوله تعالى: {الَّذِينَ يَحْمِلُونَ العَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِهِ وَيَسْتَغْفِرُونَ لِلَّذِينَ آمَنُوا} ، الآية٥، وقوله: {فَإِنِ اسْتَكْبَرُوا فَالَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُ بِالَّيْلِ وَالنَّهَارِ وَهُمْ لاَ يَسْأَمُونَ} ٦، وقوله: {وَلَهُ مَن فِي السَّمَوَاتِ وَالأَرْضِ وَمَنْ عِندَهُ لاَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَلاَ يَسْتَحْسِرُونَ يُسَبِّحُونَ الَّيْلَ وَالنَّهَارَ لاَ يَفْتُرُونَ} ٧، وقوله: {وَإِنَّا لَنَحْنُ الصَّآفُونَ وَإِنَّا لَنَحْنُ المُسَبِّحُونَ} ٨.

----------
١ سورة الجمعة، الآية: (١) .
٢ سورة التغابن، الآية: (١) .
٣ سورة الأعلى، الآية: (١ ـ ٥) .
٤ انظر: بصائر ذوي التمييز للفبروزابادي (٢/٢٨٥ وما بعدها) .
٥ سورة غافر، الآية: (٧) .

 """;

  static const String tasbih5 =
      """وأما التي لنبيّنا صلى الله عليه وسلم فمنها قوله تعالى: {فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُنْ مِنَ السَّاجِدِينَ وَاعْبُدْ رَبَّكَ حَتَى يَأْتِيَكَ اليَقِينُ} ١، وقوله: {وَمِنَ الَّيْلِ فَاسْجُدْ لَهُ وَسَبِّحْهُ لَيْلاً طَوِيلاً} ٢، وقوله تعالى: {فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّاباً} ٣.

وأما التي للأنبياء فقول الله تعالى لزكريا عليه السلام: {وَسَبِّحْ بِالْعَشِيِّ وَالإِبْكَارِ} ٤، وقوله تعالى عن زكريا عليه السلام في وصيّته لقومه بالمحافظة على التسبيح: {فَأَوْحَى إِلَيْهِمْ أَنْ سَبِّحُوا بُكْرَةً وَعَشِياًّ} ٥، وقوله تعالى عن يونس عليه السلام في إنجائه من ظلمات البحر وبطن الحوت لملازمته للتسبيح: {فَلَوْلاَ أَنَّهُ كَانَ مِنَ المُسَبِّحِينَ لَلَبِثَ فِي بَطْنِهِ إِلَى يَوْمِ يُبْعَثُونَ} ٦.

وأما التي للمؤمنين فقوله تعالى: {يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللهَ ذِكْرًا كَثِيرًا وَسَبِّحُوهُ بُكْرَةً وَأَصِيلاً} ٧، وقوله تعالى: {إِنَّمَا يُؤْمِنُ بِآيَاتِنَا الَّذِينَ إِذَا ذُكِّرُوا بِهَا خَرُّوا سُجَّدًا وَسَبَّحُوا بِحَمْدِ رَبِّهِمْ وَهُمْ لاَ يَسْتَكْبِرُونَ} ٨، وقوله تعالى: {فِي بُيُوتٍ أَذِنَ اللهُ أَنْ تُرْفَعَ وَيُذْكَرَ فِيهَا اسْمُهُ يُسَبِّحُ لَهُ فِيهَا بِالغُدُوِّ

----------
١ سورة الحجر، الآية: (٩٨ ـ ٩٩) .
٢ سورة الإنسان، الآية: (٢٦) .
٣ سورة النصر، الآية: (٣) .
٤ سورة آل عمران، الآية: (٤١) .
٥ سورة مريم، الآية: (١١) .
٦ سورة الصافات، الآية: (١٤٣،١٤٤) .
٧ سورة الأحزاب، الآية: (٤١،٤٢) .
٨ سورة السجدة، الآية: (١٥) .

 """;

  static const String tasbih6 =
      """وَالآصَالِ رِجَالٌ لاَ تُلْهِيهِمْ تِجَارَةٌ وَلاَبَيْعٌ عَنْ ذِكْرِ اللهِ وَإِقَامِ الصَّلاَةِ} ١، الآية.

وأما التي في الحيوانات والجمادات فمنها قوله تعالى: {تُسَبِّحُ لَهُ السَّمَوَاتُ السَّبْعُ وَالأَرْضُ وَمَن فِيهِنَّ وَإِن مِن شَيْءٍ إِلاَّ يُسَبِّحُ بِحَمْدِهِ وَلَكِن لاَ تَفْقَهُونَ تَسْبِيحَهُمْ إِنَّهُ كَانَ حَلِيماً غَفُوراً} ٢، وقوله تعالى: {إِنَّا سَخَّرْنَا الجِبَالَ مَعَهُ يُسَبِّحْنَ بِالعَشِيِّ وَالإِشْرِاقِ وَالطَّيْرَ مَحْشُورَةً كُلٌّ لَهُ أَوَّابٌ} ٣، وقوله تعالى: {أَلَمْ تَرَ أَنَّ اللهَ يُسَبِّحُ لَهُ مَن فِي السَّمَوَاتِ وَالأَرْضِ وَالطَّيْرُ صَآفَّاتٍ كُلٌّ قَدْ عَلِمَ صَلاَتَهُ وَتَسْبِيحَهُ وَاللهُ عَلِيمٌ بِمَا يَفْعَلُونَ} ٤.

وأما التي لعموم المخلوقات فمنها قوله تعالى: {سَبَّحَ للهِ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ وَهُوَ العَزِيزُ الحَكِيمُ} ٥، وقوله تعالى: {يُسَبِّحُ للهِ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ لَهُ المُلْكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كَلِّ شَيْءٍ قَدِيرٌ} ٦.

وقد ذكر الله تعالى لفظة {سُبْحَانَ} في القرآن في خمسة وعشرين موضعاً، في ضمن كلِّ واحد منها إثباتُ صفة من صفات المدح، أو نفيُ صفة من صفات الذم٧، ومنها قوله تعالى: {سُبْحاَنَهُ بَلْ لَهُ مَا فِي السَّمَوَاتِ وَالأَرْضِ كُلٌّ لَهُ قَانِتُونَ} ٨، وقوله تعالى: {سُبْحَانَ رَبِّكَ رَبِّ

----------
١ سورة النور، الآية: (٣٦،٣٧) .
٢ سورة الإسراء، الآية: (٤٤) .
٣ سورة ص، الآية: (١٨،١٩) .
٤ سورة النور، الآية: (٤١) .
٥ سورة الحشر، الآية: (١) .
٦ سورة التغابن، الآية: (١) .
٧ انظر: بصائر ذوي التمييز للفيروزابادي (٣/١٧٦) .
٨ سورة البقرة، الآية: (١١٦) .

 """;

  static const String tasbih7 =
      """العِزَّةِ عَمَّا يَصِفُونَ وَسَلاَمٌ عَلَى المُرْسَلِينَ وَالحَمْدُ للهِ رَبِّ العَالَمِينَ} ١، وقوله تعالى: {سُبْحَانَ اللهِ عَمَّا يُشْرِكُونَ} ٢، وقوله تعالى: {فَسُبْحَانَ اللهِ حِينَ تُمْسُونَ وَحِينَ تُصْبِحُونَ وَلَهُ الحَمْدُ فِي السَّمَوَاتِ وَالأَرْضِ وَعَشِياًّ وَحِينَ تُظْهِرُونَ} ٣، وقوله تعالى: {سُبْحَانَ رَبِّ السَّمَوَاتِ وَالأَرْضِ رَبِّ العَرْشِ عَمَّا يَصِفُونَ} ٤، وقوله تعالى: {دَعْوَاهُمْ فِيهَا سُبْحَانَكَ اللَّهُمَّ وَتَحِيَّتُهُمْ فِيهَا سَلاَمٌ} ٥.

إنَّ هذه النصوص القرآنية الكريمة وما جاء في معناها في كتاب الله لتدل أوضح دلالة على جلالة قدر التسبيح، وعظيم شأنه من الدين، وأنَّه من أجَلِّ الأذكار المشروعة، ومن أنفع العبادات المقربة إلى الله عز وجل، فسبحان من أفاض على عباده النعمة، وكتب على نفسه الرّحمة، سبحانه وبحمده عددَ خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته.

وسوف نواصل إن شاء الله بيان فضل التسبيح ومكانته من خلال ما ورد في ذلك من حديث رسول الله صلى الله عليه وسلم الذي ترك أمته على المحجة البيضاء والطريقة الواضحة الغراء، وقد كان صلوات الله وسلامه عليه أعلم الناس بالله، وأتقاهم له، وأكثرهم تسبيحاً وتقديساً وتنزيهاً لربِّه، فصلّى الله وملائكتُه وأنبياؤُه ورسلُه والصالحون من عباده عليه، وعلى آله وصحبه وسلّم تسليماً كثيراً.

----------
١ سورة الصافات، الآية: (١٨٠ ـ ١٨٢) .
٢ سورة الطور، الآية: (٤٣) .
٣ سورة الروم، الآية: (١٧،١٨) .
٤ سورة الزخرف، الآية: (٨٢) .
٥ سورة يونس، الآية: (١٠) .

 """;

  static const String tasbih8 = """٣٨/ من فضائل التسبيح في السُّنَّة

تناولت فيما سبق بيان فضل التسبيح وعظيم أجره، وأنَّه مِن أفضلِ الأذكار المأثورة، ومِن أنفع العبادات المشروعة، ومِن أجلِّ الطاعات التي يحبُّها اللهُ من عباده، وقد أوردتُ جملةً طيِّبةً من النصوص القرآنيَّة الكريمة الدّالة على ذلك.

ولعلّ من المناسب هنا أن نقف على بعض النصوص النبويّة الواردة في فضل التسبيح والدّالة على عظيم شأنه ورفيع مكانته. إذ السنّة مليئةٌ بالنصوص الدّالة على عظيم شأن التسبيح، وشريف قدره، وجزيل ثواب أهله، وبيان ما أعدّ الله لهم من أجورٍ كريمةٍ، وأفضالٍ عظيمةٍ، وعطايا جمَّةٍ. وقد تضمّنت تلك النصوص الدلالةَ على ذلك من وجوهٍ كثيرةٍ:

ومن ذلك أنَّ النبيّ صلى الله عليه وسلم أخبر أنَّ التسبيح أفضل الكلام وأحبُّه إلى الله، وقد سبق أنْ مرَّ معنا قولُ النبيِّ صلى الله عليه وسلم: "أحبُّ الكلام إلى الله أربع: سبحان الله، والحمد لله، ولا إله إلاّ الله، والله أكبر"١.

وثبت في صحيح مسلم من حديث أبي ذرٍّ أنَّ رسول الله صلى الله عليه وسلم سُئِل: أيُّ الكلام أفضل؟ قال: "ما اصطفى الله لملائكته أو لِعباده: سبحان الله وبحمده"٢.

وفي لفظ آخر للحديث أنَّ أبا ذرّ قال: قال رسول الله صلى الله عليه وسلم: "ألا

----------
١ صحيح مسلم (رقم:٢١٣٧) .
٢ صحيح مسلم (رقم:٢٧٣١) .

 """;

  static const String tasbih9 =
      """أُخبرُك بأحبِّ الكلام إلى الله؟ قلتُ: يا رسول الله أخبرني بأحبِّ الكلام إلى الله. قال: إنَّ أحبَّ الكلام إلى الله: سبحان الله وبحمده"١. فدلّ هذا الحديث على عظيم مكانة هذه الكلمة عند الله عز وجل.

ومِن فضائل التسبيح ما أخبر به النبيُّ صلى الله عليه وسلم أنَّ مَن قال: سبحان الله وبحمده في يومٍ مائة مرّة حُطَّت عنه ذنوبُه ولو كثُرت. ففي الصحيح من حديث أبي هريرة رضي الله عنه أنَّ النبيَّ صلى الله عليه وسلم قال: "مَن قال: سبحان الله وبحمده في يوم مائة مرّة حُطَّت خطاياه وإن كانت مِثلَ زَبَدِ البحر" ٢.

وثبت عنه صلى الله عليه وسلم أنَّ من قالها في الصّباح مائة مرّة وفي المساء مائة مرّة، لم يأتِ أحدٌ يومَ القيامة بأفضلَ مما جاء به، إلاّ مَن قال مثل ذلك وزاد عليه. فقد روى مسلم في صحيحه من حديث أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: " مَن قال حين يُصبحُ وحين يُمسي: سبحان الله وبحمده مائة مرّة لم يأتِ أحدٌ يومَ القيامة بأفضلَ مما جاء به، إلاّ أَحدٌ قال مثل ما قال أو زاد عليه"٣.

وثبت عنه صلى الله عليه وسلم أنَّ من قالها في يومٍ مائة مرّة كُتبت له ألفُ حسنةٍ أو حُطَّت عنه ألفُ خطيئةٍ، والحسنةُ بِعشر أمثالها. روى مسلم في صحيحه عن سعد بن أبي وقَّاص رضي الله عنه قال: كُنَّا عند رسول الله صلى الله عليه وسلم فقال: "أيَعجزُ أحدُكم أن يكسب كلَّ يومٍ ألفَ

----------
١ صحيح مسلم (رقم:٢٧٣١) .
٢ صحيح البخاري (رقم:٦٤٠٥) ، وصحيح مسلم (رقم:٢٦٩١) .
٣ صحيح مسلم (رقم:٢٦٩٢) .

 """;

  static const String tasbih10 =
      """حسنةٍ؟ فسأله سائلٌ من جلسائِه: كيف يكسب أحدُنا ألفَ حسنة؟ قال: يسبِّح مائة تسبيحة فيُكتبُ له ألفُ حسنةٍ أو يُحطُّ عنه ألفُ خطيئةٍ" ١.

ومما ورد في فضل التسبيح إخبار النبيِّ صلى الله عليه وسلم عن ثِقل التسبيح في الميزان يوم القيامة مع خفّة ويسر العمل به في الدنيا. ففي الصحيحين عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: "كلمتان حبيبتان إلى الرّحمن، خفيفتان على اللّسان، ثقيلتان في الميزان: سبحان الله وبحمده، سبحان الله العظيم "٢.

وقوله صلى الله عليه وسلم في الحديث: "كلمتان" هي خبرٌ مقَدَّمٌ مُبتَدَؤُه "سبحان الله وبحمده سبحان الله العظيم"، قال بعض أهل العلم: "والنكتة في تقديم الخبر تشويقُ السّامع إلى المبتدأ، وكلَّما طال الكلام في وصف الخبر حسُن تقديمه؛ لأنَّ كثرةَ الأوصاف الجميلة تزيد السّامع شوقاً"٣. وقد وُصفت الكلمتان في الحديث بثلاثة أوصاف جميلةٍ عظيمةٍ، وهي أنَّهما حبيبتان إلى الرحمن خفيفتان على اللسان ثقيلتان في الميزان.

وقد خُصَّ لفظ الرحمن بالذِّكر هنا؛ لأنَّ المقصود من الحديث بيانُ سِعة رحمة الله تعالى على عباده حيث يجازي على العمل القليل بالثواب الجزيل، والأجر العظيم، فما أيسرَ النطق بهاتين الكلمتين على اللسان، وما أعظم أجر ذلك وثوابه عند الكريم الرحمن، وقد وُصفت الكلمتان في الحديث بالخفّة والثقل، الخفّةِ على اللسان

----------
١ صحيح مسلم (رقم:٢٦٩٨) .
٢ صحيح البخاري (رقم:٦٤٠٦) ، وصحيح مسلم (رقم:٢٦٩٤) .
٣ فتح الباري لابن حجر (١٣/٥٤٠) .

 """;

  static const String tasbih11 =
      """والثقلِ في الميزان، لبيان قلّة العمل وكثرة الثواب. فما أوسعَ فضلَ الله، وما أعظمَ عطاءَه.

ومن فضائل هذه الكلمة العظيمة، ما رواه الترمذي، وابن حبّان، والحاكم، وغيرهم، من طريق أبي الزبير عن جابر رضي الله عنه عن النبيِّ صلى الله عليه وسلم أنَّه قال: "مَن قال: سبحان الله العظيم وبحمده غُرست له نخلةٌ في الجنَّةِ "١، وله شاهدان:

أحدهما: من حديث عبد الله بن عمرو بن العاص ـ رضي الله عنهما ـ موقوفاً، خرّجه ابن أبي شيبة في مصنَّفه٢.

والآخر: من حديث معاذ بن سهل مرفوعاً، خرّجه الإمام أحمد في مسنده٣.

ومن فضائل هذه الكلمة ما رواه الطبراني، والحاكم، من حديث نافع بن جُبير بن مطعم، عن أبيه، قال: قال رسول الله صلى الله عليه وسلم: "مَن قال سبحان الله وبحمده، سبحانك اللهمّ وبحمدك، أشهد أن لا إله إلاّ أنت، أستغفرك وأتوب إليك، فقالها في مجلس ذكرٍ كانت كالطّابع يطبع عليه، ومَن قالها في مجلس لغوٍ كانت كفَّارة له".

----------
١ سنن الترمذي (رقم:٣٤٦٤) ، وصحيح ابن حبان (رقم:٨٢٦،٨٢٧) ، ومستدرك الحاكم (١/٥٠١) ، وصححه العلاّمة الألباني في السلسلة الصحيحة (رقم:٦٤) .
٢ المصنف (٦/٥٦) .
٣ المسند (٣/٤٤٠) .

 """;

  static const String tasbih12 =
      """قال الحاكم: "هذا حديث صحيح على شرط مسلم، ولم يخرجاه"، ووافقه الذهبي، وصحّحه العلاّمة الألبانيُّ١.

وروى الترمذي وابن حبان والحاكم عن أبي هريرة رضي الله عنه عن النبيِّ صلى الله عليه وسلم أنَّه قال: "مَن جلس في مجلس فكثُر فيه لغَطُه، فقال قبل أن يقوم من مجلسه ذلك: سبحانك اللهمّ ربّنا وبحمدك، أشهد أن لا إله إلاّ أنت، أستغفرك وأتوب إليك، إلاّ غُفر له ما كان في مجلسه ذلك"٢.

فهذه جملةٌ من الأحاديث الواردة في التسبيح والدّالة على عظيم فضله وثوابه عند الله، وفي أكثر هذه الأحاديث قُرن مع التسبيح حمدُ الله تعالى؛ وذلك لأنَّ التسبيح هو تنزيه الله عن النقائص والعيوب، والتحميدُ فيه إثباتُ المحامد كلّها لله عز وجل، والإثبات أكملُ مِنَ السّلب، ولهذا لم يَرِد التسبيحُ مجرّداً، لكن ورد مقروناً بما يدلّ على إثبات الكمال، فتارةً يُقرنُ بالحمد كما في هذه النصوص، وتارةً يُقرنُ باسم من الأسماء الدّالة على العظمة والجلال، كقول: سبحان الله العظيم، وقول: سبحان ربّي الأعلى، ونحو ذلك٣.

والتنزيه لا يكون مدحاً إلاّ إذا تضمّن معنىً ثبوتيًّا، ولهذا عندما نزَّه الله تبارك وتعالى نفسه عمّا لا يليق به ممّا وصفه به أعداء الرُّسل

١ المعجم الكبير (رقم:١٥٨٦) ، والمستدرك (١/٥٣٧) ، والسلسلة الصحيحة (رقم:٨١) .
٢ سنن الترمذي (رقم:٣٤٣٣) ، وصحيح ابن حبان (رقم:٥٩٤) ، والمستدرك (١/٥٣٦) ، وصححه العلامة الألباني في صحيح الجامع (رقم:٦١٩٢) .
٣ انظر: جامع العلوم والحكم لابن رجب (ص:٢٠٤) .

 """;

  static const String tasbih13 =
      """سلَّم على المرسلين الذين يثبتون لله صفات كماله ونعوت جلاله على الوجه اللاّئق به، وذلك في قوله تعالى: {سُبْحَانَ رَبِّكَ رَبِّ العِزَّةِ عَمَّا يَصِفُونَ وَسَلاَمٌ عَلَى المُرْسَلِينَ وَالحَمْدُ للهِ رَبِّ العَالَمِينَ} ١، وفي هذه الآية أيضاً حمد الله نفسه بعد أن نزّهها؛ وذلك لأنَّ الحمدَ فيه إثباتُ كمال الصفات، والتسبيحَ فيه تنزيه الله عن النّقائص والعيوب، فجمع في الآية بين التنزيه عن العيوب بالتسبيح وإثبات الكمال بالحمد، وهذا المعنى يرِد في القرآن والسنّة كثيراً، فالتسبيحُ والحمدُ أصلان عظيمان وأساسان متينان يقوم عليهما المنهجُ الحقُّ في توحيد الأسماء والصفات، وبالله وحده التوفيق.

----------
١ سورة الصافات، الآيات (١٨٠ ـ ١٨٢) .

 """;

  static const String tasbih14 = """٤٠ / معنى التسبيح

لا ريب أنَّ التسبيح يُعدُّ من الأصول المهمّة والأُسُس المتينة التي ينبني عليها المُعتَقَد فيما يتعلّق بمعرفة الربّ تبارك وتعالى وأسمائه وصفاته، إذ إنَّ المُعتَقَدَ في الأسماء والصفات يقوم على أصلين عظيمين وأساسين متينين هما الإثبات للصفات بلا تمثيل، وتنزيه الله عن مشابهة المخلوقات بلا تعطيل.

والتسبيح هو التنزيه، فأصل هذه الكلمة من السَّبح وهو البُعد، قال الأزهري في تهذيب اللغة: "ومعنى تنزيه الله من السوء تبعيده منه، وكذلك تسبيحه تبعيده، من قولك: سبحتُ في الأرض إذا أبعدتَ فيها، ومنه قوله جلّ وعزّ: {وَكُلٌّ فِي فَلَكٍ يَسْبَحُونَ} ١، وكذلك قوله: {وَالسَّابِحَاتِ سَبْحاً} ٢") ٣.

فالتسبيح هو إبعادُ صفات النقص من أن تُضافَ إلى الله، وتنزيهُ الربِّ سبحانه عن السوء وعمَّا لا يليقُ به، "وأصلُ التسبيح لله عند العرب التنزيه له من إضافة ما ليس من صفاته إليه، والتبرئة له من ذلك"٤.

وقد ورد هذا المعنى في تفسير التسبيح في حديث يُرفع إلى

----------
١ سورة: يس، الآية: (٤٠) .
٢ سورة: النازعات، الآية: (٣) .
٣ تهذيب اللغة (٤/٣٣٨) .
٤ جامع البيان لابن جرير (١/٢١١) .

 """;

  static const String tasbih15 =
      """ النبيِّ صلى الله عليه وسلم إلاَّ أنَّ في إسناده كلاماً، فقد روى الحاكمُ في المستدرك عن عبد الرحمن بن حمّاد، ثنا حفص بن سليمان، ثنا طلحة بن يحيى بن طلحة، عن أبيه، عن طلحة بن عبيد الله رضي الله عنه قال: سألتُ رسولَ الله صلى الله عليه وسلم عن تفسير سبحان الله، فقال: "هو تنزيه الله عن كلِّ سوءٍ". قال الحاكم صحيح الإسناد ولم يخرجاه. وتعقّبه الذهبي في تلخيصه للمستدرك بقوله: "بل لم يصح فإن طلحة منكر الحديث، قاله البخاري، وحفصٌ واهي الحديث، وعبد الرحمن قال أبو حاتم: منكر"١.

ورويَ الحديث من وجه آخر مرسلاً.

وورد في هذا المعنى آثارٌ عديدةٌ عن السلف رحمهم الله، روى جملةً منها الطبريُّ في تفسيره والطبرانيُّ في كتابه الدعاء في باب: تفسير سبحان الله٢، وغيرهما من أهل العلم، منها:

ما جاء عن ابن عباس رضي الله عنهما أنه قال: "سبحان الله: تنزيه الله عزّ وجلّ عن كُلِّ سُوءٍ".

وعن عبد الله بن بريدة أنَّ رجلاً سأل علياًّ رضي الله عنه عن سبحان الله فقال: "تعظيم جلال الله".

وجاء عن مجاهد أنه قال: "التسبيح انكفاف الله من كلِّ سوءٍ". قال ابن الأثير في النهاية: "أي تنزيهه وتقديسه".

وعن ميمون بن مهران قال: "سبحان الله اسم يُعظَّمُ الله به،

----------
١ المستدرك (١/٥٠٢) .
٢ الدعاء للطبراني (٣/١٥٩١ وما بعدها) .

""";

  static const String tasbih16 = """ ويحاشى به من السوء".

وعن أبي عبيدة معمر بن المثنّى قال: "سبحان الله: تنزيه الله وتبرئته".

وعن محمد بن عائشة قال: "تقول العرب إذا أنكرت الشيء وأعظمته سبحان الله، فكأنّه تنزيه الله عز وجل عن كلِّ سوء، لا ينبغي أن يوصف بغير صفته".

والآثار في هذا المعنى عن السلف كثيرة.

ونقل الأزهري في كتابه تهذيب اللغة عن غير واحد من أئمّة اللغة تفسير التسبيح بالمعنى السابق وقال: "وجِماعُ معناه بُعدُه تبارك وتعالى عن أن يكون له مثلٌ أو شريكٌ أو ضِدٌّ أو نِدٌّ"١.

وبهذه النقول المتقدِّمة يتبيَّنُ معنى التسبيح والمراد به، وأنَّه تنزيه الله عز وجل عن كلِّ نقص وعيبٍ، قال شيخ الإسلام ابن تيمية رحمه الله: "والأمر بتسبيحه يقتضي تنزيهه عن كلِّ عَيبٍ وسُوءٍ، وإثباتَ المحامد التي يُحمد عليها، فيقتضي ذلك تنزيهه وتحميده وتكبيره وتوحيده"٢. اهـ كلامه رحمه الله.

وبه يتبيّن أنَّ تسبيحَ الله إنَّما يكون بتبرئة الله وتنزيهه عن كلِّ سوء وعيبٍ، مع إثبات المحامد وصفات الكمال له سبحانه، على وجهٍ يليقُ به، أمَّا ما يفعله المعطِّلةُ من أهل البدع كالمعتزلة وغيرهم من تعطيل للصفات وعدم إثبات لها وجحدٍ لحقائقها ومعانيها بحجة أنَّهم

----------
١ تهذيب اللّغة (٤/٣٣٩) .
٢ دقائق التفسير لابن تيمية (٥/٥٩) .

""";

  static const String tasbih17 =
      """ يسبِّحون الله وينزِّهونه، فهو في الحقيقة ليس من التسبيح في شيء، بل هو إنكارٌ وجحودٌ، وضلالٌ وبهتانٌ، ولذا يقول ابن هشام النحوي في كتابه مغني اللبيب: "ألا ترى أنَّ تسبيحَ المعتزلة اقتضى تعطيل كثير من الصفات"١.

ويقول ابن رجب رحمه الله في معنى قوله تعالى: {فَسَبِّحْ بِحَمْدِ رَبِّكَ} ٢ أي: "سبِّحه بما حمد به نفسه؛ إذ ليس كلُّ تسبيحٍ بمحمود، كما أنَّ تسبيح المعتزلة يقتضي تعطيل كثير من الصفات"٣.

وقوله رحمه الله: "إذ ليس كلُّ تسبيح بمحمود" كلامٌ في غاية الأهميَّة والدقَّة؛ إذ إنَّ تسبيح الله بإنكار صفاته وجحدها وعدم إثباتها أمرٌ لا يُحمد عليه فاعله، بل يُذمُّ غايةَ الذمِّ، ولا يكون بذلك من المسبِّحين بحمد الله، بل يكون من المعطّلين المنكرين الجاحدين، من الذين نزّه الله نفسه عن قولهم ووصفهم بقوله تعالى: {سُبْحَانَ رَبِّكَ رَبِّ العِزَّةِ عَمَّا يَصِفُونَ وَسَلاَمٌ عَلَى المُرْسَلِينَ وَالحَمْدُ للهِ رَبِّ العَالَمِينَ} ٤. فسبّح الله نفسه عمّا وصفه به المخالفون للرسل وسلَّم على المرسلين لسلامة ما قالوه في الله من النقص والعيب.

إنَّ تسبيحَ الله وتنزيهَه وتقديسَه وتعظيمَه يجب أن يكون وفق الضوابط الشرعيّة، وعلى ضوء الأدلّة النقليّة، ولا يجوز بحال أن يُبنى

----------
١ مغني اللبيب (١/١٤٠) ، مع أنَّه وقع في بعض ذلك، غفر الله له ورحمه.
٢ سورة: الحِجر، الآية: (٩٨) .
٣ تفسير سورة النصر (ص:٧٣) .
٤ سورة: الصافات، الآيات: (١٨٠ ـ ١٨٢) .

""";

  static const String tasbih18 =
      """ ذلك على الأهواء المجرّدة، أو الظنون الفاسدة، أو الأقيسة العقليّة الكاسدة كما هو الشأن عند أرباب البدع المعطّلين لصفات الربّ سبحانه، ومن كان يعتمد في باب التعظيم على هواه بغير هدى من الله، فإنَّه يزِلُّ في هذا الباب ويقع في أنواع من الباطل وصنوف من الضلال. جاء عن عبد الرحمن بن مهدي رحمه الله وقد ذُكر عنده أنَّ الجهميّة ينفون أحاديث الصفات، ويقولون: الله أعظم من أن يوصف بشيء من هذا أنَّه قال: "قد هلك قوم من وجه التعظيم فقالوا: الله أعظم من أن ينزل كتاباً أو يرسل رسولاً ثم قرأ: {وَمَا قَدَرُوا اللهَ حَقَّ قَدْرِهِ إِذْ قَالُوا مَا أَنزَلَ اللهُ عَلَى بَشَرٍ مِن شَيْءٍ} ١ ثم قال: هل هلكت المجوس إلاّ من جِهة التعظيم؟ قالوا: الله أعظم من أنْ نعبُدَه، ولكن نعبدُ من هو أقربُ إليه منّا، فعبدوا الشمس وسجدوا لها، فأنزل الله عز وجل: {وَالَّذِينَ اتَّخَذُوا مِن دُونِهِ أَوْلِيَاءَ مَا نَعْبُدُهُمْ إِلاَّ لِيُقَرِّبُونَا إِلَى اللهِ زُلْفَى} ٢") ٣.

وفي كلامه هذا رحمه الله إشارة إلى أنّ التعظيم والتنزيهَ إنْ لم يكن على هديِ الكتاب والسنة فإنّه يكون غاية التعطيل، ومنتهى الجحود والعياذ بالله، ومن يتأمّل حالَ الطوائف الضالّة والفرق المنحرفة التي سلكت في التنزيه والتعظيم هذا الطريق يجد أنهم لم يستفيدوا من ذلك سوى التنقّص لربّ العالمين وجحد صفات كماله ونعوت جلاله، حتى

----------
١ سورة: الأنعام، الآية: (٩١) .
٢ سورة: الزمر، الآية: (٣) .
٣ ذكره التيمي في الحجة في بيان المحجّة (١/٤٤٠) .

""";

  static const String tasbih19 =
      """ آل الأمر ببعضهم في التنزيه إلى الاعتقاد بأنّه ليس فوق العرش إله يُعبد ولا ربٌّ يُصلى له ويُسجدُ تعالى الله عمّا يقولون، وسبحان الله عمّا يصفون.

إنّ التسبيحَ طاعةٌ عظيمةٌ وعبادةٌ جليلةٌ، والله تبارك وتعالى يحبُّ المسبّحين، والواجب على عبد الله المؤمن أن يكون في تسبيحه لربّه على هديٍ مستقيمٍ، فيُسبّح الله وينزّهه عن كلِّ ما لا يليقُ به من النقائص والعيوب ويُثبتُ له مع ذلك نعوتَ جلاله وصفات كماله، ولا يتجاوزُ في ذلك كلِّه كتاب الله وسنّة رسوله صلى الله عليه وسلم، كما قال الإمام أحمد رحمه الله: "لا يُوصف الله إلا بما وصف به نفسه أو وصفه به رسولُه صلى الله عليه وسلم لا يُتجاوَزُ القرآن والحديث"١. ومن كان على ذلك فهو على هدي قويمٍ، وعلى صراطٍ مستقيمٍ.

----------
١ ذكره شيخ الإسلام في الحموية، انظر: مجموع الفتاوى (٥/٢٦) .

""";

  static const String tasbih1 = """ 
          من كتاب  فقه الأدعية والأذكار
        [عبد الرزاق بن عبد المحسن البدر]                   

""";
}
